{
  "category": "fpl_main",
  "scraped_at": "2026-02-20T18:49:40.610839+00:00",
  "days_back": 14,
  "video_count": 2,
  "transcript_count": 2,
  "videos": [
    {
      "id": "fGNDJchUDBg",
      "title": "FPL CHIP STRATEGY! 🍟 Double & Blank Gameweeks Confirmed ✅ GW27 Tips #fpl",
      "channel": "FPL Mate",
      "channel_id": "UCweDAlFm2LnVcOqaFU4_AGA",
      "published_at": "2026-02-20T17:17:39+00:00",
      "transcript": "You have chips to use in FPL and I'm here to help you choose when to use them. So, let's look at all of the important game weeks. Coming up in gameweek 31, we are going to see a blank gameweek. Arsenal and Wolves will not have a fixture this week and there's a 90% chance that Man City and Crystal Palace won't either. Yes, I said it. There is a 10% chance that City and Palace can still play in gameweek 31, but it would require that Man City be knocked out of the FA Cup by Newcastle or both teams being knocked out of Europe before the quarterfinals. There will be some temptation to play the free hit here to temporarily move your non-playing players, but you must resist because if you think we will have problems in Gameweek 31, wait until you hear about its big brother, Gameweek 34. Gameweek 34 is going to be the biggest blank gameweek of the season. We are currently predicting that eight teams will have no fixture during that week. Your team is going to be on its knees in gameweek 34. But it gets worse because the teams and the players who will blank in gameweek 34 will be the very same teams and players who will have a double gameweek just one week earlier. So in other words, the kind of players you will want to have in gameweek 33 will be the complete opposite of the players you will want in gameweek 34. You're going to need to make a quick transition between one squad in gameweek 33 and an entirely different one in gameweek 34. Gameweek 34 is going to be amazing with up to 10 teams with two fixtures each. It is going to be pretty much essential to use a wild card or free hit here to manage the transition between these two gameweeks. So, make sure you keep one of those chips in your back pocket. Finally, we have gameweek 36, which has a small chance of being another double gameweek, though the chances are dwindling due to cup ties. There's probably less than 50% chance that this ends up being a double, but maybe an unexpected double can spring up elsewhere. Again, that will depend on cup results that happen in the future, but I'm not from the future. But what I can tell you right now is that it looks like the best chip strategy is to use your transfers to remove blanking players in gameweek 31, ensuring you have 11 playingers. Then wild card in gameweek 32 with loads of double gameweek players ready to bench boost in gameweek 33. Free hit in gameweek 34 to remove all of those same players who are now blanking and triple captain whenever we see another double gameweek. Probably gameweek 36, but maybe elsewhere. No worries if you don't have that chip anymore. If not, just vibes that particular chip if you do still have it. Make sure to follow for more FPL tips and chip strategy. And if you want to know specifically which teams are likely to double and blank, as well as some more chip strategies, I uploaded a fulllength video discussing all of this on the SPLMate YouTube"
    },
    {
      "id": "wWprw0Mz86o",
      "title": "FPL GW27 TEAM SELECTION | Makings MORE Transfers! ✅ | My Gameweek 27 Squad",
      "channel": "FPL Mate",
      "channel_id": "UCweDAlFm2LnVcOqaFU4_AGA",
      "published_at": "2026-02-19T20:23:04+00:00",
      "transcript": "Gameweek 27 is here and after a disappointing triple captain experience, we need to move on and make some transfers immediately. So guys, plenty to talk about today as we lock in for FPL gameweek 27. So let's start off right here. My gameweek 26 scores. It was a green arrow for me, a cheeky little green arrow, but a green arrow nonetheless. We sit on the prefaces of the top 100k um which we haven't been in all season. So we're really looking to break into that top 100k um pretty early in the season I would say. And it's going to take another week. It's going to take another week before we get there. So uh hopefully one more week and we will get there. The famous promised land of the top 100k. But regardless guys, I think we do need to address the 6'3 Brazilian elephant in the room and his name is Gabrielle. Triple captain, seven points times three equals 21. It's not the best score in the world. Let's be perfectly honest. This is not a triple captain success or anything like that. But if you've come here to delight in the misery of an FPL manager so disappointed, so distraught about their triple captain, you kind of come to the wrong place. You guys should know by now if you're regulars of the channel that I usually try and put a positive spin on things and that's exactly what we're going to do today. So, first of all, do I think it was a bad decision to triple captain Gabrielle? Um, no. No, I I absolutely don't. I think the logic was there. I think the logic was sound and I think actually Gabrielle triple captain was maybe a little unfortunate not to get more points than they actually did. Um, so I think the decision was sound particularly as it's looking likely that, you know, later on in the season we might get an additional double game week. We'll definitely get one double game week, but I'm using the bench boost in that double game week anyway. There maybe a 50/50 chance we get additional double game week. the opportunity for future double gameweeks to use the triple captainship on aren't automatically there anyway. So, I just took the opportunity that I thought looked pretty good right now. So, I'm happy with the decision- making and you know I thought you know even with the benefit of hindsight could have gone a lot better. It really could have. So, don't I'm not judging the uh the decision by the outcome. I think that would be a pretty wrong way to kind of look at things. And also, do I really think it's a disappointing score? Seven points. Look, it's not great. It's really not. But those of you guys who have played FBL for a long time will know it gets a lot worse. I mean, uh, Emanuel Dennis, anyone from a couple of seasons ago, getting minus points when people triple captain him. Sadadio Mané getting injured in the first game week of a double gameweek. Oh, man. There's been so many. And please feel free to share your triple captain disasters in the uh in the comments. Um, even earlier this season, remember that game against Leeds where Harland only scored two points? Uh, it was a that was really disappointing for a lot of people. So, it does get a lot worse. Seven points. It's not a great triple captain. Let's not beat around the bush here, but it gets a lot worse. So, to call this the ultimate disaster or anything like that is nothing short of an exaggeration. But, I want to go on to this guys. And what I've got in front of you guys is some triple captain maths or math uh in the singular for our American friends. Um, so let's look at this situation guys and actually work out how big of a deal is this triple captain failure, if you want to call it that. Is it a big deal? Now, I say every season that the triple captain is, in my opinion, the weakest chip by some distance. And I'm going to kind of show you why I believe that to be true. So, let's look at this. So, gameweek 26. If you owned him, you got seven points from him. If you captained him, you got 14 points from him. And if you triple captained him, you got 21 points from him. Great. Maths make sense so far. Now, let's look at some hypotheticals. A world in which there is another captain opportunity that does much better than Gabrielle. So, let's say gameweek 36 ends up being a double gameweek. And if you guys have watched my chip strategy video that I posted earlier this week, you'll kind of know all about the potential of gameweek 36. So, we'll talk about gameweek 36. Hypothetical Harland. He has this nice double gameweek and he gets 12 points, which I think most people 12 points would consider a successful triple captain. Most people at least. Um, owning him would get you 12 points. If you captain him, you'd get 24 points. If you triple captain him, you'll get 36 points from him. So, that looks pretty good. 15 points more than the Gabrielle triple captain. That's a big improvement, right? It can go even further. Let's take gameweek 36 hypothetical Harland number two, who gets 17 points. A real big hall. That would be what? Two goals and uh five bonus points as well as four points for playing in that gameweek. Really nice 17 points. And that is a resounding triple captain success. You'll be really, really pleased with that one. If you own him, 17 points. If you captained him for that week, you'd get 34 points. And if you triple captain him, you get 51 points. What's a big improvement from the 21 points gained from Gabrielle. You'd be 30 points up, right? Wrong. And this is why the triple captain is not that much of a big deal, guys. I know. I know I'm I'm downplaying it, but this is the reality. So, let's do some maths here. Scenario A. And now, this scenario is a scenario in which you triple captained Gabrielle and you got 21 points from him. And you and in gamew week 36, you triple captain the hypothetical Harland number one who got 12 points and you get 24 points. So in this scenario, you got your 21 points for triple captaining Gabrielle. You get your 24 points for just the regular captain on hypothetical Harland one and you got a total of 45 points. Okay, now let's just move on to scenario B where you only used your regular captain on Gabrielle. You got 14 points from him and you saved your triple captain for this much better score of 12 points. You got 36 points from your triple captain in gameweek 36. You saved your triple captain for 36. You got more points than Gabrielle. Everything's amazing. And you've got 50 points now. Wait, 50 points? That's only five points more than scenario A. You picked a what can only be considered a successful triple captain and yet you're only rewarded with five points. That doesn't quite make sense, does it? Surely. Okay, let's just make make the hypothetical more serious. Let's take hypothetical Harland number two. So, you use your regular captain on Gabrielle in 26. You get 14 points from him. Disappointing, but massively exciting. You get this 17 point triple captain from Harland, getting you 51 points from him in gaming 36. Amazing, right? You've got 55 points total and only 10 points more than those who supposedly failed their triple captain. The failures of the triple captain are only on 10 less points than those who had the most enormous of enormous successes with their triple captain. And there's only a 10point difference there. That is the reality of the situation when picking a triple captain because the triple captain is not that powerful. As long as you own the players who you think are going to do really well and if you think gameweek 36 is a good week for Harland, you are going to own him. And if you think he is triple captainable, whether you've used your triple captain already or not, then you're going to have him and you're going to captain him as well. So, you're still going to get captain points from him and therefore you're not actually going to be losing out on that many points compared to some people who failed. Now, of course, there are a million other different ways of calculating it in, you know, for different versions of players with different amounts of points or whatever and different players as well. So, there's a whole bunch of different uh scenarios that you could kind of conjure up. But the point is that in every scenario, the difference isn't actually that big. And in all of these scenarios, we're assuming that Harland or hypothetical Harland or whoever you end up triple captaining in the future outscores the seven points and gets more points than seven points. Yet in previous years, we've got countless times where we have seen players triple captain. They look great for triple captain and they're getting a lot less points than seven. Let me tell you that right now. So this is my point, guys. It's not a big deal. a 10-point swing in the worst, not the worst case scenario, but in a really bad case scenario where the where the the next triple captain opportunity scores 17 points in that really really bad scenario where I've really really supposedly messed up my triple captain choice and and you know made a huge mistake on who to pick. I've only lost out on 10 points and I'm supposed to sit here and be upset by that that you know I've lost out on 10 points. I mean, 10 points is is no big deal. Or at least I should tell myself that because look at this guys. Going back to my team from gameweek 26, I made a transfer in gameweek 26. And I I removed Malik Chow to bring in Chris Richards. I thought Chiao wasn't getting defcons, wasn't getting attacking returns, wasn't getting clean sheets, looking pretty rubbish with Newcastle in general. And Richards has this amazing fixture against Burnley, who are obviously rubbish. And Richard's always getting defensive contributions. It's going to be an amazing transfer. Ciao got 11 points. Richard's got zero points. I lost out on 11 points from my gameweek 26 transfer. And I'm meant to be upset, but my triple captain failed. My triple captain is, you know, in so rare scenarios will I be able to make up that many points from the rich. I would need the alternative triple captain choice to score 12 more points than Gabrielle. So, 19 points. If there was another opportunity that I would have maybe gone for where a triple captain opportunity scores 19 points, that would be the only way to make that triple captain decision technically worse when we look at the outcome than my choer riches decision. So, how can I be upset with my triple captain score when actually it's really nothing compared to just one individual transfer that I made on one individual gameweek? And this is the kind of point I'm trying to make here, guys. People talk about triple captain fails as being the the uh the be all and end all that can define their season, but pretty much every transfer that you make will have more of an impact on your team, on your score, whether that's in the short term or the long term, than any triple captainship. A transfer in one week for me was a bigger deal than a disaster triple captain scenario. Because a disaster triple captain scenario is actually very little when we compare it to the entire amount of points you're going to get throughout the season. If I even take a 20 point swing on a triple captain and that would require the next triple captain opportunity scoring 27 points which happens once every however many years. It's so so rare and it's so rare that people actually hit on them as well. Even if that happens, I'm 20 points down from from what is supposedly a disaster to supposedly the dream scenario. You will get those point swings near enough every game recon transfers alone. So, triple captain. There we go, guys. I said it. I'm sorry. I'm sorry. I I know people are going to say, \"Dan, you're just you're just coping. This is just copium.\" It's not a big deal. I am genuinely more frustrated with myself for the child to Richards transfer than I am anything to do with the triple captain. And given that pretty much half of FPL, triple captain Gabrielle anyway, you're kind of in a good position. So look, I know there will be a lot of people who didn't use their triple captain who will be feeling quite smug right now. Look, that's fair enough. The FPL is about being competitive and you should take every victory you should and you should enjoy it, too. But if you have used your triple captain, I don't think you should feel too disappointed or upset by it because ultimately it's not really that much of a big deal. Like your transfers are far more important than any triple captain chip you use. And certainly the other chips that you use throughout the season will be so much more impactful for so many uh other reasons. So there we go, guys. Triple captain, no big deal. Who cares? I'm on a green arrow. I'm happy. I'm going to break into the top 100K. James Hill is still smashing it. And there are smiles all around the FPL Mate channel. There you go. And by the way guys, if you do enjoy the FPL Mate content, make sure you do drop a like and subscribe to the channel if you want to follow along with my team every single game week. So, we spent a little bit of time talking about Triple Captains. I I thought it was relevant to be honest. So, we're going to spend a little less time, I guess, on my team this gameweek, but I think that's fine because um it's pretty obvious what I'm going to do. I think in terms of transfers, I know what I'm doing. So, let's check this out, guys. So, I have got Rehea in goal. Oh, by the way, I got a free transfer and loads of money in the bank. Um, too much money, some would say. Um, and I've got Rehea in goal against Spurs. It looks like a pretty good fixture right now. Obviously, Spurs with a new manager, maybe new manager bounce. Uh, Tudor, the new uh Spurs manager, is kind of known as a bit of a defensive manager. So, um, we'll see what happens there. But certainly, I wouldn't expect Spurs to magically improve in attack. Um, which is a good thing because we have got double Arsenal defense with Gabrielle. disappointing last game week, but look, I still think we're good to go with our Arsenal defenders. I wouldn't quite be too worried yet. Remember in the particularly in that second game, Arsenal conceded two goals from uh Wolves and the the two goals totaled something like 0.17 xG. So, they're really not conceding a lot of chances at all. So, Gabrielle's still good. We got Richards here at home against Wolves. Really let me down against Burnley. again another game in which uh Burnley scored three goals from again it was like 0.2xG or something like that. So crazy crazy crazy um I don't know I don't know even know what to call it other than bad luck maybe I don't know but uh yeah Richards disappointed last week but I I would definitely say that Burnley are kind of coming out and attacking a little bit more a little bit more at the moment and actually I do prefer Wolves uh as a fixture if you are a defender. So yeah, famous uh famous old words from last week with Arsenal. But yeah, I think in theory this should be a good fixture for for a defender and hopefully Richards can show that. Alder is going to be my final defender in my starting 11 because I do think this Fulhammer home fixture is good. Any home fixture for Sunderland is going to be a good one. We know that they have a very very good clean sheet record when playing at home and I don't think Fulhammer offering too much going forward at the moment. particularly Wilson has really fallen out of form and that has impacted this uh Fulham attack. Uh where are the goals coming from? Not as many places that should certainly be said. Um looking on to my bench guys, we've got Dravka. Not going to play him away against Chelsea. Anderson's going to be on the bench this game week. We'll talk about the midfield in a while. And Hill and Collins are going to remain on my bench. Now, of course, Hill has been an absolute servant for me, but I have to be totally honest with you guys. I'm not above admitting when I've been lucky. And certainly Hills attacking returns have kind of papered over the fact that defensively Bournemouth are still leaving a little bit to be desired. Let's let's put it that way. So yeah, I do think West Ham look a bit more punchy at the moment and I do think that uh there's every chance that Bournemouth do concede in that game and I just can't keep relying on those attacking returns from Hill every single game week. It's been great to have them, but you know, sometimes you just got to you kind of just got to accept your luck and maybe don't try and push it too much. Um, but certainly defensive contributions, Hill is a legend. I think he's probably good for a four-pointer this week. So, he's certainly playable, but I do think the defenders I have on pitch are maybe slightly better for this game week. Collins I'm really concerned about and really I'm going to give him one more week. I wasn't really planning on playing him this gameweek anyway, but I was looking really to play him gameweek 28, gameweek 30, and gameweek 31. Now, if he's unavailable, well, I say unavailable, if he's not back in the regular starting lineup, because he just hasn't been, um, if Andrews is still preferring the combination of center back of Ay and Vandenberg, um, then Collins is probably going to have to be a transfer out for me. So, I'm going to give it one more week, see if, you know, something can change. If you know this the current Brenford center backs either of them put in a really weak performance then that might be a case for Collins to come back into the starting 11 because it does seem that Andrews does pick players on form and whilst Collins wasn't in form and the other center backs are playing well that does keep Collins out of the team. So hopefully he can break back in. He's a obviously a fabulous FPL asset even if his footballing performances haven't necessarily been perfect recently. So hopefully we can see him back but not going to count on that this week. We need one more week of information and then I'll probably commit to a decision either next week or the week after. And I do have some options um with uh some money in the bank as well of who we can potentially move Collins towards. So, um let's check this out, guys. Um so, this is the clean sheet odds for this game week. Uh again, as always from Rob T. Really, really useful stuff here. And we see there are a fair few opportunities for clean sheets this week. Um plenty of teams above 30%. Of course, we have Chelsea at on the top there, but I've got double Arsenal defense. They have a 40% chance of a clean sheet against a Spurs team lacking a little bit of firepower. So, we kind of expect Arsenal to be right up here. Fantastic. Perfect. What we love, we've got that Crystal Palace uh Richards defense, 41% chance of a clean sheet, which is really, really nice at home against Wolves. Will definitely take that as well. These are really nice odds. Anything above 40%. You would pretty much say you have to play the defender if they have over 40% chance of a clean sheet. And outside of that, we do have a few other players. Collins at Brenford 30%, but I'm just not convinced about his minutes and worried about sub appearances from the bench. Um, we've got uh Alder 30%. I think that's more than good enough to go for. Anything 30% or above I'm I'm very happy with. And we have got of course um we got Hill who's down at 20% which I do think is a little bit harsh but um yeah, what can we say? West Ham looking good. Bournemouth still conceding chances. If we're looking at clean sheets in isolation, you have to admit that Bournemouth are probably less likely than some of my other defenders, which is fine. And again, don't want to just rely on um uh on attacking returns. But how about those defensive contributions, guys? Well, Tom Hadley has updated his uh opposition defcon rate. So, this is a table. This fantastic stuff, by the way, guys. This is a table that basically shows us how often um defenders get defensive contribution points against certain oppositions. So all of my defenders are center backs. I'm a center back merchant when it comes to FPL. Um Defcon Merchant maybe as well. So we can look here for example, let's take uh let's take our Arsenal defenders for example. We got Gabrielle center back. So central column here, center back against Spurs. And you would say that Gabrielle has a 40% chance of getting defensive contributions compared to the average center backs playing against Spurs. 40% not too bad at all. Richards against Wolves not so good. 31% and we've got Alder 24% against Bulham. So if I'm totally honest with you guys, my defcon potential isn't actually super high this week, which is not something I usually like. I usually like high defense uh defcon potential. If we had uh a a Collins playing, then maybe I'd be tempted uh to go for a Collins with with slightly better 38% chance of of of Defcon against Brighton. And of course, Hill I don't think he's that really anything special here. 35% against West Ham. So, um I do think Hill will still get Defcon by the way because he's just the defcon go of the Premier League. But anyway, that is my defender situation. Let's move on into midfield. And we have got Bruno and Burmo, Rice and Enzo. Rice a bit of a hero last week by the way. Shout out to anyone who captained him last week. Um Bruno and Burmo I think still looking good, still looking very good. I think Everton still conceding a lot of chances and although a lot of these fixtures look fairly average on paper, I think Manchester United can find solutions. I do have some minor concerns about Burmo's minutes in game week 27 just because I don't know if it's the best tactical matchup, but this game might be kind of game state dependent. I think if Man United are able to get an early goal in this game, um particularly playing away from home, um Everton will probably being the home team come out and maybe try and do something in that game. So, I do hope that uh Man United get an early goal in that game because I do think that will massively impact how the game plays out because you're not if the game is locked at nil nil or you know Everton go ahead and Burmo is certainly going to be a player who who uh really struggles to get as maybe as many chances on the transition that he might want and actually players like Bruno and Kuna might be more players who kind of thrive in those kind of situations and and Burma is really my my more differential of the Manchester United guys. Declan Rice, I think, is fine. Uh, looking at these fixtures from an attacker's point of view, I actually quite like the look of these fixtures. Spurs, Chelsea, Brighton, these are teams that do concede chances. And Rice um is certainly doing quite well for Defcon at the moment. He is playing a maybe a little more reserved role at the moment, but still on those set pieces and it is helping him to get Defcon. So, I've got myself a very expensive Elliot Anderson in midfield currently, but look, I like Elliot Anderson, so you know, if I can have a couple of him in my team, I'm not complaining. Uh Enzo is my final midfielder. A final good gameweek for Chelsea before it all goes to pot with some awful an awful run of fixtures. Um Enzo has been uh well a tale of two endzos really. I remember kind of a few weeks ago I was kind of saying Enzo has been scamming points just getting these points in the in the wild kind of wild situations getting penalties or um you know popping up in the last minute when the box is flooded with players and it just so happened to land with him and scoring goals that way. Whatever. It was great. But in the last two game weeks, it is flipped. And once again, Enzo has gone back to being the ultimate points dodger, being kind of the most creative player on the pitch and the most open play um kind of xG kind of generated as well. And yet, he's not getting goals or assists because it's all being hogged by Palmer scoring penalties and Joel Pedro getting pushed over in the box and winning penalties. It is just variance at that point. And I I I do think that, you know, if we go into this Burnley game and, you know, say there are no penalties, I don't see a reason why Enzo can't score just as well as Palmer and Joel Pedro. But let's be honest, there is a very good chance that there are penalties because Chelsea are very good at winning penalties. They're very clever when it comes to that. So, uh yeah, hopefully Enzo can can do well here. But he is really on his last legs in terms of uh how long I keep him in my FPL team because I can't really see where I'm going to play him outside of this game week. Maybe I play him against Newcastle. Maybe I play him against Everton in game 31. Don't know. But uh yeah, could be looking to sell him next week. We'll have to wait and see again for that one or at least bench him. We'll see. Going up front, we've got Erling Harland. He has been spotted back in training. So, I think things are looking a little bit more positive on Harland, but as always, we'll wait for press conferences. We'll wait for more training images and more news and stuff like that. But things are looking fairly positive on Harland. And as such, I'm not really looking to sell him. I think Newcastle at home is a good fixture for him. So, uh, yeah, hopefully expecting some good things there. Ech been dodging points as well recently, hasn't he? Missing some very big chances to score. Um, hopefully with a more favorable run of fixture coming up and I'm not sure if it necessarily starts this week. I think really from game week 28, um, the fixture run does look a little bit better for Liverpool. Um, certainly for attackers. Um I think from next week things will be really really good for Liverpool and actually taking players through to a gameweek 32 wild card. Um between now and and gameweek 31 inclusive um Liverpool players look good. Liverpool players look good. They look like they've got plenty of opportunities for goals, plenty of opportunities for clean sheets and I do really want to invest more in Liverpool players if anything and I think we'll definitely be talking about that that next week. Um going through my attackers at the moment, it's looking pretty good in general in terms of those players with um high expected goal involvement. So over the past six game weeks, we look at this table of highest expected goal involvements uh among my play oh well pretty much among all players um per start. Palmer is at the top uh due in part to three penalties and missing an open goal. So of course his XGI numbers are going to be really really high, but Ecot is still in second, so he's still getting plenty of chances. Third place is Bruno G who's injured. Harland is in fourth place. So, you know, yeah, people are kind of down on Harland. The the Dorito of death doesn't help, but yeah, he's uh he's still getting plenty of opportunities to score. Bruno's here, Enzo's here, and uh and Burmo and Rice are kind of just off the top 20 in here. So, I think in general, my team is still generating plenty of chances to score an assist, which is something that I definitely like, although I would like to add a little bit to it if I can as well. So, there's one more player who needs to be added to the team, and it is Chido Obi. Oh, wow. What is a polar bear doing in Arlington, Texas? And what is Chido Obi doing in my starting 11? Well, let's just go straight to my transfers, guys. And I'm not going to beat around the bush on this one. I'm not going to mess around. I'm not going to uh delay like I'm doing literally right now. So, yes, I will be replacing Chido Obi. And looking at the fixture ticker, and this is the fantasy football hub fixture ticker, but any fixture ticker you use will uh give a similar story from an attacking perspective. We kind of sort the teams in the Premier League by who has the best fixtures in attack between now and gameweek 31 because remember I am going to be deadending into gameweek 31 to wild card in 32. Who's top of the list? Well, it is none other than our good friends over at Brenford. Yeah. Uh well actually technically it's Aston Villa but in second place we have uh Brenford here. So yeah certainly Aston Villa and Brenford they have fabulous fixtures if you're looking to get goals. These are some of the weaker defenses. And what I like in particular about this run of fixes from Brenford is that a lot of these teams are teams that concede from central areas that concede to uh to strikers which uh is definitely uh very tempting. So, all of these teams are kind of sort of in in the um kind of bottom bottom half of the table in terms of those defenses throughout the season. These are teams that do concede goals and that we've seen kind of consistently throughout the season. They concede goals. Uh it's an incredible run of five fixes. It really is. So, as such, there is no doubt in my mind. I have the money in the bank. I have to ensure that I have playing players for gameweek 31. I know I probably should be starting to roll some transfers, maybe just play Elliot Elliot Anderson this week, but why? Okay, I have loads of money in the bank. I I know I'm going to have to sell Chido Obi before gameweek 31 because I'm going to need bodies in that gameweek. Um, so I have a full squad of 11 playingers and Obi is not going to be a playing player. Even if he has a fixture, he's not going to play in it. So Obie to Thiago. Did you guess it? Did you guess it? Uh, yeah. Obi to Thiago seems really obvious to me. It still leaves me with 1 million in the bank as well. So we're going to have some wiggle room for transfers next week. And I appreciate I'm going pretty aggressive with my transfer strategy at the moment and kind of making transfers every week. Um maybe that's a good thing, maybe it's a bad thing, but the last few game weeks have gone fairly well for me. There has been Green Arrows and the transfers I have made been bringing in players like Hill, bringing in players like Burmo, bringing players like Rice. Those three guys have been my last three transfers. They've all been successes. So I want to keep it going. I want to keep bringing in players that I like the look of, who I think are strong. I think Thiago is being massively underrated because he's blanked a few times in some difficult fixtures, but now he's got incredible fixtures and I think these fixtures can breed form. Everyone was saying the same thing about Joel Pedro a few weeks ago. They were saying he's terrible, he's rubbish, you know, even if the fixtures are good, he hasn't been performing. If you are a striker playing for a team that scores goals, you know, if you're on penalties as well in Thiago's case, and you've got a bunch of fixtures in which your team will score goals, that is a recipe for FPL points, and and that's exactly what I'm going to be counting on. I actually think Thiago played pretty well against Arsenal in gameweek 26 as well. Really unfortunate really not to get goals in that game. There was some good defensive moments from Arsenal that kind of maybe prevented uh Thiago from scoring. And now, yeah, and against Brighton, I think it might be a slightly different story. So, love this run of fixtures. I would be very confident um in bringing in Thiago. And to be honest, a lot of people do own Thiago already, and I don't want to take them on some kind of different some, well, sorry, some template popular players. I'm happy to kind of take on and try and bet against. Thiago is just not one of those guys. And I see a lot of people selling Thiago, giving up on Thiago. His stocks are pretty low right now. Um, but I'm happy to buy the dip and uh let's see if we can reap the rewards on that one. In terms of captaincy, guys, I am I am on Erling Harland for this gameweek. As long as he's fit, I think this is a good fixture for him. And given I don't really have a Palmer or a Raal Pedro, I think Harland's the obvious choice. And we're going to stick the vice captain on Bruno Fernen here as well. So, of course, guys, if you watched the team selection video last gameweek, you would have maybe even known that I was going to transfer Thiago in ahead of gameweek 27. It was kind of always part of the plan, but I just want to continue on that plan and show you what I'm thinking. And apologies if this is a bit laggy today. I'm going to have to do a lot of things manually because my internet is down at the moment, so I'm hotspotting currently. Annoying. Um, but yeah, certainly going into gameweek 28, I do have some ideas. I think Richards will certainly be on the bench. Um, I'd be more happy to play Anderson this week, but do I need to? Probably. Enzo is a problem. Um, but then in terms of transfers, what am I thinking? I think I have three options and I'm going to keep an eye on proceedings whilst we make a decision on that. So I could do Enzo to Rogers. Um that would work for my B budget. Uh Rogers is uh 7.6. So that would be exact money to do that. I could also if I'm still worried about Collins, I could do Collins to Virgil. I think that would also be a pretty good transfer. I have exact money again to do that. So fingers crossed for no price changes or I would be kind of priced out. Need to keep a very solid eye on that one. By the way, guys, let me know what you think about these transfers. And the final option, which I have a little bit, a 0.1 amount of wiggling room on, is Florian Vert in here. Uh, so here we are. Florian. And I don't know why it keeps telling me that. Um, I think the uh, Fantasy Football Hub website doesn't know my buying price on Rice. Perhaps maybe that's what's going on. Um, but yeah, I could afford vert and I would have 0.1 left in the bank to do that as well. So, um, yeah. Uh those are my kind of three options. I'm kind of leaning towards Vert. That was the original plan. Um but I kind of expected Collins to start playing by now. So it might actually be that I keep R. So I think he's absolutely fine to keep all the way until gameweek 30. Um 31 you probably would have to remove him because of the blank. Um and then Collins to Virgil might actually have to be the one after all. Or maybe we look at a different um uh Brenford defender as well. Aya is 4.4 million. If he's still performing well, maybe you could look at him. Um Anderson is maybe an option as well at Fulham. Don't massively rate and uh Fulham at the moment, but um they have the fixtures and they have uh Burnley in gameweek 31. Uh yeah, 31 as well. Um which is quite nice. So we'll have to wait and see on that one. I haven't decided yet. Those are just some rough ideas. Let me know what you think about them. Um and we'll build towards them when we come to next week's team selection video. I will have to commit to a decision and just keep making transfers. I love making transfers. It's so much fun. But anyway guys, if you did enjoy this video, do drop a like. Do subscribe if you're new around here. Check out some of the other videos we've made this week. Loads of them on the channel that I think are really going to help you to plan into not just this game week, but future gameweeks as well. Um, and aside from that, thanks and I'll see you later, mates. Bye-bye."
    }
  ]
}