{
  "category": "fpl_draft",
  "scraped_at": "2026-02-19T19:38:27.263806+00:00",
  "days_back": 14,
  "video_count": 3,
  "transcript_count": 3,
  "videos": [
    {
      "id": "Uj8qFmL4GZs",
      "title": "Draft FPL GW27 Waiver Tips",
      "channel": "Draft FC",
      "channel_id": "UC1fzfDlBWbawMMbwOczk58Q",
      "published_at": "2026-02-19T16:44:48+00:00",
      "transcript": "Welcome back to the Draft FC podcast, the podcast website and YouTube channel dedicated to all things official Draft FPL. My name is Mitch and I'm your host for another game preview going over waiver options, hidden gems, and general Premier League chat ahead of gameweek 27. First things first, thank you to those of you with uh messages of concern and worry about the absence. I think um I do have to apologize, I think, for not having the best communication. I definitely posted in the members know cuz I've been posting in the Discord and things, but um possibly could have been a bit more clear with the communication about what was going on. I did say I'd be away for a couple of weeks. That's turned into about four. Um I think I've alluded over the last best part of a year now that um I've been going through a bit of a house move and a house renovation in the background. Um, I'm now sat foreignly uh in the new house. That all started back in June. We finally moved in a week or two ago. Um, so yeah, it's been a long road, but obviously because we're renovating and moving, as much as trying to um work my day job and look after our little one and things, something had to give. And unfortunately, that was um that was the pod. So, it was always intended to come back. I was hoping it would get back slightly sooner, but um if any of you have gone through building work and renovations and stuff, inevitably it all takes a bit longer than you think when you when you look at it. So, the room I'm in now, my new office, um first thing I'll say, apologies how I don't know how the sound is going to turn out on this episode. It's a very echoey room at the moment because it's largely just got my desk in it and a and a sofa bed. There's no rug or anything on the wall, so it's quite tiny in here. Um, so we'll have to do our best for a few weeks. The plan is as we get towards the summer, flesh this out a bit. I'm hoping that I won't just have to be a little talking head in the corner of the videos and I can have a bit of a nicer display um behind me and stuff like that. But none of that will happen soon. The main thing is the setup is all here. I'm here and I've actually got some time and breathing space now. Now, I mean, I was literally decorating this room last weekend when um all Gameweek 26 fixtures were were being played or the majority of them were being played. So, it's Yeah, it's still got the whiff of new paint in the air. Haven't even got blinds on the windows. So, a lot of natural light from the the lovely gray rainy sky coming through. Um but yeah, hopefully by the summer and as the weeks go on, we'll get this um I'll get this a bit more um a bit more how I want it. looking like a prime YouTube studio again. So, um yeah, so all is well. I'm absolutely fine. It's just been super super busy. Um but looking forward to getting back into normal swing of things as we get towards guess we call it like the last third of the season there or thereabouts. Um so still still plenty of points to play for, still lots to play for in your leagues, I'm sure. Still plenty to play for in my own league. So yeah, time to knuckle down again. Uh, so this will be pretty normal gaming preview episode as we were going um beforehand. Definitely taking me a little longer to prep this one than it usually does. I think not being in the daily um or the weekly grind of of going through all of the stats and I mean there have been a couple of weeks recently where I've barely been able to watch any football. So just been able to get my head back in the game uh and and doing the pod prep and everything has been nice. And also, I was able to actually watch some football the last week or two, which um is also helpful when you're trying to uh chat about it to to the masses. So, um yeah, appreciate all all of you that did comment nice things, checking in on me and stuff. And uh yeah, if you want to be more in the inner sanctum, um and uh then by being a member of Draft F, you get into our Discord channel. And I think that segus fairly nicely. Now, you're welcome to skip the next couple of minutes if you want to just get into the meaty stuff. I'll have the chapters um you know marked out in the YouTube. So, feel free to skip ahead as I talk a little bit about the website because whilst I've been away from the pod, we have still been working. We had our heads together um a few weeks ago um to really plot the next few months and into the summer and things. But obviously, part of that was a massive package of upgrades to the Draft F site. probably the biggest single set of upgrades we've had since we left the old FPL DraftHub uh site for those of you that were around back in those days. Um and when we became DraftFC FC and say most of that I have to give credit to DraftFC FC Taz. He's obviously the main uh the main man when it comes to the website. So yeah, if you'll just human me for a second, if you've been on the verge in the past of thinking about signing up or if you've been a past member um and aren't at the moment, here are some of the things that we've added in the last week or so. So we've now got a brand new aspect to our predictive modeling. So we've had an expected points model for a long time. One of the issues that has always been tricky trying to solve um are the minutes that players are going to play and trying to work out how that factors into the expected points for for the weekend ahead. So obviously if uh there are some easy things we can now solve like if a player suspended it'll automatically um project them to score zero. Um but trying to just fine-tune it so that we could basically um TAZ created and we're sort of I guess we're in version 1.1 at the moment an expected minutes predicted model which um we now list as its own uh data point within the site that directly feeds into the expected points model. So if someone's expected to get 45 minutes, we we our model will predict what they would likely get if they were going to play 90 and we simply half it. That's the basics of the way that that model works. But um yeah, you'll see on there that based on recent form of of minutes, starts, etc. We're also looking at injury records, too, which is quite nice. See what you think of it. it doesn't directly impact um the predicted lineups I do, so I'll still do them uh relatively manually as it stands. Um one little update we've done on the lineups, which some of you might have seen already, is there's now a really simple little text box underneath the squads. So, if I want to add any notes or caveats or rationale to why I'm predicting certain players, um I can jot a few notes down in there, which I think will go um a long way. So, yeah, the squad planner's got all of that new data in it. Um, there's also a bit in the squad planner which you can now do. In fact, I'll probably cut to it now quickly whereby, and we had this for a little while, but it's now much better. So, I'm in the squad planner here. Let's say just for the sake of argument, I want to compare Watkins. Uh, I'm clicking on the as I go, Evan Nielson and Thiago. By clicking and highlighting them, this will open their player cards down below. Um, which puts them side by side. Now, you can toggle the time frame that you're comparing these players to. So, I just want to look at the last five game weeks, home and away. um per 90 is something you'll know I prefer using because um it takes away some of the um the bias in in minutes if they're all relatively uh equal and I say you can directly compare and it's a traffic light system between the three. So green is ranking the best of that parameter, red is the worst, orange in the middle um all the stuff on there that you might want including my favorite non-penalty expecting goal involvements per 90. So I can quickly see um so we got Watkins Evan Nilson and Thiago. So I can quickly see that currently um Evan Nlson is leading the way on non-penalty expected goal involvements but 90 over the last five to 0.48 and compared to 0.35 0.25. So just another little added bit of functionality to our squad planet. Little bit of an update to the live gameweek so you now see the actual um live match results in there just to make it easier so you're not having to flip between the two. The biggest upgrade and the thing that I have been asking Taz if we've got the capability to do something for it for a couple of years now is a notifications ability. So if I pitch to you the kind of typical Saturday afternoon moment where maybe you're looking on whichever app you use to just follow the games or you're watching a game and you see that Evan Nilson scores goal. Now, you might know you don't own Evan Nilson, but your first instinct will be who in my league does have Evan Nilson. So, you then have to go either into your live gameweek or have a look through the league and and have a scout around to okay, John had um add Evan Nilson, so he's got those points. So, what we've done now with the notifications, which you literally just toggle, so you can toggle them on and off with a little switch in the live gaming view within Discord. So, not our Discord server where we have all of our chats, but we will basically from you'll get DMs from DraftFC FC every single time an event happens with the manager that it applies to. So, straight away if Evan Nilson banged in that goal, within about 30 seconds, you will get a DM that says Evan Nielson, goal scored. It will give you the match uh current match score as well. So, if it's first goal, say 1 nil, manager John Smith. So, you'll know, okay, John has got Evan Nilson and he's got the points. Um, we do that for assists. So, it'll be a goal and an assist notification. We do it for defcons when people hit that threshold. Uh, own goals, yellow cards, red cards, all the major events will ping instantly to you. And they're so quick that a lot of the time, because we've been testing it for a few weeks now, a lot of the time I will see the the Draft F notification that a goal has gone in before I've actually clocked that a goal has gone in. So, no. So now there's absolutely none of that having to fuff around and work out um who's sort of having a good week, who's got that player. It will just tell you straight away. And that is there for all Draft F users. There's not any extra price or anything that you have to pay. Just toggle it on and away you go. It'll ask you to verify your Discord setup and that and make sure that that's all connected properly, which takes honestly about 30 seconds. And then yeah, away you go. So that's the biggest thing and I say that's just something I've wanted to make for me and and for for us. So the fact that we can now just roll that out to to all of our members is great. Um got a couple of new tables in the league analytics so you can see who's winning the waiver and trade game in terms of um kind of net points gained and loss. That's actually a really indepth and quite tricky technical table to put together as you can imagine because there are so many ramifications depending on a player that you might have wavered in. You could have wavered them out the following week and then waved them back. So Taz has done his best. So this is again like a first iteration of this. But what he shows you is for that spot the player that you wavered in you can then trace the player that you wavered in for that player and so on and almost create like a daisy chain. Um and at each point in the sort of each rung of that ladder um gives you the number of points you would have got had you stuck with that player at that point versus the subsequent changes that you made. So we say it's not perfect and you know there's millions of different ways that people can um fill around with their squads. But in terms of following a chain of that one position in your squad of what you've done with that waiver, um I think for now it's the only thing I've really seen apart from literally getting your pen and paper out and manually doing it. Um that will give you some idea of um you know where you did well and where you maybe moved too early. We've also got some better updates to our difficulty table. you can it will now sort by difficulty and and the colors are a little bit better and not so much a thing now unless you you've still got a reddraft to go but our draft room um the kind of user experience in there and a couple of extra things that will show up on draft day are now there which obviously will become much more prominent for us for the majority of us in the summer. So yeah, I think loads of extra bonus reasons to sign up if you haven't already compared to what we're already offering. Um, as I say, not least getting into the Discord. So, but the notifications I think is huge. And, uh, yeah, all the good stuff that we've had for quite a while. I'll stop selling there. Um, I'll stop selling there and, um, get into the the pod at hand. So, waiver deadline is less than 24 hours away. Apologies. Um, most of the time I get now is on Thursdays. So, there's going to be a few of these now um, ahead of a slightly late gaming deadline because we haven't got an early kickoff on Saturday. So, not too bad cuz it means we've got tonight and tomorrow morning to have a fiddle with our waiverss and also take in some of that press conference info as it comes in. So, without further ado, let's get into it. So, Watch for the last game week. Now, obviously the last game was a double, so no surprises to see the theme of some of the players that were coming in there. Um, Martinelli number one wasn't a particularly great double for him. Uh, new boy, new Brazilian wonder kid Ran for Bournemouth was high up on the list too. Um, elsewhere we had Tu Armstrong, Gueno and Gomez for Wolves. Obviously, all the Arsenal guys were largely picked up already. Um, I managed to snag Zubamey the weekend before which was quite nice. He's he's had a very good couple of weeks for me. um elsewhere Nico Williams and uh and Hill who we will talk about later on in this episode. The players making way Romero and rightly so. Um yeah, a lot of players with bad fixtures or injuries on the on the Choplin block there. So um maybe Mtoma leaving was a bit of a surprise and yeah, fair few managers losing patience with with um Mateta, which is a shame for those of you that have been relying on him for most of the season. Um so the game at 26 results. So I know some of these literally feel like they were a month ago now culminating in Arsenal getting their second draw of the double game week. So those of you maybe a normal FPL who were triple captaining the likes of Gabrielle not the best result although he did get an attacking return last night and um yeah puts the pressure on Arsenal in the title race with Man City really starting to to get into a bit of a groove now. Obviously higher up a couple of results to to to sort of highlight. Spurs lost at home to Newcastle which turned out to be Thomas Frank's last game in charge and Forest were unable to get all three points against bottom club Wolves um which culminated in in Dish losing his job too. So um we'll we'll talk about both of those instances in just a few minutes time. Not many massively important injuries I think to add in. Some of these aren't exactly hot off the press but because I haven't done a pod for a few weeks I think they're worth mentioning. Marino his his season seems to be done. Um he's had to have an operation on a stress fracture in his foot. So we're not expecting him to see him for the remainder of the season. So if you are still hanging on to him somewhere then get rid is also reinjured some sort of muscular injury but the reports are that he could be back as early as this weekend. It still doesn't bode particularly well given how long he's been out and the fact that he's now picked up another issue. You wonder if it's going to be a bit of a stop start rest of the campaign for him. don't think he's an obvious drop right now because if he is okay I think there is there is a spot for him potentially in that um that starting 11th though we have now seen the emergence of Saka playing more centrally and he has looked pretty good in that role. also allows Madek to start out on the right hand side where they've obviously been competing ordinarily. But if we're likely to see Saka continue off the right, then Hbert should be able to get some minutes because Odigard for whatever reason the vibe seemed to be a bit off and I saw a rumor um yesterday or the day before that he could even be looking for a transfer away in uh in the summer. So, um, yeah, uh, Mateta, we're expecting him to be back in the next sort of couple of weeks, but, you know, Strand Len has absolutely hit the ground running, um, since he made his move over to Palace. He's a player that I've been a fan of. Um, he's been really disappointing considering how high I had him rated in in the summer in preseason, but, you know, he may be able to claw back some of the points that I thought he'd get over the remaining games of the season. And given that, you know, Mateta was literally a matter of hours away from from uh from leaving Palace before this knee issue um scuppered the whole deal. You would imagine they're going to put their stock largely in Strand Len. Um at least for the Premier League, I guess Mateta, they can run out in the uh in the Europa games if they want to. It's a bit of an unusual situation because he wasn't injured and then the news when it came out, they kind of made it sound as though he'd been nursing this knee injury for much of the uh for much of the year, but clearly it was enough to put Milan off um when they did their medical. So yeah, but you'd have to expect he'll be off somewhere in the summer um unless that injury is a lot worse than it sounds. But I think if you got him in draft, he would be dropped for me whether he is back from injury in the next week or two because I think Strand Lson um is the man. And then Bruno Grez who's had a cracking season so far. Um pound-for-pound one of the best midfielders you could have picked up a few months ago, has done his hamstring pretty badly. Um he's probably going to miss sort of half the remaining games um he got left. So there is an international break in March and I think he's tipped to hopefully come back in game 32 which is the first one back after that. So talking points um yeah Frank out and Eagle Tudtor in for Spurs and Dice out and Vto Pereira in for um for Nottingham Forest. I have to keep I keep doing this I keep saying for Wolves because it's just such a kind of forget where all these managers are. They've been doing the America around the same sort of set of clubs now. But um yeah, we'll talk about Spurs first because obviously, you know, the club um I was going to say close to my heart. Don't feel very close to my heart at the moment. But um yeah, Eagle Tuda is um a mercenary manager if ever there was one. If you look at his sort of managerial timeline year to year, kind of tells you most of what you need to know in that regard. Similar to what I'll say for Vital Pereira in a minute, a lot of my analysis of how this could go, I don't think he's going to be a real revelation compared to what you might read elsewhere. Generally, uh, a back three manager wants his team to press high up a pitch, wants everyone to work hard. In theory, you know, seeing the players run through walls, leave the pitch shattered should go some way to repairing the relationship between us, the fans, and the club in general. Now, I'm old enough to remember Spurs as just a pretty entrenched mid-table team with, you know, the only aspiration here to you is, oh, maybe we'll have a bit of a cup run. And yet, even though it's been a matter of months since we won the first European trophy in my lifetime, um I have never really felt more distant from the club. um and just generally disconnected from the club at all levels, whether that's kind of board level, I mean obviously the manager level because this guy's not even managed a game yet for us. Um and even the players, you know, it's I think that's sort of characterized and epitomized best by the sort of behavior we've seen on the pitch from Christian Romero um to the point where he's obviously suspended now. You know, it's just nothing really to to get to get behind. So, we just need to see we just need to see something change. So, a team I think that looks to be on the front foot, compress with intelligence is a key word I would use as a unit and also be aggressive in an intelligent manner will be more than enough to see Spurs to safety. So, I don't doubt I also don't doubt a couple of examples need to be made in the squad, whether that is someone like Romero or some of the lesser players. Um, and I'm certain we'll see it sooner than later, either with key drops or players getting hooked um earlier on in games if they're not doing what they need to do. I say if you add in the fact that this is a confirmed short-term appointment until the summer, hopefully it will provide whoever does come in on a permanent basis a slightly spongier springboard um you know to then embark on the next Premier League campaign if that is to be the case because obviously it could be a Championship one. Um though at least the ticket prices might come down uh a little bit if um if we are relegated. But you know given our current injury situation I think the setup for North London derby will be fairly close to what I've put out as my predicted lineup so far and what you can see on screen. The main position um main two positions I think that could vary a little bit um are Colani's spot in in attack and one of the the pivots in midfield. But I think given the fact that Pellini is probably going to have to be asked to step into a back three if he does choose to go straight to a back three and then Gallagher and Sar probably the obvious ones because Archie Gray is also going to have to cover Porro at right wing back. So probably just Colani's spot could be tell um could be Rich Charleston if he gets himself fit enough but he's been out injured for a while and obviously Kola Moani and Tuda have a positive relationship from their time at Juventus. So I think he'll probably favor a player who kind of knows what he wants and they they know what each other wants. So uh yeah, I expect and you never know my whole colani call um many moons ago. You never know. Colourney could claw it back because Voltoard is not looking like he's uh too high in the form at the moment. But we shall see. Um anyway, next one is VTO Pereira at Nottingham Forest. Now again, my analysis is going to be fairly similar to what you and others um will deduce yourselves really. And I think the main thing we've got to hang our hats on is what we saw from Pereira's Wolves team just a matter of months ago. You know, it was only the back end of last season that um he was the Wolves manager and Wolves are one of the most informed teams in the Premier League. So, you know, if you think of a Nori on the left, Kuna Strand Lson in form up top, it was a very functional team and you kind of you knew what they were trying to do. So, if we were to simply overlay what we've seen in terms of a squad um starting 11 structure from Pereira with the Forest team, I think you get something fairly similar to what I've put out in my predicted lineups and again what you'll see on screen. Now, if we're comparing those teams though, you'd probably say that that kind of back um that back six in terms of goalkeeper, defensive three, and midfield two are stronger than what Wolves had last year. But the wing backs and the forward three arguably not as strong as as what Wolves were having at the back end of the season. So, um I think the key is going to be getting Forest Tack to click into gear and maybe the new system will will allow for that with a bit more direct crosses into the box. I've put Luca in there as a starting striker because I think he'll favor the big man, but obviously there will be a bit of a Portuguese Brazilian connection with um Igor Jus, but he's don't think he's really done enough to to cement a starting spot. But yeah, getting them to score more goals I think will be the key to to keeping them well up into into safety. I think only only Wolves have scored fewer goals than Forest so far this season. So um yeah, obviously there are some injuries at the back. Marillo um is a doubt. Savona is a doubt too, but um there's also Juna who's a young Brazilian again may favor um one of his uh linguistic pals to to slot in there if need be. Um, again like like with Spurs, we'll only uh we'll only know for sure how they're going to set up once we've uh had the weekend out the way. Terms of fixtures in general, a few teams to highlight. Liverpool play three of the bottom four over the next three weeks, but you're really sort of scrapping around the edges of that squad. Uh again with City, they play three of the bottom five over the next four, but they do blank in gameweek 31. Um elsewhere, Villa, Bournemouth, and Brenford, I think, are where we're most likely to extract a bit of value given uh how good their fixtures are coming up and a few of their players will feature heavily in the picks. Um leadeds are your sort of you particularly for bigger leagues. Leads are another one who've got pretty okay fixtures um you might want to consider their players from as well. So, in terms of main picks and for all of the picks today, I've filtered our tables to uh 10 team leagues and I've then filtered that again to just the top 200 performing leagues of that league size. So, all of the roster percentages are for that. If we were to take just general average 10 leagues, a lot of these roster percentages will be far lower. But like I've said million times before, I know that the majority of you listening and watching are of the more engaged end of the draft FPL scale. So just telling you that um Rion, the new new Bournemouth winger, um is going to largely be is going to largely be available is incorrect because I know that in the more engaged leagues, his ownership is pushing practically 90%. So hopefully it just means that the players we do discuss are players that are a little bit more likely to be actually in your waiver path. So yeah, without further ado, into defense. And the first one is Hill for Bournemouth. I think I wrote my in my um my lineup notes that Hill is potentially saying claimed to be in a sort of team of the season spot, particularly if we're just focusing on the latter half from sort of gameweek 19 onwards, which is where he kind of established himself back into the um the first 11. He's hit the defcon threshold all but once. And in that one game that he didn't, he got nine. So he was just one tackle away um from getting two points again. The last game against Everton, he hit 20. So somebody needs to tell him that you don't score double for um for hitting it twice. Add in a clean sheet, add in a sprinkling of attacking returns and um yeah, he's done very very well. As mentioned already, Bournemouth's fixtures over the next month or so look very good. I would say if he's available in your league, he's pretty much a must pick up. Top 200 leagues. Um because we can also do um on our squad plan table, we can do what's called a delta value. So as well as showing you the roster percentage of that player in a top 200 league, we can show you how that largely compares to an average league. So in other words, you're trying to look at who are the players that are more owned by the good leagues than the less good leagues. And that's kind of a way of of easily mining some gems. And uh if we do that for um for Hill, he's on average 40% higher in the better leagues than he is the average leagues, which is literally one of the the most prominent examples um of that Delta score. So yeah, a big player. Another one to mention is a teammate um Jimnz. I think the days of seeing him play higher up at the wing are probably over now with um with Agley and Dion, but still a good pick moving forward. not a Defcon merchant by any means, but there is a bit of attacking threat and obviously the clean sheet possibility which um I guess goes the same with any of the Bournemouth defenders if you can uh if you can find them. And then last one is for Farana for Chelsea. Really just a fixture pick above all else. Burnley at home at the moment has to be one of the prime targets fixtures week to week. Um so any Chelsea defender you think will start that you can get hold of is definitely worth it. It would just be a oneweek punt though. they go away to Arsenal and then Aston Villa in the follow-up game weeks. And on that note, I would say if you look at Chelsea's fixtures for the remainder of the season, they have now largely played the majority of their easier games. It doesn't look um doesn't look too rosy right down to game 38 to be honest. So may not be a bad time for any of your Chelsea assets. You the likes of Jao Pedro, Palmer, Enzo, even Kaisedo, Pukarea, anyone you've got could be the time to try and sell high. And if you can get a trade deal together, yeah, may pay off down the stretch. In midfield, first one is Matus Fernandez. Now, if you've had any of the Fernandez's recently, you've probably done all right. Though, I doubt many of your leagues out there have Bruno floating around the waiver pile. As you can see, Matias Fernandez's ownership in top 200 leagues has got to a pretty decent stock, 77%. So, he won't be available for many of you out there. He is firmly in the realm we discussed a few months ago of that allrounder who can do a bit of everything. He can hit the defcons. He can get attacking returns pretty nailed on to start. So lots of avenues for point scoring ability. So he's hitting the defcon threshold more often than he's not. Um and the the sort of attacking returns in terms of the underlying numbers look fairly sustainable as well. So, he's definitely one of the key players who has raised their level recently and he's reaping the benefits of the uptick in West Ham's overall form and a player I personally brought into my own draft team two or three weeks ago and I have no urgent plans to uh to swap him out again. Next is Bernardo Silva. Um he's on the list because of his form and and his ownership is creeping up. I see the appeal. Um, as for many, it's probably your only seemingly safe way into what seems to be the City attack. You know, the only player that's likely to be available. He's still over half owned in in established 17 leagues now, but I've those of you that have listened to the pod for a while, you know I'm not a massive Bernardo Silva fan. And I think he he can have purple patches which he has done but I think gone are the days where he's a fairly um reliable point scorer and obviously the nature of his position at the moment is generally a bit deeper. So I'm I'm mainly highlighting him to to potentially warn you off and I'd sooner put your way stock elsewhere even though I know it's can be quite an attractive proposition to get a part of this Manchester City team that are looking really good. Bill got a nice game on paper this weekend at home to leads and really your only realistic way in um that you'll want a way in for is is Emmy Buendia. Sancho is available but he's not really doing anything. Um leads at home in the Wolves away in the next game week. So a nice little fixture pairing on paper and um yeah, Buendia has been a player we've been sort of chatting about on and off all season long. Next is Alex Scott. No, not that one. um the Bournemouth one who had to say he's he's an emerging top tier English midfielder. He's only 22 and he could be flirting with a spot in the England squad. Perhaps this World Cup might might sort of come a little bit soon for him, but um I would not be surprised to hear his name kind of mentioned in the uh in the periphery. He comfortably has a has a seat at the table with Matias Fernandez as a bit of an allrounder. um hitting the defcons most of the time, still able to chip in with the odds attacking return as well. I think Fernandez definitely edges him on the goal involvement front, but the upcoming fixtures for um for Bournemouth versus West Ham, I think could see maybe a bit of a swing where they even out a little bit. Say definitely a player I've got my eye on this week. I wouldn't go from Fernandez to Scott, but I'd happily consider having both of them in my midfield as a sort of, you know, double pivot safe pair of hands given that I had to let go of my beloved uh Granite Shacker a few weeks ago. Who is one I have to say I haven't got on the list, but one that we should keep half an eye on. Doesn't sound like he's um quite ready yet, but um yeah, a valuable one to to grab again when he is back in training. sticking with Bournemouth and it is uh Adley. Now, if clocking in, you know, like Scott and Fernandez, if clocking in a reliable four points every week isn't your cup of tea, how about something a little fruier with I mean Adley? He started to show some promise and some form. Then he went away to Defcon, which kind of sort of put a bit of a stutter on that. And then he's been back properly in the starting 11 for for sort of the last five game weeks now. and he's got four attacking returns in that time um with non-penalty expecting goal involvements per 90 at 0.7. So he's full value for those goal involvements as well and is your say he's much more attainable if you want a piece of the Bournemouth attack which you should want a piece of the Bournemouth attack moving forward. As I say given the surge in popularity of uh Rian whose top 200 league ownership is already going to go over 90% this weekend. Adley really is at 32% owned. he's the main one that you're likely to find um and and full value and worth bringing in a player that I have got pencled in for a waiver um or tomorrow. Back again to uh from sweet to savory, we have got Vitali Yan out who's now started 10 Premier League games on the bounce. So I think we can pretty safely assume he's nailed at this point. averaging more than five FPL points per game over this run. Four assists and has hit the defcon threshold six times out of those 10 games. Not an exciting pickup by any means. not you know the sort of player if you're if you're browsing who your um league rivals have brought in on the waivers you probably wouldn't look twice at but at 14% ownership given the form is purely based on his reputation and is not because we are looking at the numbers and trusting those numbers if we look at that time period the last 10 games which is obviously not by any means a small chunk of the season that's more than a quarter of the season you look at the last 10 games in which he's become a regular starter he sits eighth overall all in terms of FPL points 53 points that's ahead of Harland the only players ahead of him during this same time frame Jedro Smeno Vertz Rice Gabrielle Palmer and teammate Kellaher who's got one or two penalty saves in there if I recall. So that that tells you where he's at in the form table at the moment. And yet he's available in the vast majority of leagues and I'm sure he's available in the vast majority of the leagues of those listening. So if you're shopping in that realm, you can't do a lot worse than Yanel at the moment. A home game against Brighton, there's no reason he shouldn't be busy to hit the defcon threshold again. Now obviously you could argue, have we sort of missed the gravy train now and is he going to revert to a lot of two and three pointers moving forwards? But I think you can do a lot worse than uh than Yano at the moment in attack. And a few players to mention now you'll spot a couple of these have pretty high ownership in the top 200 leagues. The first one is Shesho. I like saying the proper pronunciation. I think it's makes me feel like I'm Sean Connory. Shesho. Um I don't have him penciled in to start at the weekend, but I think he is the main potential disruptor to the steady starting 11 that we've seen from Michael Carrick so far. His non-penalty expecting goal involvements over the last few weeks is above one largely due to him getting a couple of returns in very limited minutes off the bench. If it's not this week, I think he possibly gets a start next game we get home to Crystal Palace. My hunch would be that Amadialo is the one who has to make way and they move Ambumo back over to accommodate him as well. But we'll have to wait and see. Any injury news to any of the sort of attacking lot I will almost guarantee um that Seshko starts and I'm gradually nudging him higher up in my draft rankings week to week at the moment. Next one is um what's his proper name? Valentine something. Um Tatty. Anyway, new West Ham striker. We obviously got Pablo in as well who's injured at the moment, his ownership's rocketed to 86%. When I was talking about the delta values, we can look at if we do filter the um the tables to top 100, top 200 leagues. And if we look at the overall tally, the one who went to number one was Wolves striker Tu, which is no surprise because they've just gone into a double game week. So he'll he'll his stock will plummet again going into this game week. But number two on the list was Tatty with a with a delta score of 43% compared to the average league. So the big the big leagues, the big managers have already looked to get him in when they can. He started every game since he arrived, not on penalty, expecting goal of per 90. He's just 0.38, which is all right, but um you know, as we keep alluding to, West Ham are very much team on the up and doing everything they can to um to stay in the Premier League. He's nailed on to start. I think you know, he enters the sort of top 24 strikers pretty comfortably. So, if you're in a standard 18 league, he's probably good enough to be in one of your squads. You know, I wouldn't necessarily swap him out for some of the, you know, emerging forwards that we've seen this season, like DCL, definitely not Brobby, Barry. Those guys are probably still hold on to, but I'm sure there are there are managers out there holding worse forwards uh than him. An interesting one could be if you've got Kai Havvers and how you're evaluating that situation given his injuries and rotation risk etc. Knowing that someone like Tatty is going to play every game that um that he's fit. Um I like players that play. So arguably in that situation I would go I'd go with Tatty. The other new forward or I guess it's new to the pod because I haven't really done one since the January transfer window um is Luca for Nottingham Forest. Now, obviously, Nottingham Forest assets are kind of a bit back to the drawing board until we see what V2 Pereira does. As I mentioned, Eagle Jus could give him a bit of the Portuguese um you know, lingo advantage and get us, but I I just don't think he's selling enough. And given what we saw with that Wolves team last year, I'm fairly sure that he will favor the idea of having a bit of a target man given, you know, the absence of of Chris Wood. So, so the underlying numbers aren't brilliant, but he hasn't played a lot of minutes so far. He's another one who I think will probably continue to play. And if we see any kind of uptick in Forest form, then you'd have to expect he'll start to chip in with with gold involvement. So, 45% ownership, I think, is about right. You know, he's not done anything particularly major to to put himself on our radar, but if you you know, like I said, you got to have players that are playing at the moment. So, if you're holding on to any forwards who are substandard or just simply not playing regularly, it needs another one to uh to consider. Terms of hidden gems, haven't got many actually. When you filter it by top 200 leagues, I say anyone that you vaguely consider, naturally speaking, those those good managers are picking them up. Bandenberg is a cheap way into the Brenford defense if uh if you want to. He's also not totally averse to getting some defcons himself. And then in midfield, Garnacho not guaranteed to start, which is probably why his roster percentage has dropped. If you fancy him to get some game time with that home game against Burnley, you'd take it. Uh, and then a couple of forward options. Cost us for Brighton and Nmetra for leads. Again, neither are nailed. Um, I probably prefer the idea of Netra for leads because, you know, I think we still can see some games where the where the pair of them will play. Um I think DCL will get protected and rested at times as well. So he will see some game time. The only thing I'm not sure about with him and I will have to wait for um Farcus uh press conference is whether he picked up an injury that's going to rule him out for a little while in their um their FA Cup game. But uh yeah, we need to wait and see on that one. So that's pretty much it. As I always say, predicted lineups are done. And you now have the added feature, which I've shown on screen, which is the little note box underneath um just for me to put any little rambly notes that I want to um to qualify some of my choices. I'll wait for some press conference info today and give them another pass through tonight. So, that is it for this episode. um a slightly longer uh rambly one than the normal one, not least because um of my sales pitch, which yeah, if you were sort of driving on your hands free and you had to sit through that without any interest in it whatsoever, I do apologize. Um but um you know, if you've been listening to the pot for a while, hopefully you're aware I'm not uh maybe to our detriment. I'm not the biggest salesman. I I tend to uh get more into the meat uh most of the time. So, forgive me just this once, but I'm I'm pretty excited myself about those the list of changes that we've got. And uh not least, again, I'll say it for the hundth time, the notifications is such a good feature, but you know, I think people would honestly sign up for our service just for that, forgetting everything else we do. I think that is literally worth um the $3.99 a month in and of itself. If you've got this far and you're listening and it's the first time listening on on a podcast platform, then make sure you're following. Whether that's Spotify, Apple Podcast, whichever one you use, make sure you're following so you get notified when we release new episodes. If you're watching on YouTube, make sure you subscribe, give us a thumbs up, and um comment any of your particular questions and conundrums down below. Again, I will have a pass through some of the comments tonight. I am at work tomorrow morning um and will be probably pretty busy around the time of the waiverss processing. So unless I get to you by very early tomorrow morning, I might miss out on answering some of the late questions. But we've got free agency. So I can still answer some of those tomorrow night and there may be changes that you're still able to make cuz we have got that slightly later deadline on Saturday. Oh, the other thing I haven't said which um I can't remember exactly where we're going to be posting if it will be I think it will be on the the sort of public facing uh draft site is we're going to start uh distilling the pod into a written blog post. Now I'll be honest hand on heart we are going to use an AI transcription tool to basically take the essence of what I've said in the pod and spit it out into a blog. I'll still have to check it over because well I want to make sure that it's accurate but um you know I've I've said proudly before that um we we try and stay away from AI as much as we can try and keep it keep it real but for that I think and it's a thing that comes up now and again and I know some of you are really busy and don't always have time to listen to me ramble so being able to just browse a little blog post is helpful now and again. So it's never going to replace this but it just gives you another option if you want to peruse um you know very last minute. Yeah, I mean, yeah, on the AI note, I mean, there are a lot of kind of AI vibe coding draft FPL tools emerging in the space now. And like we've said for years, we we need more people in this space, whether that's content creation, whether that's, you know, tools to help you out and stuff because it will only help the whole community grow and then we'll all grow together. But I think you'll agree and I hope you'll agree with me that our I think our overall packaging experience probably still remains the best in my humble opinion. We we started this as a tool for us as draft managers who started to get way too obsessed in it. And that is still the kind of fundamental essence of of everything we're we're looking to do. Uh basically so uh you know it doesn't take lot. I just give Taz a little idea and you know like a bob sled just pushing down and before you know it he's accelerating downhill um towards something really good. the occasional wipe out along the way, but um generally able to see the course and produce whatever hair, you know, hair brain idea um I can I can come up with. Um so, thank you for coming back. Um I am back. We'll have a normal game preview again next week. And until next time, stay sure."
    },
    {
      "id": "oXGW9wqR3to",
      "title": "Gameweek 27 Waiver Picks For EVERY Team | FPL Draft",
      "channel": "The FPL Draft Zone",
      "channel_id": "UC1iLU8Nb1Rb-43Ld6zqCgGw",
      "published_at": "2026-02-16T22:17:06+00:00",
      "transcript": "This is the FPL Draft Zone, your fantasy [music] team's best signing of the season. Hello and welcome to the FPL Draft Zone, a podcast all about draft FPL. I'm Dumb Crafts. I hope you're all well and yes, another game week is almost over. for all that stands between gameweek 26 being done and dusted is the small matter of Wolverampton Wanderers versus Arsenal this midweek. But we do not have the patience to wait for that result. Our attention is already firmly focused on gameweek 27. And that's what this pod is going to be all about. And we will get into it in just a moment. But first, a few bits of business for you. If you're watching us on YouTube, please make sure you like this video and subscribe to the channel so you never miss an episode. Tell your friends about us. Tell your enemies about us. tell anyone you want to about us just so we can up that subscriber count. And it's the same deal with you podcast listeners as well. Please make sure that you are subscribed to the pod and please leave us a five-star review. That is our currency of choice on podcast platforms, five stars only, and maybe a nice comment or two wouldn't go a miss either. There is one other bit of business we want to tell you about as well, and that is that we now have a weekly newsletter which will wing its way to subscribers every single Wednesday. If you want a piece of that pie, FPLdraft zone, weeklybrief.behive.com is the place to find it. We will also put all that information on the show notes on podcast platforms and YouTube as well. But let's get into gameweek 26, which is of course still going on because we have got that Wolves Arsenal game to come. And it does seem that it's been going on for a while. We've had a whole weekend of FA Cup action as well since these results. But it was a big gameweek. And it was a big gameweek for Virgil van Djk who got the winning goal for Liverpool at the stadium of light to end Sunderland's unbeaten home record. A goal, a clean sheet, 13 defensive returns, three bonus points and a 17point hall for owners of Virgil Van Djk. It was another good week as well for Jorgen Strand Lson who's really finding his feet at Crystal Palace having joined the club from Wolverampton Wanderers. Two goals and three bonus points despite being on the losing side at home to Burnley. 13 points for the Norwegian. He actually had higher xG on his debut against Brighton when he racked up 0.37 xG to this game against Bernie where he scored twice got 0.34 xG. But the signs are very positive that if you own Jorgen Strand Lawson, you will finally reap the dividends. And it was a good week as well for Tyrone Ming of Aston Villa. An assist and a clean sheet against Brighton and Hoval being three bonus points, 12 points overall, his second successive start. And we will discuss Aston Villa's strong upcoming fixtures in just a moment. But first, a reminder of the midweek fixtures. And it is just that lone Premier League game between Wolverampton Wanderers and Arsenal that you need to keep in mind when plotting your waiverss. Let's get into it then. Gameweek 27, which kicks off on Saturday the 21st of February, 2026 with a 3:00 kickoff between Aston Villa and Leads United. Villa are actually unbeaten in their last six meetings with Leads. They've won four of those games and they were winners in the reverse fixture at Ellen Road earlier this season in November when they won 2-1. And Morgan Rogers was a hero after he scored twice for Uni Emory's side. Villa options for you. Ian Matson is having a good spell in Villa's starting 11 right now. He started four of their last five games. He got an eight-point return against Brighton and missed out on a defcon return by just one contribution. And as we said, Villa's next few games are very tasty indeed. Five of their next seven games, Leads at home, West Ham at home, Sunderland at home, Wolves away, and Nottingham Forest away. Five of their next seven games, very winnable games indeed. So, if you want a piece of Aston Villa's backline, Ian Matson offers both defensive and attacking threat. Douglas Luise is another option for you from Aston Villa. started three matches in a row now, having rejoined the club. He's racked up 0.49 XGI across those games. And here's a stat for you. Since 2019, only three Aston Villa players have created more than 100 chances at Villa Park. those players, John McInn who is injured, Ollie Watkins who will be taken in your draft league and David Louise oh sorry Douglas Louu I should say Douglas Louise not David Luiz Douglas Louise who has racked up those chances despite having had spells at Juventus and Nottingham Forest. So he is very much a player to take seriously in draft particularly in the larger leagues because he is across lots of set pieces for Villa and he looks like because of their injury problems in midfield he is going to be an everpresent for the foreseeable future. As for lead United this is a player I absolutely love. It is Anton Stack who is set to return for the club against Villa this weekend. He's missed three of the last four games through injury. He's got three goals and six assists this season. He is averaging 4.6 six points per match. And of all the players who have created the most chances in the Premier League, Anton Stack, despite playing in a struggling, relegation threatened team, has created the fourth most of all players in the top flight. Bruno Fernandez leads the way with 78 chances created. Declan Rice has created 47 chances for his teammates. Enzo Fernandez 45 for his teammates. And there with 44 chances created is Anton Stack. If he is free on your waiverss, do the sensible thing and get him in. Another option for you from Lead United is Jadden Bogle, their defender who has had two attacking returns in his last two matches, a goal and an assist. But if you're watching us on YouTube, you will see his heat map from his previous game. And as you can see, a lot of his action is in the final third. Some of those entries are into the penalty box, which explains his attacking returns, but he is not playing as a fullback in a traditional sense. So, he is offering a lot more going forward than most defenders in the league, and that should be under consideration when you're looking at defensive options this game week. Brenford take on Brighton at the GTech. Three of the last six matches between these teams have ended in draws. Brighton have actually won two of the other three games, so that doesn't bode too well for Brenford. The Seagulls also ran out 2-1 winners at the AMX earlier this season with Danny Wellbeck and Jack Hinchwood on target for the hosts. But I want to focus some attention on Brenford because they have got a lot to shout about right now. Michael Kyod was excellent in their draw with Arsenal last time out. He is a huge threat with those long throws. There are question marks over who is Brenford's first choice pairing at the heart of their defense with Vandenberg, Nathan Collins, and Christopher A all battling for two places. That means Coyote is your sensible route into that backline. Why should you be looking at Brenford's backline? Because their fixtures are dreamy. Brighton at home, struggling Brighton at home this weekend. Then a trip to Burnley. Then they have a tough test away at Bournemouth before a home game against Wolves. And beyond those four fixtures, their fixtures are still pretty decent. So if you want a piece of Brenford's backline, Michael Kode is the sensible routing given the question marks over their central defenders. And Kevin Shard is back from suspension for this one. He's got six goals and four assists so far this season. He's had five attacking returns in his last seven matches. A little stat for you on the bees. Over the last 10 games, only Arsenal have got more points in the Premier League than Brenford. A team you have to be all over for the next few weeks if you want to do well in draft. As for Brighton, well, they are not doing well right now. All sorts of question marks over Herzel's future. A lot of Brighton fans being quite vocal about the fact they want him out of their club. But one shining light has been Pascal Gross, who has rejoined the club from Bruceia Dortmund. got one goal since rejoining in six starts, but his underlying statistics are excellent. XGI numbers in gameweek 22, 0.43. Gameweek 23, 0.42, and then gameweeks 24, 25, and 26. Every single time his XGI numbers have been over 030. So if you need that fifth midfielder, if you're in a larger league and if Pascal Gross is free, you could do a lot worse because his underlying statistics suggest he is going to be a threat for the foreseeable for the Seagulls. It's Chelsea taking on Burnley at Stanford Bridge. Chelsea actually unbeaten in their last 12 matches with the Clarence. They've won nine of those 12 games. They've drawn the other three. The reverse fixture this season at Turfmore ended 2-0 to the Blues with Pedro Netto and Enzo Fernandez getting the goals. Option for you from Chelsea. Jorel hat. Cucarella is out of this one. He has got a hamstring injury. He is expected to miss the next four or five games. Hat is his natural replacement at left back and in 45 minutes last time out he racked up 0.21 xGI. Chelsea's fixtures do turn after this week. They are not easy, but as a oneweek punt only, I think with Burnley at home, you've got to look at Chelsea defender. And if you can get hat, then surely that's something you should be considering. Burnley, as I said, struggling at the run of the table. Did beat Crystal Palace of course last time out, but that seems like it's unlikely to continue anytime soon. And I cannot see them going to Stanford Bridge and getting anything other than a shellacking. However, if you do want a Bernie player, Leslie Uggeru is probably your best bet. He got an assist against the Eagles. He racked up 12 defensive contributions as well. Finished with seven points. He's had five attacking returns this season. And he's got doubledigit Defcon returns on eight separate occasions, having hit the threshold half of those times. Four times he's hit the defcon threshold. West Ham, well, they are at home to Bournemouth as they continue to try to find a way out of the relegation troubles that they find themselves in. Five of the last six matches between these two sides have ended all square and across those games there has not been one clean sheet for either team. Callum Wilson scored twice against the Cherries in the reverse fixture earlier this season with Marcus Tavanir on target for the Cherries. That one finished two apiece. West Ham options for you. Elhaji Malikj their Seneagalles left back is having quite a good time of it right now. Five assists so far this season for him despite only racking up 1.4. for XGI. He started the last three matches having returned to the club from his AFCON duties. And of course, we should not forget how impactful he was in the Czech league last season, getting 10 attacking returns in just 24 matches for Slavia Prague. However, if you want a West Ham player, look no further than Matteas Fernandez, a defcon beast. We are going to talk about some players coming up who are glamour puns. They are going to be playing for their teams because of injuries, because of suspensions. They have good track records in this league despite perhaps not showing much form of late. However, if Matteas Fernandez is free in your league, snap him up at all costs. He's racked up 32 points over his last five game weeks. He's averaging 6.4 points per game. Across that period, he's had 10 defcon returns this season and four doubledigit near misses. He is a is as close to a guarantee, as close to a sure thing of four points minimum every single week. And I would be going all in for Matteas Fernandez if he is still free in your draft league, especially when you think that West Ham are going to have something to play for from now until the end of the season. And that will not apply to many other teams. As for Bournemouth, couple of options for you from the Cherries. Ryan, their midfielder, may still be free in a few leagues. three matches so far for his new club, two goals and one assist. And like Brenford, Bournemouth's fixtures coming up are excellent. Their next four, West Ham away this weekend. Then they have two home games against Sunderland and Brenford before they go to Turfmore to play struggling Burnley. So like Brenford, if you can get in Bournemouth assets, now is the time to do it. I mean Adley is another option for you from the heart of their midfield. He started the last five matches. He's got two goals and two assists across that time. 33 points in his last five matches. He is averaging 6.6 points per match across that period. And across that period, he's racked up 2.57 XGI. So, he's actually overperforming those statistics, but they are not far off what he is getting. Both these players are must waiverss if they are free and if you need a fifth midfield option, and they're the sort of players you can hold through the next month or so and expect some pretty consistent returns. At the Etihad, it is Manchester City taking on Newcastle United. This is the fourth time these sides have met this season. Recently, City did the double over Newcastle in the Carabal Cup semi-finals. However, Newcastle won the league game at St. James's Park 2-1 earlier this season in November. And that defeat is the only one that Manchester City have suffered at the hands of Newcastle United since September 2023, which is a span of seven matches home and away. Options for you for Manchester City as usual will be slim, but a couple of options from their backline. Ryan 8 Nory has started the last three matches for them now at left back. Nico O'Reilly seems to be making a name for himself in the heart of that Manchester City midfield. And that should see 8 Nory's position in the starting 11 remain pretty secure. He was ranked as the second most valuable defender by FPL draft at the start of the season. He had 11 attacking returns last campaign and if he is still free on your waiverss. Now is the time to make that move. He could be an exceptional bit of business if you can get him in. And Ruben Diaz has recently returned from injury for City as well. Got 29 minutes in the win against Liverpool. His first start came in that comfortable win against Fulham in gamewe 26 and that was their second clean sheet in their last seven Premier League matches. So defensively they may well be finding a bit more security and City's next four matches are not exactly overly challenging for the title hopefuls. Newcastle United at home. They've recently beaten them home and away. Leads United away away, which could be tricky, but then a home game against Nottingham Forest and then a trip to West Ham United. Given the stakes, you'd expect Manchester City to win all of those and to keep a few clean sheets in the process as well. As for New Cross United, this is a player who is unlikely to be free in many waiverss, but I have seen his name being mentioned in some possible trades. I have seen some people drop him from their teams and I think that may be a mistake. It is of course Anthony Gordon who has had two attacking returns in his last two appearances. Now Newcastle defensively are shambolic. They have only kept two clean sheets in their last 19 league games. Up front it's anyone's guess who starts week in week out. Sometimes it's whistard. Sometimes it is neither. And when it is neither, there is one consistent player who plays week in week out and that is Anthony Gordon. And over his last five matches, his underlying numbers are good. 0.54 xGI, 0.12, not so good. But then 0.88, 0.26, and 0.60. If a manager in your league has dropped Anthony Gordon onto the waiver pile, do not muck about. get him in because he is a class player and he will contribute to your draft team success between now and the end of the season. That City Newcastle game sees the end of the fixtures on Saturday the 21st of February. We then roll in to Sunday the 22nd of February which kicks off three 2:00 fixtures, one of which sees Jorgen Strand Len take on his former club. It's Crystal Palace taking on Wolves. Palace have won four of their last five meetings with Wolves and eight of the last 10 meetings. Earlier this season, it finished 2-0 to the Eagles with Daniel Munos and Jeremy Pino scoring the goals for Palace in a game that did see Jorgen Strand Len line up for Wolverampton Wanderers. How times have changed for the big Norwegian. Options for you from Crystal Palace. Evan Cassand, their midfielder on loan from Aston Villa, earned his first start for his new club in that defeat to Burnley in game 26. made his debut the week prior in game 25 and got an assist in the derby against Brighton. Palace's next four home fixtures, Wolves, Leads, Newcastle and West Ham. Now they are four great home fixtures and you would expect the likes of Evan Gassand and Jorgen Strand Lson who we'll speak about in a moment to fire in a few points for your draft team. A word of warning though, Crystal Palace have only won two games at Shurus Park all season in the league. So, it is not a sure thing. However, surely Wolves leads Newcastle and West Ham will bring about a couple more victories at least on home territory for Oliver Glasner's side. If Jorgen Strand Lson is free on your waiverss in a smaller league perhaps, he is obviously a mustwaver. two goals in two appearances since joining from Wolves. He had 18 attacking returns in 30 starts last season. And of course, if he is ever going to score a goal, it will be against his former club. After that, as we've discussed, Wolves leads Newcastle. West Ham represents very favorable fixtures. If Strand Larson is available or if you think you could get a trade over the line to get him in, I would certainly not hesitate because I think he will be an important player for Crystal Palace between now and the end of the season. I would expect him to come close to getting double digits in terms of goals between now and the end of the campaign. As for Wolves, well, they're of course struggling big time at the wrong end of the table and it is hard, like it is with Burnley, to recommend any of their players. However, their defender Mascara has hit Defcon five times this season, and he has missed out on Defcon by just one contribution on four other occasions, including in his last two matches. Now, Wolves next three fixtures, Crystal Palace away, Aston Villa at home, and Liverpool at home. You would expect the Wolves backline to be particularly busy in a few of those games, and that could see Mascara get a few defensive contribution returns. Would he get a clean sheet? No. No, he won't. At the City ground, it's Nottingham Forest taking on Liverpool. But Liverpool have actually only won two of their last seven games with Forest and they've failed to beat them in any of their last three meetings. In fact, Forest ran out 3-nil winners at Anfield earlier this season with Morgan Gibbs White and Merillo among the scorers for Nottingham Forest. They will of course have a new man in charge for this one. His name is Vto Pereira. He is the former Wolverampton Wanderers manager and he may bring with him a bit more defensive stability. Sha dice brought a little bit more defensive stability after the an era, but you would expect Pereira to bring even more because prior to his appointment with Wolves, they were conceding two and a half goals every single match. However, in his first four months at Molyneux, he reduced that to just 1.3 goals per match. if he can have a similar impact at Nottingham Forest, their defenders, who many of us thought would be brilliant pickups on draft night could return to the menu. And there's probably no one better right now than Nico Williams, who offers both defensive stability and attacking threat. He's had four returns in his last five matches. Obviously returned from suspension last time out for that drawy walls. Had a couple of shots among Nottingham Forest 35 I think it was. And he could be a decent shout over the next few weeks if Forest are going to get out of trouble. Liverpool options will as always be slim. However, Ryan Graven could still be free in some leagues and Ryan Graham still represents great value in the heart of that Liverpool midfield. four goals, four assists, seven defensive contribution returns this season. He's had two defensive contribution returns in his last five games. And across those five games, he's also missed out by just one contribution twice. And he's also hit 10 defensive contributions in the other game. So, it could easily have been five out of five in terms of his defensive contribution returns. as it was. It was just two out of five, but I would expect him to continue racking up those Defcon points between now and the end of the season. At the stadium of light, Sunderland will be looking to bounce back from defeat to Liverpool with a home game against Fulham. Fulham have actually won three of their last four meetings with the Black Cats and they've only lost one of their last eight games played on side. Last time out, Fulhammer 1-0il winners thanks to a late goal from Ral Gimenez at Craraven Cottage. Option for you from Sunderland is Dan Ballard, their defender, who despite that defeat to Liverpool, ended the game with four points thanks to another defensive contribution return. He's now got 12 defcon returns for the season. Sland have also kept five clean sheets. Their fixtures coming up are not great, but they're not dreadful either. Fulham at home, Bournemouth away, Leads away, and Brighton at home. Certainly the home games you'd expect them to come close to keeping clean sheets and leads away is not the toughest test. It's a big big test for leads to try and get a result given where they are in the league. Sunland of course safe. Bournemouth away not quite so easy. But if you want a bit of southern defensive action, don't look any further than Dan Ballard unless of course Mukulele is still free. As for Fulham, Rodrigo Manise, their forward is back from injury. He was involved in their game in game 25 against Everton. He got 30 minutes under his belt in that defeat to Manchester City in gameweek 26. And a reminder over his last two seasons with the club, eight goals in 2024 2025, nine goals the season before in 2023 2024 and notably at the start of this season before he picked up that injury, he had started four of the first five matches for Fulham. And on top of that, it seems that Raal Gimenez will not be staying at Fulham beyond this season. He is not going to be signing a new deal with the club. So it is in Fulham's interest to play Rodrigo Munice over Gimenez between now and the end of the season because Gimenez will not form part of Fulham's future. So one to think about there if you need a new striking option. It's Spurs versus Arsenal. The North London Derby in North London and Arsenal will go into this one pretty confident because they're unbeaten in their last seven matches with their arch rivals, winning six of them. And last time out it was an absolute shellacking for Tottenham with Eberi Ezing a hat-tick for the Gunners at the Emirates Stadium in a 41 win. Options for you from Spurs. Javi Simmons. He's uh he's doing pretty well really right now for Spurs given that a lot of their players aren't. And his XGI since his return from suspension in gamewe 21 has actually been pretty good. Got an assist from 0.28 xGI in gamewe 21. Got 030 xGI in gameweek 22. In game 23, 1.07 xGI and he hit defcon. And in gameweek 24 he got an assist from 0.77 xGI. In game 25 was the game against Manchester United when Christian Romero was sent off. obviously made life a little bit tricky for Spurs. Maybe it's just 0.27 xGI in that one, but in the game we've just gone 0.43 xGI. He's a bit of a Jeremy Pino type player in as much as he seems to be getting all his underlying statistics right, but not his output on the pitch. Will that change? It might, especially now that Domi is fit and firing. So, Zavi Seaman's a decent pickup, not just for this one, but for the foreseeable if you want a Spurs player. And Radu Dragasson is a shorterterm prospect. He's going to start this one in the absence of the suspended Romero. Seems a bit mad maybe to recommend a Spurs defender ahead of a game against the league leaders, but over the last six game weeks, Arsenal have failed to hit even one xG twice and they've managed to get less than one and a half xG twice. So over the last six game weeks, there have been four games where they have failed to hit 1.5 xG. And that suggests that this may well be a little bit tighter than that 4-1 win earlier this season at the Emirates Stadium. And maybe a Spurs defender is not as mad as it immediately appears. As for Arsenal options, Pierro Enier is surely going to start this one. He got a seven-point return against Brenford, an assist for Arsenal's goal in that one. He is the easiest route into their backline. And with Ricardo Califury missing out in the FA Cup game against Wigan, it seems that Him Capier's place is assured for the foreseeable future. Arsenal's next five fixtures are not easy. Spurs away is not a gimme given the derby and then it's Chelsea, another London derby at home before a trip to Brighton, a home game against Everton and a home game against inform Bournemouth. However, if you get the chance to bring in an Arsenal defender, it's hard to pass up that opportunity. And Pierre and Capier is that opportunity. Of course, the likes of Celiba, Gabrielle, and Yuri Timber will already be taken in the vast majority, if not all of the draft leagues all over the world. And a word for Eberic. No attacking returns in the Premier League of any kind since his hat-tick against Spurs in gameweek 12. However, Arsenal do have a midfield crisis. There is no Michino for the rest of the season. Martin Odigard seems injured. Kai Havtz is injured and Eberici Ezer has scored more goals against Spurs than anyone else. He will start this one. He's just come off the back of a decent performance in the FA Cup against Wigan Athletic. And you could do a lot worse than getting a player of the caliber of Ebberic for this one and for the next few gameweeks. However, if you ask me, EZ or Matteas Fernandez, this is what I mean. It's the glamour pick over the sensible pick, and I will leave you to decipher what the best move is there. It's Everton taking on Manchester United at the Hill Dickinson. This is on Monday the 23rd of February, 2026 at 8:00. It wraps up game 27. Everton haven't beaten Manchester United at home since April 2022 when another of our waiver picks, Anthony Gordon, got the only goal of the game. However, Everton are actually unbeaten in their last two matches against United and did win 1 nil at Old Trafford in November with Ken and Jubury Hall getting the only goal of the game despite the fact they were down to 10 men for about 80 minutes. So, who are the best picks for Everton? Well, first up, Nathan Patterson. Jake O'Brien is suspended for this one. And Patterson, despite having had only three appearances this season where he has played more than three minutes, has got 21 points so far this season, which works out, drum roll please, at more than eight points per match. So, he's had only three appearances where he's played more than three minutes and he's averaging eight points per match. However, word of warning, Everton have only kept one clean sheet in their last seven games. And United are obviously a different beast right now under Michael Carrick, a particularly attacking beast. So, it may not be easy for David Moyes to get one over his old club. However, if he does, maybe Tyreek George will have a part to play. He got 61 minutes against Bournemouth last time out. And David Moyes has spoken quite positively about him and about his flexibility within the Everton team. Moyes said he can play on the left, he can play off the right, and he's played as a center forward as well, which has given me some food for thought. So, Tyreek George could be a player that can fill into a multiple set of positions for Everton between now and the end of the season. As for Manchester United, Benjamin Cesco, who has got four goals in his last four matches, and those goals have come from just one start. In fact, those goals have come from just 151 minutes of action, which works out to the minutes equivalent of 1.6 games. And in 1.6 games, not only has he got four goals, but he's also racked up 2.05 xG, which is insane numbers. He is not a guaranteed starter, he may not even start this one. However, he's surely worth a punt when he is doing that sort of damage in such reduced minutes. And on top of that, after this gameweek 27 game against Everton, it is a gameweek 28 game at home at Old Trafford to struggling Crystal Palace. So, Benjamin Cesco, not a guaranteed starter for United, but a guaranteed option for your draft team as a third striker who will get minutes and has already shown he can make an impact in limited minutes. So, your gameweek 27 top picks for this week. First up, Anton Stack of Lead United, who is expected to return from injury for their game against Aston. Six returns in his last nine matches. He is on set pieces. He ranks highly for creativity and he should be in your draft team if he is available on the waiverss. Kevin Sharda is another pick for you back from suspension. He's had 10 attacking returns this season and Brenford's fixtures are delightful right now. Brighton, Burnley, and Wolves in three of their next four matches. And more of a shot in the dark, more of a punt, but worth it given that their next game is at home to Wolves. Evan Gassand of Crystal Palace. A oneweek punt with the potential for longer if he does the business. Started the last match, got an assist on his debut against Brighton, has a point to prove, and he's playing the worst team in the Premier League. Player for you to consider ditching if you own him. Time to say goodbye to Ryan Churkey, who has started only two of Manchester City's last six matches. It will be a painful goodbye. He has had 11 attacking returns this season in the minutes equivalent of 11.8 games. He is averaging 4.3 points per match. However, minutes are important and if he is not getting the minutes, he is not worth hanging on to. I have hung on to him in several leagues for the vast majority of the season, but I am at the point now where I think it's time to say goodbye to the talented Ryan Turkey. Trade talk to there's one player to consider here and it's a controversial one. It's Pao Sacka of Arsenal who has got just four Premier League goals all season. The last was way back in gameweek 14 in their first matchup with Brenford. His last attacking return of any kind was in gameweek 20 against Bournemouth when he registered an assist. He's currently ranked 16th of all midfielders for total points. Arsenal are not exactly a free flowing freecoring team. Bkayo Saka often has two players on him. He of course commands respect. He of course will command a huge amount of interest if you consider a trade for him. But if I owned him and someone came in with a decent offer, I would consider moving him on because I cannot see him suddenly exploding into life and hitting double figures for goals or assists between now and the end of the season. And I think for that reason, he is a player that you should consider as part of a trade deal out of your draft team. We also opened up the uh show this week to some manager questions and we've had quite a few come in. So, we've got a few highlights for you here. First up, FC Smear Kais or at Nastinov said what to do with Havs when forward options are slim to none. He also asked is it worth keeping Cucarella since he will be out for a third of the rest of the season. And then he said Ryan Gimenez James Hill conundrum. So we'll do this one by one. First up, what to do with Havz when forward options are slim to none. Well Havtz is set to miss four matches. He's already missed one of those. Wigan in the FA Cup. He will miss Wolves this midweek. He will miss Spurs and he will miss Arsenal's home game with Chelsea. But then it is expected that he will be available again. Will he walk straight back into that starting 11? I doubt it. But he will still have a key part to play if this is not as serious an injury as many people feared. However, FC Smearis does say he has slim to none options. So I would say if there is a Ral Gimenez knocking about a Jorgen Strand Lson knocking about or a Dom Salanki knocking about, I would move Kai Havitz out. If there is no one of that caliber around, I would hold on to him and I would look to move him into your starting 11 when he is fully fit again and hope that you've got two playing strikers who can do the job in his absence. He also talks about Kukarella and whether or not he should keep him given that he's going to be out for a third of the rest of the season. Well, it's now been announced that Kukarella is going to miss three to four weeks. His estimated return is the 15th of March. And within that period, there is an FA Cup weekend, the week commencing the 7th of March. So, realistically, he is going to miss games against Burnley, Arsenal, Aston Villa, and Newcastle. And of those games, there's not many clean sheets I can see for Chelsea anyway. So, I would definitely hold on to Kukurella and just wait until he is fully fit again. he is going to walk back into that Chelsea team as soon as humanly possible. And then the Ryan Gimenez and James Hill conundrum. I would go James Hill over Gimenez because despite having played 500 minutes less than Gimenez, he is registering a whole lot more Defcon returns. Seven versus two. And you're not going to get that many clean sheets from Bournemouth. Just two clean sheets since gameweek nine. So if you're going for their defenders, you are looking for defcon return. So, I appreciate Gimenez has been playing further forward and he could of course return an attacking return or two, but I would go with Hill and the solid bet of Defcon over Gimenez and the unlikely bet of an attacking return. And Ryan, I would absolutely get him in. A reminder that Bournemouth's fixtures are very good for the next few weeks. West Ham away, Sunderland at home, Brenford at home, and Burnley away. If you can get in the talented Brazilian teenager, get it done. question as well from Harold Spangler who said, \"My thing is what Brenford assets is best pretty much can get all of them.\" Well, as we said earlier, Brenford's fixtures are extremely appealing right now. Their next four, a reminder, Brighton at home, Burnley away, Bournemouth away, and Wolves at home. And the best way that I find to look at Brenford assets and work out who I want is to do it on a points per match metric. And if you take their entire squad and look at their points per match average, Thiago is predictably out in front with 5.1 points per match. He will not be available on the waiverss. I wouldn't have thought, not even in Harold's league. But Dango Atara is ranking second for points per match, 4.3 points per match. So I would rank him above Kevin Sharder, who is averaging 3.7 points per match, and above even Keller, who is probably unlikely to be free, but he's averaging 3.7. And Nathan Collins, who's averaging 3.8. A but of course his minutes are not secure given the competition for places in the heart of their central defense. We spoke earlier about Michael Kyode. He is the player who is guaranteed defensive minutes if you want a piece of their backline. But I would be looking at Dangaritara and Coyote if I was looking to get in Brenford assets which spoiler alert I am. Also a couple of questions from FPL Rogers and Kenny at ASIC_HK. any of Ryan 8 Nory Ballard or Sessi out for Hin Capier now that Califury is out and what to do with the frequently injured Califury in a nine-man classic league. So, a couple of questions on Ricardo Califury. First of all, FBL Rogers, I would be getting Hin Capier in. I would not be even considering getting rid of Ryan Aory. Newcastle at home, Lead United away, Nottingham Forest at home, and West Ham away for Nori. Lots of potential attacking returns there. Even the potential for a few clean sheets, dealing of City seem to have sorted out their defense to a certain degree. In capier, I would absolutely move for over Dan Ballard. I think even though Arsenal's fixtures are tricky, Spurs away, Chelsea at home, Brighton away, and Everton at home. Califury seems to be struggling with injury more often than not right now. And if you can find a route into that Arsenal backline, you should absolutely take it. And I would keep Sessi over Dan Ballard right now because Bournemouth's fixtures are so positive. They're in form. Their clean sheet record is not great, but Seness's defcon record absolutely is. They have West Ham away, Sunderland at home, Brenford at home, and Burnley away. Dan Ballard and Sunderland, well, they have Fulham at home, which is decent, Bournemouth away, which is tricky, Leads away, which is tricky, and Brighton at home. Yes, he's a safe bet for defcon as is Sessi, but the downside is that Sunderland do not really perform away from home that well and their underlying statistics really paint a different picture to the season that we're seeing. They've conceded just 30 goals this season from an xGC of 41. And like we've seen with Aston Villa, at some point the underlying statistics will become the actual statistics. One more question for you as well in our manager question section and this is from Abu Yaya. Who is more valuable right now, Jared Bowen or Ollie Watkins? And which midfielder has value in the ballpark of the two? So we've done a little outline here of both players, Bowen and Watkins. Jared Bowen has played more minutes than Ollie Watkins 2329 to 1,899. So that's 1-0il Bowen. They've both got eight goals, 2-1 Bowen. And Bowen has more assists, four versus two. He's also averaging more points per match, 4.6 versus 3.8. And he's got more points, 120 points versus 95 points. So for me, it is an absolute no-brainer. Jared Bowen a much better option than Ollie Watkins. As for midfielder equivalents, if I own Jared Bowen, I would not consider giving him up unless somebody offered me someone of the quality of a Brian and Bumo, a Morgan Rogers, a Florian Vvers, or as we've discussed, a Bio Sacka, which would of course be a controversial one. But as I've explained, his form suggests that he is not going to get to the heights that many Arsenal fans expected him to get to this season. So your gameweek 27 to-do list, there is one remaining gameweek 26 fixture between Wolves and Arsenal. So keep an eye on that for any injury news. Maybe Califury will make a miraculous recovery and Pierro and Capier will be off the waiver menu, but I don't think that is going to happen. Keep an eye on those pre-waver deadline press conferences so you can really plan your waiverss accordingly. And make sure you also keep an eye on those post-waver deadline press conferences so you can do the business in free agency. And more important than any of that, follow us on our socials. We're on XM. We're on Instagram at FPLdraft Zone. We're on Blue Sky flone.bsy.social. We are of course on YouTube. Please like this video. Please subscribe to this channel. Please tell your friends all about us. And we are also available on podcast form in your ears. Direct five-star reviews is the payment of choice for that privilege. But that is it for this week's show. Oh, there's one other thing to tell you though. I forgot about this. the newsletter FPLdraft zone weekly brief.behive.com. If you want a worded form of this podcast sent to your inbox every Wednesday and I promise you the English will be better than the sentence worded form, then please go to fldraft weekly.behive.com, drop in your email and we will make sure that our newsletter wings its way to you. But that is it for this week's episode of the FPL draft zone. Good luck in the waiverss. Good luck in free agency. And until next time, it is bye for now. [music] [music] >> [music]"
    },
    {
      "id": "oqJG-g_i8nU",
      "title": "The FPL Draft App That Changes Everything",
      "channel": "The FPL Draft Zone",
      "channel_id": "UC1iLU8Nb1Rb-43Ld6zqCgGw",
      "published_at": "2026-02-09T09:01:08+00:00",
      "transcript": "This is the FPL Draft Zone, your fantasy [music] team's best signing of the season. Hello and welcome to the FPL Draft Zone, a podcast all about draft FPL. I'm Dom Crofts. I hope you are well and today we have a very special episode for you because I am joined by David Gurgis who has created an app specifically for us FPL draft managers. It's called Fantasy Footy. It's available online at fantasyfooty.xyz. It's available on the app store if you are an Apple user and it's coming to Android very soon indeed. David, thanks so much for joining us. >> No, no, thank you for having me. We're going to get right into your app very shortly and show off all its amazing features. But before we do that, you are out in Canada. There is loads of fantasy sport for Canadians out there. Loads and loads of options and yet you have chosen to set up a fantasy draft app for FPL. How did your obsession with FPL draft come about? >> Yeah. No, so I've always been in uh involved in soccer uh or football as you guys call it there. Um, so I've been playing it, been watching it as a kid. I used to go to school, come back, have to put in a VHS tape, uh, to record the games that was whatever was playing for my dad. Uh, and used to watch them again after work. Um, so was always involved. Played soccer growing up as a kid. Played today. Um, and then just started playing fantasy sports or fantasy soccer specifically um, not too long ago, couple years ago. Started with the World Cup actually the previous one. Um, was killing it, doing amazing. Then I actually went to the World Cup, didn't do I forgot about the fantasy app and then came back and then just started with fantasy uh in the Premier League in the FPL and then started playing the uh fantasy draft a lot more and just got really into it. >> Got into it so much that you've decided to create an app for draft managers. How do you even go about doing something like that? >> Yeah. Yeah. No, so I'm a software developer uh in essence and so I was just looking at stats and trying to understand um more data from the league and our our like our league with my group of friends that we were playing with and just wanted to know who was unlucky, who was lucky, what if this would have happened if I had this trade, would I have won? Would I have would that have changed any outcome? And just started pulling data, writing scripts and going from there. Fantastic. Well, let's get into the app then. First of all, we're going to take you through some of the features. So, the appeal of this app for me is that it's got loads of little nuggets that you cannot get anywhere else. It has got your live head-to-head tracking, so you can follow your matches every game week live. Gives you full point breakdowns, projected points, automatic subs, indicators for players on track for bonus points, defensive contributions as well. It also does transfer activity insight, so you can track how active each manager has been in the transfer market, which players have moved around the most between teams. What I love, one of the features I really love is the manager performance stats. So, obviously you have the league table in FPL Draft, but you can create in your app league tables based on loads of other metrics. whose team has scored the most goals, who's got the most assists, bonus points, how that impacts the way the league table would look if that was the chief metric. And then you've got unlucky stats. Tell us what unlucky stats are. >> Yeah. So, that was one of the reasons why I made the app in the start was I wanted to calculate was I just unlucky in my I guess in my matchups. Did someone else have easier matchups? Were they always versing someone that was scoring less? Um, so basically the unlucky stats uh takes everyone's scores every week, calculates the median and sees if you scored above it or below it. And if you scored below the median and you uh or if you scored above the median and lost, then you're considered unlucky. And we do that every week to week. Um, and we keep track of it. And then we create a table where you can calculate who is the most lucky and unlucky person. Um, and you can see everyone's stats there. Um, so we have a a metric to measure how unlucky you were instead of someone just claiming to be the unluckiest. >> Absolutely brilliant. It's also got bench points lost which tracks how many points each manager has lost to the bench across the season. And another one that I absolutely love is the whatif tool. So tell us what the whatif tool is. >> Yeah, so that's another one of uh the popular features I think people love using. Um, basically it calculates what if I was to swap with someone else's schedule. Um, would I have would I have ranked or would I be in a different position? So, if I had someone else's schedule, would I be first, would I be second? And it does that with everyone and calculates your best swap. So, if who would I have swapped or who should I have swapped with and been highest ranking in my league right now? >> Brilliant stuff. Well, what we've done is we have taken all the data from your app and we've plugged it into one of our leagues, which is the FPL Draft Zone Championship. There are three leagues at the FPL Draft Zone and the Championship is the Middle League. It's got 10 managers in. It is a head-to-head format. So, let's first of all take a look at the league analytics page that pops up on the app when you load it up. The league analytics on the lefth hand side, if you're watching us on YouTube, has quick stats. So, it has the most FPL points in that league. So, the team top of the league, well, not necessarily top of the league, I suppose, but the team who's accured the most points, which in this case after 24 gameweeks is 1,152. It has the fewest FPL points. It has the total matches played and the point spread. And it also has little individual stats that give you bragging rights over your mate. So, the top gameweek score of the season so far, 75 points, which I'm proud to say was my team. Uh and the best win streak in the league, six wins on the spin and that goes to Liam Smith whose side is draft excluded and who are top of the table as you can see in the middle column. Current win streaks are also ranked. So I have a twoame win streak right now and that puts me top. And then on the right hand side is a little line graph which you can plot every single team into and that tells you week by week where you were in the league at any given week and plots out your entire season. So that is that's the the sort of the league analytics tool. This is something I absolutely love which is all leagues combined. Tell us what this is. >> Yeah, so this is on the website actually. So, this allows you if you're in multiple leagues, you can just input both all your leagues into your account and then you can combine them to see how you rank um throughout all your leagues and how everyone ranks in that sense. And it has the league name in them. And that's why you can see that there's different league names for everyone. >> Yeah. So, this is four different leagues. We've got the three FPL draft zone leagues and also one of my local leagues. And these are the top 10 total scores across those leagues. So shout outs to Tyler Keller, Liam Smith, and Tom Waldy who make up the top four. Dan Walker just missing out on the top four. He's in fifth. And George Stthopoulos is down in 10th. But very competitive when you look at that. That is like almost like the ultimate draft league, isn't it? It's fantastic idea. We've also got the best manager tool, which is another really interesting one. Obviously, you've got the league table, which is what it's all about, but this is how other metrics measure your teams. So, a reminder that in this league, Liam Smith is top, Mike Whitefield is second, and I am third. So, the total points are on the left hand column of the screen if you're watching this on YouTube. Liam's got 49 points, Mike's got 45, and I've got 42. But if you look at the goals on the right hand side of this screen in the third column, that tells you an awful lot about why Liam is top of the league because he's side has scored 223 goals. And that is miles clear of anyone else in this league. I'm down in sixth with 164 and Mike who's third has got 171. So, this is the sort of thing, David, where you sort of look at these stats almost through a different lens because you're looking at them and you're going, actually, that's where I'm failing. That's where I'm succeeding. And I think we've got more of that on the next page because in the assist ranking, if you look on the left hand side of this column, Mike, who's second in the league, is ninth for assists. And Liam, who's top, is down in sixth. Pretty crazy. The same could be said about clean sheets. Mike's got a pretty good defensive record. His title challenge is built on defense from the looks of it. And I'm down in ninth with just 101 clean sheets. And then saves. I'm up in second with 25. And Mike is down in 12th. And Liam is eighth. Bonus points. Liam is well clear and I am in third. And Mike Whitefield second in the league down in 64. So, what would you say when you're looking at these sort of metrics and you're looking at the differences? Do you as a manager, as a draft manager, look at these and go, \"Okay, I need to get players in who are scoring more goals. I need to get players in who are scoring more bonus points.\" Do you look at them and do you use them for your own draft team and try and work out where it is you're going wrong? >> Yeah. No, that's exactly where I do use them actually. I look at them, you see a breakdown of where you're lacking, where you're not lacking, and I try to adjust it. So, if I'm if I'm really low in I guess um like like goals, then maybe I'm going to need to try to fix up my forwards, my mids, see maybe get more attacking mids um and and just try to fix that up because you can generally see a th a trend when you look at players that are top in the league and then when you're looking at yourself and try to improve your squad as much as you can. Um and the website has even more of a breakdown where you can see uh by position uh by by players and so on. Um, so I can look at my my defense and see how I rank defensively in my league versus maybe who's first defensively. Um, so use that always to help me pick up players or trade players throughout the league. >> I always thought defensively I was pretty solid, but ninth out of 10 for clean sheets, that is where I am going wrong in this league. It's also got a lovely head-to-head feature, which is a live head-to-head. So on a match day it will give you updates live as to what's happening. On the left hand side of the screen you can see that this is taken from gameweek 24 where in this league there were five matches. The average score across those five matches and 10 teams was 42 and a half points. And down at the bottom of the screen you can see the individual matchup. So that week I actually played Whitefield's Warriors and edged that one and the league leader Liam Smith beat Gab Gabrielle Blide House in a very highscoring 5751. But it also has top scorers for every game week as well which is another nice little chart that you can follow. And on this week it was Hugo Eat who came out on top alongside Casemiro with Florian Vvers Domanki and Kenati making up the top five. Tell us about the transfer analysis tool. >> Yeah. No. So, in my league, we have one person that pretty much dominates our transfer window every every week. Um, with a ton of trades in, backup trades, waiverss, and so on. Um, so the transfer tool is just a way of tracking it. Unfortunately, the Premier League app doesn't actually provide you any of that stuff. It shows you during the week of, and then they disappear. Um, so this is a way where you can track, see how many trades are happening, who's has the most trades in your league, and what kind of trades they're doing, and just keeps a record of them. And then that way you can actually look at analysis afterwards. Was this trade good? Was it bad? Would this trade um have cost me the match? Or did it did it cost me or did it not? Uh did it make me lose my matchup that week? Um so it's it's really cool stat that it helps and you can constantly see who's trading for what. And if you want to maybe look at the next week's matchup, I'm playing against someone else, you can look at it and see if they're more likely to make a trade or not based off their previous trades as well. So, in this league after 24 weeks, 601 transfers. Is that above average, below average, or about about average? What do we think? >> It looks like it's uh it's a high number there. I won't I won't lie for sure. But, uh every season has people that are trading constantly, but there's there's been higher I've seen, and there's been much lower, of course. >> Good to know. Uh you did mention there that you can track good transfers and bad transfers, and this is another bragging rights kind of feature. It lists the best trade of the season in your individual leagues and the worst trade of the season in your individual leagues. So in this league, Burke has the bragging rights because he traded out Meankovic in game week six and brought in Alderete of Sunderland, which gave him a plus 16 point swing. And Liam may be top of the league, but he had a stinker in gameweek 12, transferring out Marillo for Van Hec and costing himself 15 points in the process. So, another lovely little feature there that really does get you the sort of the adrenaline pumping when it comes to your rival managers. We talked a little bit earlier about unlucky analysis. We've got on screen what it is on the app then how it explains it, but do you want to just talk us through this again? >> Yeah, so pretty much this is the way that I calculate if you're lucky or unlucky. Um, so an unlucky loss, you scored above the median and you still lost or uh if you're lucky, you scored below the median and you won. And then we calculate something called a luck score. So we take if you the amount of luck like lucky wins you've had and we take the unlucky losses and we calculate your score overall. So that way we can calculate if you wanted to look at who's unlucky but at the same time maybe you've been lucky a bunch of times as well >> in your league. Are you a lucky manager? >> I am I think I'm on the average or I'm one above lucky. There are much luckier people in my league and there are much unlucky much more people that are unlucky in my league. So, I'm in the middle. So, >> okay. Well, let's take a look what it's like in this league. The most unlucky manager is Tark Life, managed by James Doyle, who has had three unlucky losses, which means he's down minus three on luck because he has had no lucky wins. On the right hand side of the screen, you can see how this plays out. I'm pretty unlucky as well, by the way. Two unlucky losses, no no lucky wins. Murder on the Dano has had a bit of luck and a bit of bad luck. Three unlucky losses, two lucky wins. And Isaac Kaer, two unlucky losses, and one lucky win. But look who's at the bottom of that table. Mike Whitefield in second place in the league. Two unlucky losses, five lucky wins. when you look at something like that and and also I should say by the way Liam is in fifth for luck rankings. Two unlucky losses, two lucky wins. So he's breaking even. When you look at Mike Whitefield there, is that telling us that he's maybe in a position that he perhaps shouldn't be in. >> Could be, could be not. Time will only tell. >> Time will only tell. Very, very diplomatic of you there, David. I appreciate that. Let's talk about the whatif analysis then. So tell us what this is that we're looking at on screen. >> Yeah, so this is a hypothetical um scenario where if I I will take my team or my uh and compare it with the rest of the league and if I was to have someone else's matchups. So it shows me in this purple little window your current position uh your actual record. So your wins, draws, and losses and your luck factor. And then afterwards um there will be a drop-own menu where you can go and you'll see if I had someone else's schedule where you would actually rank. Um, so that way you can actually see what if I had someone else's, I I I would have been first maybe or maybe you would have been last or maybe first would have been last if they had my schedule. We never know. So this is an actual way of calculating every single scenario that's out there and um and just showing you in your league where you would have ranked. And I feel like we're picking a bit on Mike here, but we the only reason we've used Whitefield's Warriors here is because his league position changes so much based on each manager's schedule. So, we're going to have a look at that now. So, if he had the schedule of Liam Smith, who's top of the league, Mike, who is currently second, would be down one place in third. I'm in third place at the moment. If he had my schedule, he'd be down in fourth. But if you look on the right hand side of this screen if he had Burke's fixture schedule, he wouldn't be second in the league. He would be bottom of the league. I mean, that is an absolutely unbelievable statistic and it's something that you just cannot get anywhere else. No, you can't. And it's it's something that uh shocks everyone when they see it. And and there's even a tool beside it. There's another tab where it'll allow you to see the breakdown of week by week. Some people don't believe it, but that way you can track it week by week and see it. But yeah, maybe he's just lucky that he got his schedule then and not Burks. It looks like >> it does [laughter] look that way, doesn't it? It does. If he wins the league, my god. Okay, let's take a look at bench points lost. This is another tool that again I have not seen anywhere else. So, why don't you tell us about this? >> Yeah, I know. So, um, typically we have people in our league that are always leaving players on the bench, always picking the wrong players to start and losing so many points on the bench and losing game week. So, this is just a way to track like every week how many points were lost on your bench and how many and week by week who the who the player was and how many points that was. And then at the end, it's nice to see like who had the most and who had the least. And it could have been from injuries, could have been from just poor man team management. I guess you'll have to do a further analysis for that. >> I was going to say it's either poor management or bad luck or a bit of both. In this league, 1,339 points have been left on the bench in the first 24 weeks of this season. That's an average of 134 points per manager. But the manager who has wasted the most points by benching players he shouldn't have is James Doyle, who has cost himself 206 points. And by contrast, Liam Smith, who is top of the league, has cost himself just 135. When you look at this, and you've obviously got access to all sorts of leagues, and you and you you use your leagues presumably in your app, is 206 points a lot of points to leave on the bench, or is that is that an acceptable amount? >> I won't lie, it is a lot more than what we have in our league and it is uh typically more than the average. Um, but there are leagues that actually have more than that. Um, but everyone plays differently. Everyone is unlucky at times. Benching players or sometimes the smaller leagues, they have better players and their bench is typically better players that are possibly going to high have a higher ceiling. Uh, but in this scenario, it it does seem high for a 10erson league. >> Okay, that's interesting to know, James. Do better, my friend. Do better. Okay, let's talk win streaks. This is another nice little feature you've got. What's this all about? >> Yeah, this is a way of just seeing who who's on fire, who's basically um like like winning their games, who's losing their games in a row. And then the longest unbeaten is even with ties, like with draws, any kind of draws that are there. So, looks like Liam is on a winning streak, and we're going to see who's going to be the one to break it. Um, and then Richard, he's on a losing streak, but I guess he Richard's got to do something different uh to break this losing streak of his. >> Yeah, I I think if you get three plus wins, you're classed as on fire. If you get three plus losses, you're classed as ice cold. And then the season records, again, nice bragging right opportunity for you. So, the longest win streak in this league, Liam Smith with six wins. The longest unbeaten, eight games again, Liam Smith. and the longest losing streak, Richard Ellinger with nine losses. Although I should say Richard is now no longer bottom of this league. So well done to Richard for plugging away and finally getting himself off the bottom of that league. Tell us about this as well. This is the end of season summary. So this is another tool that you offer at the end of each campaign. >> Yeah, so this is something that I came up with last season. Um I was when I would pull the data and all that, the data is typically deleted at the end of the season. Um, so I wanted a way of keeping remembering the previous seasons on how did everyone do? Um, what was your squad? Um, how did everyone rank compared to everyone? So this is just something that I created and it it basically every manager is listed at the very top in a certain color with their points and you basically follow your color. So you'll see when you go down you'll have your MVP player. So the player that you had on your squad throughout your season that got you the most points. You'll see a breakdown in a little bit of circle graphs. you'll see uh a breakdown of where majority of the points came that season. Was it from forwards, midfielders, defenders? Um and that can help you with planning your next season can help you planning this season. And then at the end of this whole PDF is my favorite feature is where you see your starting 11, your top players that with all the trades that you've been doing that got you the most points throughout the entire season that year. Um and just a little visual so you can see everyone and it's a nice way of just keeping record of that season. This is how we all did. >> It's lovely stuff. So, when you started this app, before you launched it and you kept it to yourself and you were testing and testing and testing, was there not a part of you that thought, I'm going to absolutely coast my leagues if I keep this to myself? >> I I I wish that was the case, but uh in the end, there's so much stats, there's so much uh stuff that happens, but you never know what's going to happen. You're going to find a player that was dominating in the previous season not dominating in this coming season and vice versa. The players that come out of nowhere that just start an amazing form scoring goals, defensive contributions, a new rule that came out of there. So stuff's always changing. There's so many factors and this is just one tool that can help you, I guess, optimize and probably make better decisions. But in the end of the day, unfortunately, there's no tool that can just win you the league for you. And there are so many amazing features, the sort of features that I have never seen anywhere else, which makes it so good. Have you got any in the back of your mind where you're like, I haven't actually introduced this feature yet, but this is next on my list of the things I want to bring to this app. >> Yeah. No, so we have a handful of features that I have uh me and a group my friends and all the feedback I've gotten from just users throughout the uh using it because I'm active user on this as well. I we have our iOS app that just came out and I love the widgets. Um, so I have a widget that you can see all the scores, everyone head-to-head. Uh, but every week I there's more features that I'm planning on working on in development, but um I guess we'll have to wait to see them all come out. >> And you mentioned there that it is available on the App Store for iPhone users. When is it going to be available for Android users? >> So, we're hoping or I'm hoping in 3 weeks. uh roughly is a rough timeline, but um it's all going to depend on I guess how far I get in development in that side and the approval process with the Google Play Store. Um so all a bunch of factors to take into account, but I'm hoping as soon as possible, >> but in the meantime, it is available online as well at fantasyfooty.xyz. Would you ever consider approaching Fantasy Premier League and saying, do you want to get into into a partnership with this? Is that is that your end goal or is this really just something that you you're sort of seeing where you can take it? >> Yeah. No. Um so I this was always just a passion of mine just trying to calculate if I was unlucky and lucky and turned into something really big with a lot of uh interest from others. Uh but no, I would love it if the Premier League could integrate all these features, all these metrics and all this directly into their app. I have no problem helping them with that. or if they want to kind of have a way to connect this app to that one at their own, that would be great as well. Um, but I think it's something I'll continue to work on just in my meantime and spend to improve as much as I can just for any FPL draft users. Just feel like it's neglected a little bit on the FPL app. It absolutely is. So, David, one other question I have for you is obviously you've got the standard app elements, but you've also got the premium elements. So, if you want access to the premium elements, how much have you got to pay for that? >> Yeah, so the price is currently $5. Um, and then I think majority of people are using it in the UK right now and I think that's around 3.5 quid over there. Um, so um the goal is hopefully one day maybe we can get rid of the pricing uh and integrate directly with the Premier League. Maybe we'll take a different route, but I'm trying to get as much I'm trying to get the price down as much as possible um and just cover the cost of hosting an app and database and all this kind of backend stuff that the users typically don't know um is there. So um I'm hoping that it's not too much money for a person that's using it and um doing my best for everyone. >> It's fantastic. We're we're all extremely grateful. So, Fantasy Footy is the app. Tell us one more time how people can access it and how they go about getting it. >> Yeah, so you can access Fantasy Footy directly in the iOS app store by just searching Fantasy Footy and downloading it there, making your own account and they have a nice search on there where you can look up your league ID. U just writing your name or your league name or even your your the name that you made for your team. Um it's also available online on websites. So, fantasyfooty.xyz. Um, you can make your account there. There's a free version and a premium version there as well. And hopefully we're coming to um Android soon or Google Play Store uh for everyone else. Um, but that will be in the future. And we're on um Instagram X, Tik Tok, and we're hoping to expand further and further. Uh, but so far we're working our best. And if you have any questions there, my email is throughout so anyone can email if you they get stuck anywhere. >> Fantastic. Give us your socials then. What are you on Instagram and X? >> Fantasy footie. So fantasyfooty.xyz or just fantasyfooty. Um you'll be able to find us throughout um using that. >> Fantastic. David, it's been a pleasure talking to you. Thank you so much. I think it's a brilliant app. Everybody needs to go and check it out. It's got so many amazing features that you just don't find anywhere else. I'm very grateful for you spending some time chatting to me about it. That is it for this week's edition of the FPL draft and we'll be back very soon indeed with another look at another gameweek. But until next time, it is bye for now. [music] [music]"
    }
  ]
}