{
  "category": "fpl_draft",
  "scraped_at": "2026-02-21T12:26:39.408915+00:00",
  "days_back": 14,
  "video_count": 2,
  "transcript_count": 2,
  "videos": [
    {
      "id": "fT-qEnVH9JE",
      "title": "GW27 Best Waiver Pick Ups | Draft FPL",
      "channel": "FPL EWG",
      "channel_id": "UCm6sLxW8u9Bk9Vbqde_PsIw",
      "published_at": "2026-02-16T16:36:12+00:00",
      "transcript": "We are back. Gameweek 27, top five FPL pickups for you. We've obviously had an extended break as it was the FA Cup over the weekend. So, we've got to get into these players. It's a nice time to look at who are these reserve players that we're going to be looking to pick up. Maybe they're looking to break into the first team for the back end of the season. Maybe if a player goes down injured, who's going to be the one that I think they're going to call up as their replacement. But starting off with James Hill, he has come in for Dear Keit at center back for Bournemouth, which was a bit odd cuz he was playing at right back before then. Him and Gimz were having a bit of a battle there, who's someone I've recommended in past videos, but Hill's been moved to center back and I mean with West Ham away coming up and six, seven, seven, and nine points in his last four games. Weirdly, three of them coming from assists, which is not what you'd really expect. Um, but he's been doing absolutely fantastic. One clean sheet as well in that time. Defcon points galore. I think he got 20 Defcon points, which I mean I think that's that's got to be some sort of record up there. Um, but yeah, he's been starting obviously playing very well. West Ham away, West Ham on the up. Obviously something that I've not even touched upon was the sacking of Thomas Frank and the sacking of Sha Daisher and Nottingham Forest. West Ham really really putting the pressure on those two teams in a relegation scrap. Both of them have slammed that panic button. Um, which is going to be interesting to see how that works out for those players being a Salanki owner and a Morgan Gibbs White owner. It's been a bit of a uh a tough season watching those two teams, but who knows what's going to happen. Anyway, like I say, we don't care about that on this channel. We care about FPL and James Hill is someone that you should be looking at to get in even with this improved West Ham team. another player to get in that I recommended a few weeks ago. He came back with a goal and assist and then the last two games he hasn't done anything but should be noted he did score in the FA Cup over the weekend and with Fulham at home coming me being a Fulham fan I just know how terribly defensive our midfield is. Terribly defensive how bad we are defensively in midfield. Alex Aobi has stepped in there. He gives that attacking aspect but defensively is weak. Uh Sander Burgerer sits alongside him. He's the defensive presence, but realistically he's not incredible at it, you know. I mean, person to put him against is what, Rodri, but that seems a bit harsh or Kaisedo. He's definitely not someone like that. And someone like Diar who's powerful, got the legs and can run in that midfield. I really think he can get some opportunities to either get a goal or an assist um breaking from deep against this Fulham team because it's something we've really struggled against. And like I said, he's scored in the FA Cup, so he could be looking. That's what two goals and one assist in the last four games in all competitions. So he can see if he can carry that on. Another player who is making the best of an opportunity coming back from return with OAR having been out with an injury. Still out with a knock it looks like for this week coming Aston Villa away. Bit of a tough fixture, but one goal and one assist in 81 minutes. I believe it was against Chelsea, wasn't it? Um, so he's a really good attacking threat. Dominic Havat Leuen as that other more focal point number nine. He's the play on the last man, the classic big man, little man sort of combo. Uh, starting in behind. Really like him. He was doing really well earlier in the season. He was a great pickup then. I did recommend him back then. Then obviously got some injuries and dropped out of the starting lineup. He hasn't really been playing much, but coming back 81 minutes, goals and assist. You've got to hit these streaky players when you can and get him in. Definitely going to be a good, you know, like I always say, third choice third third choice forward for you. Talking about another third choice forward, we've got Tammy Abraham come back to Aston Villa. He obviously was there back in the championship days. Um, leads at home. Good fixture. The lead's obviously also putting a lot of pressure on this Spurs and Forest team about relegation, but Aston Villa obviously flying at the top of the table. Are they still in the title race? Are they not? Who knows anymore? Uh, but we don't care. Leads at home, goal in the FA Cup. This is what I'm talking about. Goal in the FA Cup. And you can start seeing these players hitting a little bit of form. Ollie Watkins obviously has had a bit of an up and down season so far. They're in competitions left, right, and center. still in the FA Cup, still obviously in Europe, still fighting for the Premier League. Does that mean, you know, if the Premier League peters out, let's say, this is what I'm thinking, Ollie Watkins gets taken out of the Premier League, and if they're going deep in the Champions League, deep in the FA Cup, Watkins starts starting as the striker there, Tammy Abraham can do a job to get them the top four secured and Champions League secured. I mean, it's it's something I'd like to see. Obviously, he'll be getting minutes along the way. Tammy Abraham, he got 15 minutes, I believe, in the last game. So, coming on against these tired defensive lines if you're looking for this third choice uh center forward, especially if you're in a 10 plus man league, you know, I know there's some of you in 12man leagues out there. Tammy Abraham, I think, is a good pickup to have there because Ollie Watkins get does get the occasional knock. He is not a spring chicken and he is a bit injuryprone. Being a Watkins owner pretty much every single season of FPL, I know exactly how annoying it can be having him as suddenly he will just blank out of the blue. But anyway, another player, one of my own, Rodrigo Mun is back from injury. I cannot tell you how excited I am for this. He played in the FA Cup and he was just distinctly average, but that is because he has come back from a long-term injury. Sunderland away obviously the opposite fixture for Diara he's going to need some time ra Gimenez will be the starting line at least for the next few weeks while while Mun gets his fitness back but much like Tammy he will be getting minutes he got subbed on for RAL in the last Premier League game he started in the FA Cup game obviously getting minutes he looked very tired and very sluggish towards the end he's normally a good physical presence hold up players can play off him he didn't quite have that sharpness he got a couple half chances is which he could have done slightly better with maybe in the FA Cup game. But like I said, I think a general rule of thumb, I remember hearing this years ago, general rule of thumb is give the player four games. I mean, this was back when it was one one game a week, but four games, maybe four weeks to get back up to fitness, week four, they'll be absolutely flying. So, if Mun can count, has already sort of have had two, then we can start seeing hopefully some returns to help you win your game weeks in the next few weeks from him. So, if you like the video, please give it a thumbs up. Comment down below any players I should keep an eye on that you want me to have a little speak about if they're on your transfer um on your waiver wire, I should say. I'm always happy to help in the comments and subscribe going forwards. I bring these videos out every single week to help you win your game weeks."
    },
    {
      "id": "XV9MQjwanRA",
      "title": "GW26 Best Waiver Pick Ups | Draft FPL",
      "channel": "FPL EWG",
      "channel_id": "UCm6sLxW8u9Bk9Vbqde_PsIw",
      "published_at": "2026-02-09T16:48:43+00:00",
      "transcript": "Another crazy week in the Premier League. City coming back 1-0il down against Liverpool to keep this title charge alive from them. It's going to go down to the wire. But do you know what? As I always say, we don't care about that on this channel. We are strictly FPL related. Gameweek 26, top five pickups for you. Let's get straight into it. Someone I had in last week's video, Ryan. He's come in as the replacement to Antoine Seamo and he's delivered in the first two gameweeks. He's had two games, started on the weekend, one goal, one assist in those games. I mean, Seeno was obviously an incredible player. He hit the ground running at Manchester City. He's been playing extremely well at Manchester City, but they seem to have found a perfect replacement for him. You know, it's not down to the system. Maybe it is slightly down to the system, but the recruitment's been fantastic getting him in. It looks like he's going to be getting all the opportunities. So get him in before anybody else in your league can because if he can replicate anything that Sema was doing before he moved to Manchester City and arguably how how he is still performing at Manchester City, it's going to be a fantastic pickup. Everton away in this game. Bournemouth on a decent run now coming back after a very very long tricky stretch for them. Everton started the season really well at home but as of late have not been great there at the Hill Dickinson Stadium. Obviously moving to that new stadium always takes a bit of adjustment period uh for teams. Everton looked very good at the start, but now we're starting to see some cracks form at home. Bournemouth obviously a very good away team as well. Like to hit teams on the counter, soak up pressure, pressure from the front. So I think it's a fantastic game for Ryan to get in the goals again and get him in definitely. The next player, the new Nottingham Forest striker, straight over from Italy, Luca. He I mean, I didn't know too much about this guy when he came in. I think he was at Napoli before. Um, and he got a goal on his debut. He only played 36 minutes, but got a goal. Think what struck me mainly was his physicality. He is a big man. He is a proper Sha Dice center forward. Thinking old school Chris Wood. Obviously they have Chris Wood there already, but that sort of type of player obviously fit into the forest system so well last season with Chris Wood. Perfect center forward for Sha Dish. 36 minutes got his goal as well in the loss. It's means that it's going to be a massive game now for Nosium Forest home against Wolves. So, I think they're going to be looking for the win in this. Well, they look for the win every week, but it's more important on this one because I think they're only three points now above West Ham um who are in the relegation zone. So, it's a massive it is a must-win this game for them. And Luca I I think could get the nod and get the start. You know, the next player, another striker. This one's a little bit off. Liam Dap, I don't know what it is, but I just think Liam Dap may get the nod home against Leads. a decent fixture. Chelsea have been doing very well under Liam Rinhia. There's been a fair bit of rotation in this center forward position. I don't think necessarily is Rosinia trying to find out who's his best, but there's just been so many games for Chelsea. Obviously, this is a mid uh midweek games uh this week. So, there's a short turnaround Tuesday and Wednesday games. So, I'd look to get Dilap in. I think it could be very good for him. They've got Burnley at home in the next game week as well, which is a fantastic game. So, if he doesn't play against Le, I expect him to play against Burnley. So, even if it's not that great for you this week, it's fantastic for next week. But I think also his physicality, Le have been so physical that I think it'll be beneficial to have someone like Dilap there who can go up against the center backs. They've been playing sometimes, and I imagine they will in this game, five at the back um leads. So, they need a bit of physicality up there. Dilap can offer that for them more than the likes of Xiao Pedro who's also been banging up there which is probably the only issue I'd say in this. The next player like I said another Forest player in their massive game home against Wolves. Ola Ana is back. He's been back for a while now. They need I think what Dish is going to be doing is just hammering in the short turnaround. Defensive defensive defensive clean sheet. If we do not concede I think he will back himself. Luca especially maybe a set piece get a goal from somewhere they've got the creative assets Amari Hutchinson Gibbs White now Luca they've got goals in this team but it's keep that defense keep that clean sheet at home against Wolves who haven't been obviously as we know great this season they they're bottom of the Premier League they've been the worst team there is I think Dai is going to be looking at this going right massive game six points keep the clean sheet if you keep the clean sheet worst worst case you're getting one point which at least can put them forward I'm not 100% sure who remember who West Ham have this weekend, but I mean if they can open that three-point gap to a four-point gap, it does give you a little bit of breathing space going forward. And the final player is someone on the other side trying to take away the Nottingham Forest clean sheet. He is mainly in just because he's come in as Wolves new center forward taking over from Strand Lson. I believe he did get an assist on his debut as well. Wolves as we know are going down but they have been making a fight of it since Rob Edwards has come in they've looked a lot better a lot better offensively as well. If this is the man Rob Edwards wanted and looks like he was then I don't see any reason why if you're struggling for a third choice center forward, he's going to be there. He's going to be available. He's probably going to start 90 minutes every single week for you. At least he's there. you play them on decent fixtures when they're at home or your other two strikers have really bad if fixtures or injuries worst case scenario. Should be noted this is sort of the perfect reason why double game week for him this week. Nosium Forest away Arsenal at home two horrible gameweeks but if he comes out with four points that's still not not bad. I mean, a lot of center forwards that you probably have as your third choice would be getting you one, maybe two points if you're lucky and you've got three starting center forwards, especially in these deeper leagues. He's going to be someone to get in at least for this game week, just to get four points up there if you are really looking for something. But as always, give this video a like if you enjoyed. Thank you so much, guys. The last video absolutely blew up. I mean, I think it got over 700 views, which is a by far record for in in season videos that I've been making. So, thank you so much for that. Comment down below any players that you have been looking at or any players I should be looking at on waiverwires to bring up in future videos. And subscribe, of course. Going forward, I bring out all these videos to help you win your game weeks."
    }
  ]
}