{
  "UibuNAIq_lI": {
    "id": "UibuNAIq_lI",
    "channel_id": "UCweDAlFm2LnVcOqaFU4_AGA",
    "title": "FPL GW27 Transfer Tips | Buy, Sell, Keep, Avoid? 🤝🏼 #fpl",
    "published_at": "2026-02-19T07:00:21+00:00",
    "transcript": "It's time for your Gameweek 27 transfer tips. One player you should buy, one you should sell, one you should keep, and one you should avoid by Thiago. And whilst the league's second top goal scorer has disappointed in some recent tough fixtures, one thing is certain. Good fixtures breed good form. And you know what? I don't even think Thiago has been playing badly, he's just been a bit unfortunate with fixtures and not getting as much service as he needs. He had the best chances of the game in a tough performance uh and an excellent performance really against Arsenal. And with Bryson, Burnley, Bournemouth, Wolves, leads and Everton in the next six, I think that changes. He's playing some of the very weakest defenses in the league, in particular against teams that concede a lot of chances from central areas from strikers. So whilst the unengaged FPL managers will simply look at points and say Thiago is not worth it, those in the no will snap him up whilst his stock is low, buy the dip and reap the rewards. Cell Tarovski. Now, unfortunately, Everton just have a pretty tragic run of games. Now, they face Man United, Newcastle away. Burnley, Arsenal, Chelsea, Brenford, and Liverpool in the next run. Outside of that Burnley game, Tarovski isn't really playable. And for 5.7 million, you can't really be benching him for six out of seven game weeks. That's just a poor use of budget. Maybe he could be forgiven if he was still getting defensive contributions or Pigford was still bailing his team out for clean sheets. But it seems the points have dried up and pretty much any Everton defender or indeed goalkeeper can be sold. Keep Enzo. This guy went from scamming points to dodging them within the space of two weeks. Back-to-back blanks may fool you into thinking that Enzo is no longer involved in the attack, but it's just not true. In fact, during this twoame week period, if you take away the penalties, no Chelsea player has generated more expected goal involvements than Enzo. That means he's putting up better numbers than Joel Pedro. And he's putting up better non-penalty numbers than even Palmer, which means if there are no penalties against Burnley, which I wouldn't hold my breath on, by the way, Enzo is just as good as the more fashionable Chelsea attackers right now. Avoid Joel Pedro. Now, I cannot stress this enough. If you already have Joel Pedro, you should 100% keep him. You should maybe even think about captaining him. But if you haven't bought him yet, you're kind of too late at this point. Burnley at home this week is a great fixture. And I think he will get points here. But after that, he faces Arsenal away, Villa away, Newcastle, Everton, Man City, Man United. This is the worst run of fixtures of any team in the Premier League after Gameweek 27 for Chelsea. And whilst he has thrived against some weaker oppositions and scammed three penalty assists in uh two games from dumb opponents pushing him over beyond gameweek 27, you're probably going to want to sell him anyway. So the real question is if you're only just buying him now, is it worth two transfers? One to buy him this week and another to sell him next week. So congratulations genuinely to those who had the foresight to bring him in early. But for those only thinking about it now, I think you missed the boat. Make sure to drop a like and follow for more FPL tips.",
    "transcript_fetched_at": null
  }
}