{
  "category": "politics",
  "scraped_at": "2026-02-19T19:38:59.488517+00:00",
  "days_back": 14,
  "video_count": 4,
  "transcript_count": 4,
  "videos": [
    {
      "id": "sfug2y5NFMs",
      "title": "\"This is immensely damaging\" | Reaction to Andrew Mountbatten-Windsor's Arrest",
      "channel": "The Rest Is Politics",
      "channel_id": "UCsufaClk5if2RGqABb-09Uw",
      "published_at": "2026-02-19T19:05:21+00:00",
      "transcript": "Welcome to an emergency episode of the rest is politics with me Alistister Campbell and today not with Rory Stewart but with a very old friend and colleague of mine Charlie Forner. The reason for this special episode is the huge news and it is huge around the world this Andrew Mountbatten Windsor formerly Prince Andrew has been arrested on the Sandingham estate. He's been taken into custody as his homes are searched and he's being quizzed in relation to possible misconduct in public office. It's just the latest chapter in a long saga involving Andrew and the child sex trafficker Jeffrey Epstein who ended his own life seven years ago now yet whose impact continues to reverberate in so many ways not least for the survivors of his crimes still seeking justice and should say Andrew Martins has repeatedly consistently denied any wrongdoing. Now Charlie first of all thank you so much for doing this. >> Thank you. On a scale of 1 to 10, how gobsmacked were you to hear the news that the king's brother, supposedly the favored son of the late Queen Elizabeth, is spending his 66th birthday in a police station, being grilled about a crime which, if proven, carries with it the prospect of life imprisonment. Well, absolutely amazed in the context of thinking about this from a sort of distance of a few years, but less and less amazed as two things have been happening. One, the release of information about Epstein from the Epstein files and as it were, everybody recoiling in horror in what they're reading about a whole range of people. But secondly, the increasing sense that the law enforcement authorities in the UK would be bound to act if the idea that everybody is equal before the law had any meaning. So it became, I think, more and more likely that the normal steps in investigation would take place, not only as against Andrew Mountbatten Windsor, but also against, for example, Peter Mandlesson, who got caught in exactly the same sense that the law enforcement authorities just could not do nothing. What was really interesting and watching the whole thing unfold this morning was these police cars arrive. Now, were there media already there staking out Andrew? Did the police tip them off that they were going to be there? But why was he arrested? Surely at this stage of investigation, wouldn't the normal process be that you'd perhaps make contact with his lawyer and say, \"Would he come in for a conversation or could we set up a meeting or whatever it might be?\" Why would they go this heavy-handed? Is that to show that are they deliberately saying nobody is above the law and we're taking this very seriously? >> Well, I mean, I don't know. I couldn't agree more with you that it's quite odd that they arrested and even if you've got a reasonable suspicion that a serious crime might be committed, you're only allowed under the law to arrest somebody if it's quote necessary to do so. And the normal things about necessity are, are you going to flee the country? Are you somebody who might start to damage property? Neither of which I would have thought would be in play here. The normal, as it were, justification given for necessity is quote to allow prompt and effective investigation. So the effect of arresting Andrew Mountbatton Windsor was first of all it means that the police can ask him questions because if you're not arrested you don't need to stay in a police station to be asked questions and secondly it allows them to take away from his home or anywhere else that he occupies or on his own person evidence that might be relevant to their investigation. for example, mobile telephones or computers, you would very frequently arrest somebody who's not a flight risk or anything like that because you want without them having the chance to, as it were, prepare themselves properly, ask them lots of questions. >> Now, we understand and I I you know, we don't know that much. There's wallto-wall discussion and debate about this, but we understand this relates to his time as UK special representative international trade and investment. UK trade envoy. >> Yeah. >> Which was a position that he had for about a decade starting when when we were part part of the government. So it's not so far as we know at this stage about allegations of the sexual abuse for which Epstein has been convicted and he was in prison as we all know when he ended his own life. Tell me about the charge misconduct in public office. Whenever I hear that phrase, I don't know why, but Boris Johnson comes into my head, but of course, he seems to have got away with quite a lot of stuff so far. What do you have to prove to establish that a crime has been committed related to misconduct in public office? >> Well, first of all, you've got to be a public official of some sort. And the most common charges are often against police officers. >> Okay? And if you're a member of the royal family, I don't think you would be a public official for the purposes of this crime. I think that misconduct in public office means you've been appointed to a public office and I think the courts would say a public official does not include simply being a member of the royal family because it's very very difficult to identify what the role involves uh how would you judge abusing that position and just don't think it was intended to apply to that. intended to apply to somebody who holds a public office like UTK trade envoy which he was for 10 years as you've said. >> This episode is powered by Fuse Energy. >> Most of us are buying energy in the dark, not knowing what it costs. You wouldn't do that with your weekly food shop, but with energy, you're often charged first and only find out the number later. When you don't have that clarity, you usually end up paying more than you should, which is what Fuse Energy is working to change about how energy works. >> The average household switching to Fuse can save around £200 on their energy bills. >> Fuse handles the practical side. The app shows what you're spending daybyday and what that actually means for your bills. >> For listeners to the show, there's an added benefit. Use the code politics when you switch and you'll receive a free Trip Plus subscription. Switch to Fuse Energy and save around £200 on your energy bills. Use the code politics for a free trip plus subscription. fuseenergy.com/politics. And then the elements are of the crime are deliberately misperforming that office in some way. And a classic example is a police officer who uses his position as a police officer to access for example criminal records for his own personal use to give to his friends or to damage his enemies. Secondly, the abuse has got to be so significant that it reduces the standing of the person in public reputation. There's got to be no reasonable justification for it. And it's got to be done deliberately. I.e., you've got to know when you're doing it that you shouldn't be doing it. It's got to be so awful as to make everybody in the public, not everybody, but reasonable people think this really is an abuse of your office and you've got to have no reasonable excuse for it. >> That sounds to me like quite a high bar. >> It is quite a high bar. And the sorts of examples that are given are the police officer who accesses criminal records. There's a case of a police officer investigating a crime who sexually hits upon a vulnerable witness abusing his position as a police officer. Another example, not in the more recent memory but earlier, a MP who fiddled his expenses. That was said to be uh misconduct in public office. So the the the the elements here would be said to be and I'm not saying this is right or wrong. You've got this job as a UK trade envoy. Your job is to promote UK trade for the country. If and it's a very big if. If instead of that you used the job for your own interests flagrantly that would be misconduct in public office. And the other part that you mentioned there which I think makes this a difficult bar is when we talk about abusing the public's trust the issue of reputation particularly at the moment with the reputation of politics as it is the reputation of of public life that sounds to me quite a woolly thing and again quite a difficult bar to cross and this is unprecedented because so far as I can remember I have we ever had a royal arrested like this before? Well, in modern times, no royal has ever been arrested. The example that everybody's citing is Charles I. But what happened to Charles I was that he lost a civil war and the winners, the parliamentarians then took him prisoner like a prisoner of war and he remained a prisoner of war until he was then charged with high treason and executed. He was never arrested like this because they were investigating a criminal offense. He was just the loser, as it were, who then paid the price of being the loser. There's never ever ever been anything like this in modern times or indeed in preodern times when simply what happened to you if you're a royal if you ended up in the wrong end of it you ended up being killed or something terrible happened to you but you were being arrested in the context of a rather well-ordered criminal justice system >> and I mean I I just wonder whether what's happening here what one it's a combination of things it's the it's the unspeakable nature of Epstein's crimes s which we already knew about. It's the scale of his contacts and networks and operations and the cynicism of those who were involved in a lot of that. But it's also with the royal family I think is now allied to a sense that even they in terms of the public reputation, this is why I think that point about the trust is so important. Even they are very rarely given the benefit of the doubt. >> I think that's right. I also think the whole commentary and thought about Epstein involves the idea of an untouchable elite doing absolutely unspeakable things. This then gets allied to a huge amount of written material which then throws a light very very very unexpectedly on what they've been doing. If the outrage and it is genuine and legitimate outrage is the powerful abusing their position and being almost immune from being taken to account for that and this suddenly becomes visible which it has done. Don't the law enforcement authorities certainly in our country have no option but to act and rightly so. You've also had uh including I think this morning he did an interview on the BBC when you have the the prime minister saying that anybody who can give evidence in relation to this should do. When you have a former prime minister Gordon Brown producing evidence based upon his own analysis of both the files and his experience when he was prime minister. Then I guess in a way the the police are being given permission perhaps to go down roads that in the past they might have been very very wary of going down. >> Is it more than permission? Is the pressure not absolutely immense to do something? And one of the striking striking striking things about this though it may not be that striking is watching how cases are investigated at the moment. They normally take absolutely forever to get investigated. And if there is any degree of complexity, and there's very considerable complexity in this, you would, and this might be legitimate, expect the police to take months to reach a conclusion about what they're going to do. Partly because they want to be on sure ground and partly because they don't want to make a mistake in relation to it. the search warrant in relation to Peter Mandlesson's premises, the arrest and uh searches of Prince Andrews premises, they've all happened at incredible speed because I am assuming that the starting point for these or the point that has led to these investigations starting is the the most recent releases of the 3 million documents in the Epstein case, which is only a month or two away basically. So I think there's a sense that authorities have to act. So there is enormous pressure on the authorities to act and they have to be seen to be saying nobody's immune in relation to all of this. And of all the people in all the world who have previously been thought to be immune, it's uh the royal family. And so in a way Andrew Mountbatton Windsor is the clearest demonstration that nobody is above the law. >> Interesting. The king's statement. and the King statement. We assume that the king and Downing Street the nobody was tipped off in advance that this was happening. We don't know that, but I think we can assume that. >> I've been watching the television this morning, Buckingham Palace has said the king was not tipped off in advance. >> So they very quickly they hear the news the same pretty much as everybody else. Very quickly they put together a statement in his name. I have learned so he's very much leaning into owning it with the deepest concern the news about Andrew Mountbatten Windsor not my brother but Andrew Mount Bat Windsor and suspicion of misconduct in public office. What now follows is the full fair and proper process by which this issue is investigated in the appropriate manner by the appropriate authorities. In this as I have said before they have our full and wholehearted support and cooperation. Let me state clearly, the law must take its course. As this process continues, it wouldn't be right for me to comment further. Meanwhile, my family and I will continue in our duty and service to you all, Charles R. And of course, what that's about is actually at a time when something is happening that will inevitably have people saying this is so bad for the monarchy. This is so terrible for the monarchy. That is him leaning into the the the sense of the institution is above all this. You're a very effective PR kind of guy, Charlie. You've had lots of experience. Do you think that was an effective piece of communication by his match? Put aside the question of PR. I thought it was an incredibly impressive statement. I mean, it's a if you look at it, the wording is slightly stranged. I I just mean syntactically not in its content. But the content was saying an incredibly important thing which is my duty comes before my family. And it said incredibly clearly and said maybe within an hour of his brother walking into what will be absolute hell. his brother will be having mug shots taken, his DNA taken, but he may well be rightly and obviously we shouldn't forget at all about the victims. But the king is saying my family comes second to my job and my duty. And that last bit when he says we will continue in our duty and service to the nation is a very striking statement is it not of somebody saying my family had to be sacrificed and that's what he was saying wasn't it? >> Yeah that's what that's that's exactly what I read when when when I first heard it and I I agree with you. I think it was it was a very deliberate emphasis upon the institution being more powerful than anybody who's within it. But I do think as a piece of public relations, you say it's an impressive statement and I get that. But actually, I think what they have to do because I mean, maybe we should talk a little bit about whether we do think there's long-term impact upon the monarchy. In a way, they have to quarterize this. They have to see Andrew, that's why he's been expelled. That's why he's been lost his titles. That's why he's lost the name. But I think you could make the case that this has been coming for some time. Have they have they felt that maybe they are in a more more open to the sort of impunity that quite a lot of leading politicians around the world feel they can enjoy at the moment? Have the royals felt that maybe they're in that space? I don't know. >> The change for them must in part be the much greater visibility about things that Andrew did. It's not possible just to say no, no, no, we're not going to comment on any of this over a period of time. And I'm not saying that was their position, but all this information that's pouring out makes it incredibly difficult uh for them. I think this is immensely damaging for the royal family. I think that King Charles has behaved very well in relation to trying to deal with it. And I treat the statement he's made of completely genuine. But if your whole pitch is you're a royal family who gives an object lesson to the country, well, the fact that the police are now investigating Prince Andrew on abuse in public office indicates there's reasonable grounds to believe that he may have committed that crime. That is a terrible position. And if it's the family you're offering to the country, then the family looks like it may have a very big cheek in it in relation to the way that he has behaved. Now he may be innocent. He may be guilty. But this cloud now hangs over them in a way that in my lifetime no cloud possibly to compare with it hung over them. If you go back to when the queen was still alive and you had a period she called it the anniserous and you had a lot of things going wrong. You had pretty much all of the royal marriages of their children going through periods of difficulty. You had a sense of scandal surrounding them on all sorts of all sorts of fronts and they got through it. Do you think this is far far more serious and far worse? Is that just because of the time we're in? Or is it because this relates to some of these awful crimes that Epstein we know was guilty of which which Andrew has consistently denied, but where that has already reduced his reputation to frankly very very low. I mean the allegations against Andrew which may or may not be true are so much worse than anything that occurred during the annisibilis and even there was a period of time when the prince of Wales Prince Dina was was being critical highly critical of the monarchy that was in the context of a family that was dysfunctional but this is so much more serious and also carries with it this idea of an elite behaving in a way that was effectively abusing their position as being members of the royal family. That's that's that's the real hit. It seems to me I mean what he was do what he was said to be doing and I'm talking here about the abuse in public office which is now being investigated was abusing his own position. It is alleged. I think it's so much more damaging than anything that's gone before. And the way it's now being reported gives the sort of corroboration to that. I mean, we're doing we're having this conversation on the day he was arrested. There is literally no other news now apart from that. >> Yeah. >> And I can't remember that happening on any of the days of the anniser. Maybe the divorce, >> maybe the winds of fire, Charles and Donna divorce, but yeah. No, and this involves crime. That's the other Yeah. >> That this this involves allegations that are criminal. One thing that Rory and I have talked a bit about on the podcast, Charlie, I've been interested in your view, is the fact that the many, many more people from the United States of America who are deeply inshed in Epstein's world that they don't seem, with one or two exceptions, they don't seem to be getting anything like the public scrutiny or approprium that three Brits have done. Prince Andrew as was Peter Mandlesson and Gileain Maxwell. Do you think that's to do with do we have higher standards? Do we have a more inquisitive media or is do we have a more independent policing and legal system? No. I mean there are some people who are getting a hard time in America. For example, Larry Summers who used to be the president of Harvard and the secretary of the treasury under Clinton. He's getting a pretty hard time. I mean, I find extraordinary that there seems very little kickback on Trump in relation to it, who's been most named, it is said in the um Epstein file. Some people say it's up to a million times, but I don't know if that's just repeats or press cutings. Is it because Trump has completely cauterized himself from sexual scandal in a whole variety of ways? So you you can't kill him in relation to that politically and once he's immune then people aren't very interested. Whereas here the royal family are so much more an object of interest. I mean it's very odd that it's Peter Mandlesson and Andrew Manbatton Windsor who are going to as far as one can see maybe pay the biggest price of the Epstein scandal more than anybody in America at all. Is it because we because we've got a law enforcement um uh arrangement that will actually follow it up? >> Well, the the the the truth is that the Department of Justice under Pam Bondi, we saw that in inquiry. She was she was she was it was horrific to watch to think she was like she was like your equivalent when you were kind of the the top top dog lawyer in the UK. That was her and she was basically just giving a sort of political political performance. But I think the the thing about um about Trump, you had a guy, a congressman, yesterday basically saying, \"When are the press going to start looking at all this stuff in the Epstein files about Trump where he says there are allegations of raping and killing children?\" >> Now, I just don't I I'm with you. I don't understand. I I mentioned the word impunity. Has Trump so misinformed and so manipulated the public space that the thing he said I could walk down Fifth Avenue and shoot somebody and I'd get away with it with my base. That that is the world that we're kind of now in. >> Well, it looks like that. And I mean even though he is a liar in so many respects, his authenticity gives him impunity, does it not? He is authentically not trying to present himself in the way that so many politicians do. There is no hypocrisy, although probably lots lots of hypocrisies about Trump, but he is just as awful as he appears. You remember the Billy Bush interview shortly before the 2016 election when he described because he was a celebrity, he could put his hand down women's skirts and they didn't mind because he was a celebrity celebrity and wasn't that marvelous, which would have destroyed any other uh politician but simply made people think, oh, that's just as it were boy banter and therefore he's genuine and nobody else is. But do you have to be awful to be authentic? >> Well, that is a it's a horrible thought if you do. No, I mean I don't think you do, but I think there is a I think there is a double standard and I think that the I think that the the weaponization of justice, of course, the Republicans say that the Democrats did it to them and it's a sort of it's a it's a tit for tat. So, I guess perhaps we should feel that there's something better in our system. Anyway, listen, Charlie, we've um we we've added to the many millions and millions of words that will be said today about Andrew Mban Windsor. I'd love to get Rory's view as he skis down another ski slope today. I think he's trying to qualify for the next Winter Olympics, but um because of course he's he's a huge huge monarchist. He's a massive admirer of the king and will be I suspect feeling his pain right now. I mean there's a one aspect of this is this will run literally for years now. So every 3 months or four months there'll be a further development. the bail of Andrew Mount Beth and Windsor will be extended. Then there'll be a question of whether he's going to be charged or not. And is it I don't know if you remember the Paul Burl trial which on a scale of 1 to 10 is about half and this is about 12,000. The tri you remember the Jeremy Thorp trial. I mean this trial will be like the trial of the century >> if there is one Charlie if there is one. Well, if there is one, yeah, and we have to wait and see whether but if there is a trial, it will be a a trial that will have to be presided over by the lady chief justice. It will take place in the old Bailey. It will be a trial the life of which has never been seen in the history of trials basically. And this is two, three years down the track. And it's that sort of corrosion that is going to have a major effect. And Rory's views and what effect he thinks that's going to have on the monarchy is is is is quite difficult because it's the family and as it were you can't change the monarchy because the whole point about the monarchy is it's you've got to keep on doing it generation to generation. It's not like you can change the prime minister. Uh it's a it's we're all feeling a sense how well the king has done at the moment, but this long-term corrosion is harder to assess. >> Yeah. Although the next king, William, he's got a very good shot in the can already that was it a funeral that they were at where Andrew was trying to talk to him as they left the church and it was perfectly clear that William did not want him anywhere near him. So, I think that was >> pretty effective body language communication as well. Well, Charlie, thank you for your time. >> Thank you for having me. >> Lovely to talk to you. >> And uh I hope to see you soon. >> See you very soon. Take care. >> Okay. Bye-bye."
    },
    {
      "id": "9xl-zAwFtAg",
      "title": "How Nigel Farage Gets Away With It",
      "channel": "The Rest Is Politics",
      "channel_id": "UCsufaClk5if2RGqABb-09Uw",
      "published_at": "2026-02-19T18:00:06+00:00",
      "transcript": "How is Farage getting away with so many lies? >> Breaches of electoral law, Russian interference, foreign funding from billionaires and crypto, deeply worrying and pretty authoritarian orban MAGA style anti-women's rights and abortion gender, violent rhetoric, close ties to convicted criminals. He just gets away with again and again and again and again. >> People assume that Farage is a bit of a bullshitting rogue and therefore when all this stuff happens, it's sort of rolled into the general picture. Trump created a media landscape that gives up on proper scrutiny and I think we're seeing the same develop with Farage. This is a network and Farage is fundamental to that network. I just wish our bloody media would grow up a bit and start to join a few dots. >> Welcome to the rest of this politics question time with me Rory Stewart >> and me Alistister Campbell and Rory. We're going to talk about Nigel Farage and reform. We're going to talk about elections in Thailand as we promised last week but also in Bangladesh. fascinating election just taking place in Bangladesh. We're going to talk a little bit about Munich and then I know you want to having been sort of pretty vile about K star on his Munich speech. You want to be nice about him in relation to something else. We've got lots to get through, but where do you want to start? >> I'm going to start with a question from Allison Cohen. How is Farage getting away with so many lies? >> Well, it's not just lies. I think Farage gets away with with murder. And I think the the rise of Reform UK or what Chris Mason of the BBC likes to call the rise and rise of Reform UK has actually happened despite and in part because most of the media largely played out not just the lies but the controversies and the scandals. We talking about breaches of electoral law, Russian interference, his role in Brexit, foreign funding from billionaires and crypto. Deeply worrying. And a shout out to Natasha Devon on LBC at the weekend. Pretty authoritarian orban magga style anti-women's rights and abortion agenda violent rhetoric close ties to convicted criminals. We've seen this with Trump. Trump created a media landscape that gives up frankly is slightly giving up on proper scrutiny and I think we're seeing the same develop with Farage. Now first of all let me say not all I'm not taring every with the same brush. Pipper Krera of the Guardian took me to task recently for saying the media are too soft on Farage when papers like the Guardian from time to time really to go for them. But there are so many stories Roy that if the if if these were about Labour politicians or even Tory politicians it's not just a right left thing they would never be out of the news. And there's another common link which is hugely underplayed and that's Epstein and Steve Bannon both jailbirds like George Kotrrell the man Farage calls you know like a son and whose book on money laundering he and other key reform figures attended but let me just let me just go through a few 17 breaches of the parliamentary rules by far 17. I don't know how many times you broke the rules I suspect it was zero. Nathan Gil. I've been banging on about this for yonss and yonss and yonss. There was media interest in Nathan Gil for one day only. The day he went to jail for taking bribes from Russia. The whole crypto world, I think we just don't understand just how deep they are into this. Farage's use of a private company to pay corporation tax on all his outside earnings rather than income tax which means it's 25% not 40. And surprise surprise says he won't publish his tax returns if he becomes prime minister. And you know then there's all these things that just get forgotten in the midst of times. Farage claimed he never met the Russian ambassador but he did. He claimed that he bought a house in Clton, but he hadn't. Aaron Banks, his right-hand man, the bad boy of Brexit, said he'd had one boozy lunch with Russian officials. It then it was two or three, then it was four. It turns out it's almost a dozen. Richard Ty, you know, the working from, we'll come on to working from home later, but Richard Ty, who works from home in Dubai with his lovely wife, Isabel Oakshot, you know, he had relations with this Russian guy and didn't declare them until the journalists got hold of it. I mean, maybe he was going to register it, but the truth is that he didn't register it until Hope Not Hate, the campaign group, got hold of it and challenged him over it. And then just this week, before you kind of come back at me on some of this, just this week, the this pattern of admission and dismissal. So you kind of say, \"No, no, we didn't do that.\" Oh, yeah. Well, maybe we did, but does it really matter? And that's helped get rid of an apparent electoral law breach in the bi-election taking place in Manchester. And just this week, another one repeatedly Farage, this is his kind of line of the moment, going on radio, going on television, going on social media, saying that 1 million people in Britain cannot speak English. Okay? When he knows that is untrue because he's actually written the true figure in an article in the Daily Telegraph earlier, it's actually 161,000. So whether you go, you know, his warm words for Putin, his apologies for Russian aggression, if you poke the Russian bear with a stick, he'll respond, his endorsement of Andrew Tate, his meeting with Assange, his fundraising to support, get this, a Russianbacked campaign to split California. Now, Farage didn't know at the time necessarily that this was kind of Russian involvement, but it is nonetheless a bit weird. The thing about the press and the media, part of the strategy, this is Natasha Dub made this point in LBC, part of Faraj's strategy at the moment is to keep calling press conferences. So the press trot in and either he gets on the news saying how bad Labor are being that day or he throws out some new little sort of fireworks. So the other day it was let's stop all this working from home nonsense brackets. One of his big backers is a big office space guy. Probably totally unrelated. I'm just asking the question, as Nigel might say. This episode is powered by Fuse Energy. >> Most of us are buying energy in the dark, not knowing what it costs. You wouldn't do that with your weekly food shop. But with energy, you're often charged first and only find out the number later. >> When you don't have that clarity, you usually end up paying more than you should, which is what Fuse Energy is working to change about how energy works. >> The average household switching to Fuse can save around £200 on their energy bills. Fuse handles the practical side. The app shows what you're spending day by day and what that actually means for your bills. >> For listeners to the show, there's an added benefit. Use the code politics when you switch and you'll receive a free trip plus subscription. >> Switch to Fuse Energy and save around £200 on your energy bills. Use the code politics for a free trip plus subscription. fuse energergy.com/politics. But here's a thing about working from home. He he his home work-wise is Clactton. He's never there. His wife work from home when he was a when he was an MEP. It's the hypocrisy that he just gets away with again and again and again and again. And if you think about when I was a journalist, the local government, let's take local government. We now got these reform councils, lots of defections, lots of cronyism, lots of stuff, lots of absolute incompetent people doing incompetent things. It's barely figures on the national news when labor had. Do you remember the looney left? >> I remember the Looney. >> You remember the Looney, wasn't it? But it was like, you know, all the CND stuff and all the kind of, you know, so the looney left became a national media story. Why is reform in local government not getting any national coverage given we have the rise and rise of reform and they're basically saying this guy is nailed on as prime minister? So is it a fair point, Rory, that this lot get away with murder compared with the other people who want to be prime ministers such as Karma? >> Yeah, I mean I think it's definitely true that somehow you get a sense that different standards are applied and it it is worrying because it's a little bit like Trump. I mean I think part of the reason he gets away with it is that it's sort of priced in. people assume that voters assume that Farage is a bit of a bullshitting rogue and therefore when all this stuff happens it's sort of rolled into the general picture and part of the problem for Star I guess is that Starmmer came in on a big message of a sort of moral campaign challenging the conservatives bringing seriousness to government bringing rectitude and therefore it's a more appealing story to a journalist to point to sort of hypocrisy and say you know this guy sets himself up succain and >> here's all this stuff going wrong. I think the second thing is that to be fair for a second uh and to try to play the other side. Um what you're talking about is a very worrying pattern and you know we can develop that a bit. I mean you didn't talk that much about the funding but I I think one of the things that worries me most is our rules in Britain are so lax in terms of who can give money. >> You don't actually have to be a British citizen to give money. You just have to be on the electoral register or have to have a UK company. So that theoretically, you know, Elon Musk could put people have been exploring this. How could he possibly put 67 million pounds into a campaign through some UK company? >> Although he's now backing Rert Low, apparently Farage is not quite he'll end up backing Tommy Robinson, I suspect. And Tommy Robinson, of course, is backing Matt Goodwin in the Manchester bi-election. So yeah, but no, but the funding, you're right about the funding. >> Thank goodness still we are not in a situation of Farage actually breaking the law, right? These things are him conflicts of interest, breaking of parliamentary regulations, sailing very close to the wind, but so far he's not been convicted of a crime. And uh the parliamentary commissioner has said that he thinks these things are inadvertent. But you're completely right. The general pattern of populism, polarization, post-truth, strange links. I mean, we haven't talked much about these extraordinary revelations of the fact that when I was in Theresa May's government, it turns out that Steve Bannon, right, Trump's big kind of right-hand idologue, had relocated to Britain and was there cheerfully sending emails saying, \"I'm meeting Boris Johnson. I'm meeting Nigel Farage, and we're just about to bring down Theresa May. I've just written a speech for Boris Johnson for his resignation.\" It's all the stuff. when Boris Johnson resigns as foreign secretary and they're trying to trigger May to go. I had no idea. I wonder whether Theresa May was aware >> I very much doubt it >> that the things and then where was Dominick Cummings and all this because of course Dominic Cummings is a figure very much part of the same ecosystem the same polarizing Brexit tech bro ecosystem which Steve Balon's adjacent to and of course he becomes Boris Johnson's chief of staff. So what's what's all that story? What's that moment going on? Cuz I came quite innocently into that leadership race against Boris Johnson with Theresa Mayfeld without any idea that somewhere in the background were these sort of extraordinary figures like Bannon floating around and of course in retrospect presumably Dominick Cummings pushing Boris Johnson's campaign from the beginning. >> And the thing about Bannon of course if you remember when Brexit happened and in a in a a rare moment of cander Nigel Farage was being filmed and turned to the camera and said here's to you Steve Bannon. You did this. So that was that's been going on for a long time. And of course Steve Bannon like a lot of these MAGA people there is an element to him of being a complete bullshitter and therefore he wants you to think that I can bring down Theresa May I can get Boris Johnson into power what have you. But the truth is Steve Steve Bannon is fundamental central to this international network of Orban. You know we were in Munich the other day Rubio makes his speech. All the European diplomats go wasn't that wonderful. He didn't tell us we were terrible. What's the first thing he does? He gets on a plane. He goes to Slovakia and then and then Hungary to see Orban to say Trump wants Orban to win the Hungarian election. This is a network and Farage is fundamental to that network. And what he does, what he manages because of the sort of cheeky chappie, having a having a pint, sort of, you know, just being a kind of co-playing man of the people is he manages to to sort of dismiss this stuff like Trump does. They all learn from each other. You and I were in Davos. Nigel Farage was in Davos and Nigel Farage was doing lots of interviews saying, \"Oh, back Donald Trump on this and K Star was terrible, what have you.\" None of them, so far as I know, have actually done it. None of the broadcasters who happily had him on air have actually asked the questions and found the answers. Well, who paid for you to be there? >> I think if you looked at his past carefully, he wasn't there under his own name. He was actually there as a sort of plus one as a sort of assistant to a British Iranian businessman. >> Yeah. Yeah. And then you have all this stuff about he's got these links to the the crypto world and then again back into Epstein. Epstein Peter Teal celebrating Brexit. This is just the beginning. Epstein and Bannon talking about Bannon boasting about having all these European parties that are going to do well in the European elections. we can stop any of the regulation for crypto. So I just wish our bloody media would grow up a bit and start to join a few dots instead of just think that Farage is a useful guy to get on day after day after day and say the government is terrible. He did it with the tries and now he does it with Labor and that's how they use him. >> We also need very very quickly to get clear campaign finance reform >> which the government are talking about, aren't they? >> They're talking about but it's not coming through. I mean if we genuinely are facing a risk of Nigel Farage taking over, we need to build the institutions now to protect democracy properly. Yeah. >> And that means we need to stop non-British nationals being able to pour lots of money in. I I personally think actually we should stop private individuals and trade unions being able to pour millions of dollars in. We should be following the South Australia model. We should put very clear rules about crypto. Crypto is a very strange thing. Very difficult to trace. What are the origins of things? We should have much clearer views on declarations. I mean, what we're seeing again and again, part of this stuff we're seeing with Farage, you know, who's paying for these trips, are they being declared? We saw this in spades with Mandlesson, you know, people not declaring getting on private planes and then completely changing the way in which ministers are trained on security. Mhm. >> So I I was very surprised when I became a minister and when I ended up eventually on the National Security Council that I didn't get anything like the briefing that I'd got when I was a diplomat. So when I, you know, as a 21-year-old joined the government, there were very very clear training around the official secrets act, the sensitivity of information, how to protect sources, how to make sure there weren't conflicts of interest. Certainly in my day, ministers simply didn't get the same seriousness and depth of people reinforcing that they're dealing with the most sensitive information in the world that could put agents lives at risk that could allow wealthy bankers to make millions of pounds. So absolutely with Farage, but I'd also like someone to come up with a solution. I mean, as well as us identifying a problem, how do we put the principles and policies in place now to make sure that our politics is cleaner in the future than it is now? >> The fact that it needs to be cleaner, there's no doubt about that. And you know, Gordon Brown on the back of the Epstein stuff and Peter Mandlesson came out and had all sorts of proposals. And as I said at the time, I I worried that that was sort of tiring them all with the same brush like you know, Pipper I think thinks I do sometimes with the with the media. But let me just give you another example of the sort of the double standard here. Let's imagine that I or Peter Mandlesson or somebody who was associated with new labor wrote a book called How to Launder Money. And let's imagine and let's imagine that Tony Blair, Gordon Brown, Kier Stalmer, uh David Lavi, Iet Cooper all turn up at the launch of our book, How to Launder Money. So George Kosro, who is this guy that Idel Farage says is like a son to him, who's been to jail for laundering criminal proceeds, who spent several months in prison. He writes a book, How to Launder Money. And who turns up at the launch? Nigel Farage, Richard Ty, Nick Candy, the billionaire property guy with the biggest house in bloody Regents Park. Leila Cunningham, the mayor for the candidate for London. James or the intellectual guru of reform, etc., etc., etc. So, this is this is part of the Trumpian thing. Instead of sort of getting on the defensive about being a money launderer, you write a book about it and you call it how to launder money. And then when people like you and me say this is really terrible, people like FR go, oh, it's just a bit of fun. You lot you're too serious, you lefty bed wetters, you know, blahy blahy blahy blahy blah. Now, what posh George, as he's known as will say is that this is a book designed to help policy makers and politicians and the public understand money laundering. But you can't deny it's quite a provocative title for somebody who's been banged up in the past for such things, how to launder money. So, Pos George, good luck with your book. I suspect it won't get right to the top of the bestseller list, but you certainly had a good turnout for your launch. Right, before I stop my rant, Rory, we go to the next question. a book on moneyaundering which I've been reading. Oliver Bullo, we've talked about him before. This guy writes these amazing books about financial crime and he's got a book out at the moment. I think it's out this week and it's about money laundering and people should take it seriously and it's a proper piece of journalism. So there are good journalists out there. So Allison, thank you for your question. You can see it had quite a triggering effect. But I'm very very grateful and I hope that um some of our frank fearless free journos are listening. And by the way, I suspect this rant may be the end of our courting of Nigel Farage. I sent him a message this week and I said, \"Look, am I wasting my time trying to get you come to onto onto the podcast? Are you only going to do nice soft tame interviews? We'd be nice. We'd be respectful. We'd be polite, but we do need to ask you some difficult questions.\" Anyway, reply came then none. Rant over. >> Rant over. Well, do we have any other questions? >> Last week, we promised to return to the issue of the Thailand election. So, let me try and wrap a couple of questions together. Lucy is a trip plus member from Yorkshire. Have voters in Thailand given up on the idea that Democrats can deliver change from the status quo? And then Tim in Brussels. Does the election result in Bangladesh mark a genuine democratic reset? Or does the exclusion of the Awami League, that's the party of Shik Hassina, currently in exile in India and the rise of dynastic and Islamist forces risk replacing one form of dominance with another. >> Both cases what you've got is a situation in which from 2012 2014 both Thailand and Bangladesh seem to be moving away from democracy. So Bangladesh for example having been a sort of actually a bit of a poster child for democracy or it felt like it in the '9s early 2000s because there have been elections and the parties have been swapping back and forwards effectively Shik Hassina who was the the ruler took control in 2012 and took over the courts took over the police intimidated her opponents and set up an authoritarian regime and in Thailand in 2014 there was a military coup and basically the military and people around the royal family the king's very strong in Thailand ran a pretty authoritarian state. And then suddenly, rather oddly, given the the the general story that we see in our worlds, there was a a a bit of hope. So in 2023 in Thailand, this charismatic young leader of a progressive party did fantastically well in the polls. And in 2024, in August in Bangladesh, there was an uprising and Shik Hassina was finally toppled. and Muhammad Ununus, a Nobel Peace Prizewinning guy, the guy that set out micro credit, takes over. So, in both stories, the stories seem to be actually rather oddly given we're in the age of Trump, it was moving in a more progressive democratic direction. And now the elections have happened and they are sadly a crushing disappointment because in Thailand what's happened is the progressives have been beaten and there's been an incredible turnaround in the fortunes of this more conservative promilitary party that's gone from number three in parliament. They had about 70 seats to firing themselves up to top place at about 190. Meanwhile in Bangladesh uh yes Shay Casino's gone but politics have just lurched back to the other great big machine party of Bangladeshi politics the BMP and of course the person who's now won with the BMP is Tarik Rahman who is the son of the former president and military ruler General Zarman who was assassinated in 1981 as opposed to Shik Casino who was the daughter of a leader killed in an assassination in the 1970s has now taken over Again, >> hold on. He's not just the son of a former president. He's also the son on the maternal side of a former prime minister, uh, Zia Kaleda, who I met when with Tony Blair back in early 2000s, I think it was. No, you're right. And of course, on the one hand, Shakerina gone. They now have a warrant. They want they're in these discussions with India about whether they can get her back because they want to put her to death, frankly. And of course her party was not allowed to stand. So the BNP and of course because of the the UK context the BNP it sounds a bit weird say the BNP. This is the Bangladesh National Party not the British National Party. So they're a nationalist party and they've just they've got twothirds of the entire parliament. So this is a huge huge win. Whereas in Thailand, although it was a big win and a very unexpected win against the polls, set against the polls in advance, they are still going to have to do a pretty much a coalition with the party that came third. The progressives came second having been way ahead in the polls. And one thing that was really interesting there was the rural urban divide. And we see this in a lot of countries, but this is just massive. So in Bangkok, the, you know, the capital, the most urbanized area, um the progressives won every single seat, every single one. And yet get out a little bit and they see that the and and of course it's a mixed system. It's a hybrid system, part first the past the pose, part proportional. But it was a very very big shock. And what it means is that the traditional powers of monarchy, military, and the appeal to national unity, particularly at a time when they've been having this conflict with Cambodia, um it seems to have won the day. However, a lot of allegations of vote rigging, vote buying, and you know, cameras turning off during the voting. And so, you know, it it's left a bit of a nasty taste, but you know, it's a big win. It's um also part of a really interesting bigger story about what's happening in South Asia, Southeast Asia with democracies and economies. The normal story that we would have wanted to tell ourselves after the fall of the Berlin Wall is that the whole world was becoming more and more democratic and more and more liberal in terms of its economics. We I guess because we're Europeans, we often have the model in our head of what happened in Eastern Europe, you know, Lithuania, Romania, and these countries on this amazing journey. The story in Southeast Asia and South Asia has been more complicated. There's been incredible economic performance for many of these countries, particularly in the '90s, early 2000s where Bangladesh, you know, famously the basket case of international development shot on its path to become a middle-income country. Thailand actually diversified away from tourism, did amazing stuff in light manufacturing, beginning to grow very fast. But both those economies have basically run into trouble. They've run into trouble partly with tariffs with the United States, partly simply endemic corruption, kleptocracy, poor institutions are really choking growth. Meanwhile, autocratic states like Vietnam, which is basically in many ways went through a uh a smaller version of China, in other words, Communist Party remains in place. Big modernization drive from 1986 shot ahead and its economy continuing to grow probably 5 6% this year while Thailand's probably only grown grow 1 and a half%. >> And also Indonesia becoming a giant in its own way. >> Indonesia becoming a giant $1.4 4 trillion dollar economy now in Indonesia. I guess if we step back from South Asia, Southeast Asia and this is probably an area of the world we don't talk about enough because this you know when we talk about middle paths how do we balance the United States, China, Russia a lot of the answer is going to be in these enormous economies South Asia, India, Bangladesh, Pakistan but also these enormous economies of Southeast Asia and East Asia. The question of whether Britain, Europe can ally with them, build economies around them, share values with them is made very very complicated by the fact that these countries are not on easy paths towards liberal democracy. And of course, as you've just pointed out with Nigel Farage and with Hungary and Europe, there's some pretty serious problems now happening back at home, too. The other interesting thing about Bangladesh, they also had a referendum on the same day with a reasonably high turnout. And this was to make major constitutional reform, the sort of stuff that you and I be saying, let's have some of this for the UK. So they they brought in, I think it's 80 changes to the constitution and the most important, I guess, two-term limit for prime ministers, uh, more powerful judges, directly elected upper house. So this is you know there is at least kind of democratic change and renewal being being attempted there. But I think the thing with India is really interesting and and Pakistan as well and how these relations develop because of course one of the reasons why Shake Cassina was able to go to India is because relations with India under her had been pretty strong since her departure they've been they've been very substantially weakened and become very very hostile. The relations are so bad that in the T20 World Cup currently going on, Bangladesh refused to play unless their games were moved out of India. So that is why Scotland are out of the World Cup because Bangladesh Bangladesh pulled out. So they've got this real tensions between them. And of course now you have Modi. He gave a a message of congratulation to Terry Graman, the new guy who actually I I've met in London I think in the past because he's he's lived in London for the last in exile for the last 17 years or so. So these tensions are still there and Modi uh is going to have to be pretty careful about how he handles that and likewise relations with Pakistan and Bangladesh you know tensions there as well. So we should come back to this once the new guy has settled in. As you say, to some extent it's a story of two great donastic powers that have sort of, you know, moved in and out and in and out of jail and in and out of power and and what have you. But we'll see whether this constitutional change ever comes. >> So Alexandra in Hertfordshire, who was the most impressive leader at the Munich Security Conference and what else happened on the sidelines? And Ian, this is a question I'm fascinated by, but maybe we'll have to do this in more detail another time. Do you think JD Vance is being sidelined by Trump in favor of Rubio? But anyway, give us a sense cuz I left the Munich Security Conference before you. What did you continue to see? Am I right that you managed to have a bit of time with Zalinski and things? Tell us a little bit about what you saw. Well, I saw lots of things and the the thing that I was most impressed by, impressed as in struck, moved, was actually a panel on Arctic security, which was attended by the Prime Minister of Denmark, Meta Frederickson, who we've been to before, Prime Minister of Greenland, Yens Frederick Nielsen, a Republican senator from Alaska, Lisa Makovski, foreign minister of Canada, Anita Anand, had a really nice chat with her about how much he loves Mark Carney, and also the German foreign minister Boris Bistorius. And what was fascinating about it was it was do you remember there was the big room where the big stuff was going on, Rubio etc. And then you had these smaller rooms and this one was in one of the smaller rooms probably held about two 300 people and there were hundreds of people trying to get in and I spoke to this Norwegian guy who said you know what nor the Arctic security panel we can't fill the first row and somebody else said we should give Trump the Charlotte aid prize for uniting Europe the way that he's done but what was really fascinating was to see Frederickson and Neielson the Greenland prime minister They do not think this is over remotely. They are still very very concerned about what's going on. It was also I should give a plug to our miniseries on the Arctic because several of the people there including Alex understood when we interviewed him the president of Finland had listened to the first part of our the miniseries we did with Ken Rosen on the Arctic. So this has become like one of the biggest issues in the world and it's because Trump has put it there. I thought the Greenland prime minister, I mean, imagine he's a young guy, he's in his 30s, population of 57,000, and he's suddenly thrust into this geopolitical nightmare. He looked very stressed. I had a chat with him afterwards, and he actually was pretty calm and very impressive, but oh my god, you could feel just you could feel the weight on top of him. You and I, I think, were very much of the view that um the people standing up to applaud Marco Rubio's speech weren't listening very hard. They were being influenced by the flattery and the tone. >> Yeah. >> And they weren't picking up actually on the content of it. And Rubio then went on after Munich Security Counc What was your reflection? Because basically there was a disagreement. We took the view that actually you should be worried by Rubio's speech. A lot of other people were going around being relieved and applauding. over to you. >> Well, most notably Wolf Gang Ishinger, who's the German diplomat who's the chair of the whole event, and he he did a Q&A with Rubio after Rubio's speech, and he said, \"I hope you could feel the sigh of relief in the hall at your message of unity and reassurance.\" I mean, I had another German diplomat, perhaps le a little more battleh hardened and less kind of lovey lovey with the Americans than Ishinga. She said that a friend of hers, a very close friend of hers, had over years been been the victim of domestic violence. And she felt that Rubio's speech was like coercive control. You know, I really love you. I really really love you. But all these bad things that I'm doing to you that you don't like, they really are for your own good. And that was the sort of the the tone of his message was, you know, we're children of Europe. We'll never forget Europe. We love Shakespeare. We love the Beatles. We love Mozart. All that stuff. But the message to my mind was not a bit different to JD Vance a year ago. And I was appalled, frankly, that the Europeans, so many of them fell for it so much. And I think the penny dropped later, but the next 24 hours, most people I spoke to thought, \"Yeah, it wasn't that great, was it?\" And then, of course, to see him go off to Slovakia to see Orban's mate, then to go and see Orban himself and intervene directly in the Hungarian election, basically by saying, \"Trump loves you. If anything ever happens to Hungary with you in charge, America will always be there to help.\" It was a total direct interference in a European election. So I think you and I both got the right sense of what that speech was about. The other thing I saw after you left Rory, I went to see Elridge Colby who's the guy who is the kind of under secretary of defense very kind of MAGA. He was asked direct question. If Russia sought to annex the Russianspeaking part of Estonia, would that be seen as an act which required an article 5 NATO response? And he gave a long lecture about NATO 1.0, NATO 2.0, NATO 3.0. You guys, you've got this theological framing around article 5. It went on and on and on and on and then at the end the the questioner said I just can I just remind you it really was a very simple yes no answer. >> It's terrifying us. I mean ju just to just to sort of reinforce to people what this means. So um NATO article 5 is the core of all of NATO. An attack on one is an attack on all. And the answer to the question what happens if Russia invades Estonia a NATO member is very simple. There is a complete response by the United States and everybody immediately and the fact that the US Deputy Secretary of War Elbridge KBY is incapable of saying clearly, \"We of course would respond completely and dramatically to any invasion of Estonia.\" your point about that German diplomat saying that the Trump administration is doing a form of gaslighting where they keep saying, you know, this is all for your own good. That Colby thing reveals so much about what's going on. That the story that Colbe's been selling the world is yes, you know, it's very reasonable. Europe hasn't spent enough on defense. Uh we need to concentrate more on China. Europe needs to step up and do a bit more and stand a bit more on its two feet. He said it so effectively that you often have heard until Greenland European politicians just paring that, >> you know, beating themselves up. Ah, it's true. We haven't spent enough on defense, etc., etc., etc. But the truth of the matter is that the biggest incentive to Russia intervening in Europe is not how much Europe does or doesn't spend on defense. It's whether or not they believe that the United States would respond immediately to any incursion. >> Yeah. And for the US to keep the security of Europe isn't actually in the end about how many troops America keeps on the ground. It is about the crystalclear reiteration that an attack on one is an attack on the all with the threat of the US nuclear arsenal behind. If America remained consistent on its statements, Europe will be in a much safer place. The other um intervention I saw that was worth looking the French European Europe minister Benjamin Hadad, he did a very interesting thing. He said, \"Look, this is all a bit pathetic that we listen to these American politicians and we're kind of looking for little words of love that tell us, yeah, yeah, we still love you.\" Um, and of course it struck me at the end of Rubio's speech. it was Valentine's Day and I wonder whether that's why he did all that kind of you know loveydvey stuff but the policy has not changed and the point about Estonia Rory that is the thesis of that book that I mentioned my book of the year last year if Russia wins it starts by Russia taking over a bit of Estonia and America deciding it's not important enough >> without blowing my trumpet anyway because I I wasn't alone in this but when I was chair of the House of Commons defense select committee in 2014 so 12 years ago. >> Yeah. >> We used that Estonia case study as a way of trying to explain why we thought Europe was in real trouble. >> Yeah. >> And in 2014, we were saying, \"What happens if Russia just parks a few little green men a few hundred yards into Estonia and just sits there?\" >> Yeah. >> And will that trigger Article 5 and how will people respond? And so for more than 12 years, people have been trying to bring this to light. And for Elbridge KBY who presents himself as this great defense intellectual to be unable to answer the simplest question in geopolitics is is catastrophic. >> Yeah, I totally agree. At the event he was doing I was sitting behind a few a few Canadians and they were oh my god they were they were not buying it one bit at all. I'll tell you I was impressed by Ana Anan the Canadian foreign minister. I thought she was really impressive. She I hadn't realized till I spoke to her afterwards she has she was planning to retire from politics and Mark Carney persuaded her to come back but also the senator from Alaska really interesting and she's Republican uh but my god she could not have been more critical and condemnatory of what the way that Trump has handled Greenland and also making the point that Ken Rosen made in our miniseries Americans who aren't in Alaska they really don't understand what life is like in the Arctic. She was telling me, for example, that her phone, if if you're when it's cold, where she lives, when it's really cold, you have to go out with your with your put your mobile phone under your armpit and keep it warm in something else, otherwise the battery just dies in like an hour in the cold. And and so I I was fascinated by it's it's so interesting how a book can kind of change. Ken Rosen's book, Polar War, has completely changed the way that I think about the Arctic and think that we should think about the Arctic and its importance to all of this stuff that we talk about. Rory, before we go to the next question, I should tell you, you'll be thrilled to hear this. Fiona listened to our discussion about K Thma's speech and she said, \"I agree with Rory.\" That's the first thing. And I should tell you as well that I spoke to quite a lot of Carn's team, Macron's team, Matz's team. I think the balance was with you. I'd say >> in retrospect, why do you think you were seeing it as a slightly more positive speech? >> I still do because of what I sense is Kharma preparing the ground for a significant shift on Britain and Europe. Um and also preparing the country for the fact that we may actually have to get to a place a bit like the final when we talked to Alexander Stub in terms of a sort of more we're actually at war. Remember the Polish foreign minister said to us as far as we concerned we're already at war. Well, we have that that requires a change in mindset. And it's interesting the day after you and I both said that this is he's preparing the way to increase defense spending even further and even faster, Karma announced that that's exactly what they're planning to do. So that's the bit and where where I I agreed with you. I thought I didn't see the point of the direct rebuttal of Mark Carney. Is it a rupture? Is it a transition? Um but anyway, the Canadians in particular, shall I say, were particularly on your side of the argument, Rory. Right. Tom from London. With all the criticism facing K star at the moment, can you say something positive about him? Well, I've just done that. So, why can't you do the same, Rory? >> Well, here we are. So, I was at a reception for carers at Windsor Castle. This was last week right in the middle of Star basically fighting a felt in the newspapers for his complete political survival. And what struck me is that he came out to Windsor and he was there with um Steven Kinnock. He was there with Pat McFaden. So senior members of his government and I watched him spend an hour and a half working his way around speaking to unpaid carers that the people there were people who every one of them had a story of who they were caring for. There was no sort of showmanship about it. I watched him very carefully. He was thoughtful. He listened really hard. And these were extraordinary stories. I saw him talking to somebody who has been looking after her mother since I think she was 9 years old. Her mother's quadriplegic. He was talking to husbands uh looking after wives uh with severe dementia. He was talking to people working in hospices for children as well as for adults. It's quiet. It's unshowy. He could have just come in, just taken a photograph, been there for a few minutes and left again. I I guess Windsor is not a very convenient place for him to get to back and forth. And presumably there would have been people in number 10 saying, \"Come on. You know, the whole world's turning against you.\" And he was there doing the job and doing it really well. And you know, I should put on record there are 5 something million carers in the UK who are doing so much. It's the toughest job imaginable. can be very lonely, often stuck at home looking after somebody who with very severe needs. And of course, by doing it, they're saving uh the NHS and the whole system a huge amount of money. And they're they get very little caris allowance is very very low for doing that. But I I just thought it was a lovely indication of another side of KIA that people don't necessarily see and another side of these politicians in general that there was just kind of no swank there. There was no sort of showing off. It was just patiently working their way around that big room. >> Well, it's interesting you say that. I I actually got the next morning I got a message from Pat McFadden saying that he's seen you and he was saying nice things about you as well, Roy. It was obviously a very nice event all around. >> Well, yes. Sorry. Can I just quickly also pay tribute obviously to the king and queen who who brought it together and again you know they also I mean sorry I'd seen the king earlier in the morning he came to open this exhibition at the garrison chapel and there he too like his sama was spending I guess an hour and a half working his way slowly around the room listening to everybody talking to everybody when you know he's not had the best health recently he's had I can't imagine how many appointments that day he may have you know also like Kia wanted to get back to bed, have some rest. And you know, both of them together cheered me up. >> Well, of course, what's interesting about that to go back to the first part of our discussion about the way the media covers stuff is that of course for the for King Charles, it's kind of his job and actually when he went to Shashana's exhibition that was on the news as sort of wallpaper for something else going on probably to do with Prince Andrew, I don't rather than the thing. So that he does that all the time. Whereas let's imagine if the morning that Karma was doing that visit, Downing Street had briefed saying, \"Well, if you want to get to the prime minister today, this is his only public engagement. So we want you to cover carers and here's a briefing about a carer strategy and da da da.\" They wouldn't even have taken a note. He would probably only have got on the news assuming there was a was there a pool camera there? Were there media there? >> I didn't see any. There may have been, but I I there was some photographs, but I I didn't see much media at all. Yeah, >> but let's imagine how he might have got in the news is if one of the carers had said to him, you know, why did you appoint Peter Manson >> as ambassador to Washington? And then it would have been Karma's attempt to put the spotlight on carers was overshadowed or upturned by a da da da da. So he is in that mode at the moment. I'll do another one in the special educational needs which is a massive massive massive problem. Okay, Georgia Gold, who is the minister in charge of this, and she's, you know, she's got a young family, she's got she's got a white paper coming out. She has been to literally hundreds of meetings with parents and and so she was on the radio the other day being challenged, why haven't you already produced a strategy answer in part, I am absolutely determined to get this right, and I'm going to talk to people and talk to people and talk to people. So anyway, I think we should cut up your little p of praise to Kier and I'll I'll I'll send it to him. >> Well, I I want to finish with a a lovely question that we've received from uh Hannah Fry, but here's a question from Meta Hinton from Cambridge for you. What would a strong number 10 team look like? >> Um well, a strong number 10 team will be a strong number 10 team if there is a clear, compelling narrative coming out of number 10 all the time. That's the first thing that comes from the top that comes from the the prime minister being really really clear and then I think you would have I guess you you you know number 10 covers so much it covers everything that's happening in government. So the structure, the first thing that the focus has to be on the word team are the people who are in there doing the key jobs. They don't have to be best friends. They don't have to go to each other's weddings and funerals and holidays and all that, but what they have to have is a sense of what Jonathan Powell used to call complimentarity. They've got skills that that match each other. You definitely need whether you call it chief of staff or director of operations, call it what you want, you need somebody who is kind of making the trains run on time, controlling the traffic that's going into the prime minister should they see that, should they see that. I remember Barack Obama once said that, you know, most of the decisions that are sent to him don't even reach him because he had people that he trusted to say this is what he would say about that. This is what he would do about that. So that control goes in there. You then need somebody who's in charge of communications and strategy. And you need and and I think that the other thing that maybe is a bit confusing in this number 10 operation and maybe with all the change that's gone in since Morgan but Sweeney left and the cabinet secretary this can be addressed but you're never quite sure where the policy directions coming from. It's all felt a bit bits and pieces. And then the other thing a strong number 10 team looks like and has is really good relations with other departments. That's important as well. So, you did put me spot on there. I guess what all I've done is kind of describe our operation and that's not a really sensible thing to do because of course we're in a completely different age. But I think I think you do need that. You need >> I think the principles I guess >> I think the principles are the same. Yeah. Yeah. Principles. >> Right. Final question Rory has actually come from Hannah Fry who is a presenter of the rest is science and because we're so modern and technological here it is video and sound. Hello Alistister and Mori. Hannah Fry here from obviously your favorite of the rest is sister shows the rest is science. Um I have a question for you which is I guess about the overlap between science and uh politics. Science I mean we're continually warning about things that will happen on a 10year time scale, a 20 year, 50 year and so on. But politicians seem structurally incentivized to only really care about these fiveyear election cycles. So I am wondering and looking at the evidence of of things that have have gone in the last few years, is democratic politics just fundamentally incompatible with helping us to navigate through these long-term scientific crisis? I'm not just thinking about climate change here, but but pandemics, you know, the ills of the internet, algorithmic harm, artificial intelligence, quantum computing, and so on and so on. What do you think? I I just want to quickly say how much I'm enjoying the rest of the science. If if you're a little bit nerdy like me, it's the most wonderful thing. And Alistister, let let me try this one on you. So, you play cards, right? Um >> Okay. >> One of the things they did recently on the rest of the science is that they looked at how many combinations you can get from 52 cards. So, imagine ace of spades, king of spades, queen of spades, and then you just move up the three of hearts the top. That changes the combination of things. The number of combinations you can get from a pack of cards is 52 factorial. And they're trying to, you know, we keep talking about how you explain big numbers. Get this. Their explanation. Imagine that you set a timer for 52 factorial seconds going forward, right? >> Mhm. >> Take one step every billion years. Continue to walk till you've walked all the way around the world. When you've got back to where you started, take one drop out of the Pacific Ocean and then set off walking around the world again with one step every billion years. When you've emptied the Pacific Ocean, lay down a sheet of paper, then pile sheets of paper all the way up to the sun, and each piece of paper represents an emptying of the Pacific Ocean, and you've got 52 factorial. How about that? >> Wow. >> It's beyond unbelievable. I still actually am struggling to believe them, but I did try to run the numbers yesterday and I think they may be right. But what a lovely vision of how big numbers can get. >> I got 100% in my maths GCSE or Ole mock and I didn't understand that at all. >> Oh no, I didn't explain it very well. Anyway, the point is obviously if you're walking all the way around the world at a pace of one step every billion years and then emptying the Pacific Ocean one drop at a time, that's a lot of time. >> That is a lot of time. That's a lot of time >> and and you're not beginning to get to and then going all the way up to the sun with sheets of paper, you're not beginning to get to 52 factorial. So anyone who enjoys nerding out, that's a lovely example of the rest of science trying to deal with a pack of cards on the more serious issue. Yeah. >> No, I was going to say where where Hannah is absolutely right though, I mean science is about discovery and about testing and about challenging assessments that you and conventional wisdoms and and that's how you make change. There is something weird about politics where you set out a policy, you then devise the policy, you then implement the policy, then you realize it's not going as you planned, therefore you try to change it. That's actually quite a rational process. But in politics, it's seen as weakness and it it shouldn't be in a way, but no, it's a very very very good point. And of course, she's making that point at a time when science is under threat from politics, not least in relation to to climate. I mean, some of the stuff you heard from these MAGA people in in Munich about the climate stuff. I mean, and thank God for Gavin. Do you see Gavin Newsome, he by the way, I was really impressed by when we interviewed him. But I see he came from Munich, went to London and yesterday did a big signing ceremony with Ed Milliband, a kind of green climate thing between California and the UK. So, but no, Hannah Hannah's absolutely right. I I've I always struggled with science at school. I have to be honest. I was >> You didn't like it as much as your maths. You didn't you didn't enjoy it. >> No, I gone with math. I got on really well with maths, but biology, chemistry, physics, they were my three weakest subjects by some way. And my dad was a bit upset by that cuz cuz he was a vet and he was hoping that one of his four kids might become a vet, but none of us did. >> Would you have been a large animal vet or a small animal vet? >> Well, the only small animal I love is my own Sky. I would definitely have been a large animal vet. My dad was horses and horses and cows were his thing. Yeah. >> Delivered calves and things. >> Absolutely 100%. And also cured equin flu. I would have happily done that. >> Very good. Well, on that, Alistar, I think we we'll we'll finish that lovely vision of you uh delivering a calf. >> I have delivered a calf. I have done that. >> Have you? >> That's a it's a hell of a thing, isn't it? Hell of a thing. And the their legs are surprisingly unwieldy and long getting it out of the womb. That's >> No, cuz I worked a lot of my uh my youth on my uncle Jim's farm. And of course, the sort of you know, and and and sometimes it gets really complicated. You have to sort of tie ropes around their ankles. >> That's right. To pull them out, don't you? if it's a rear rear breach exit instead of coming up by the head. >> So, um yeah, and I've done all that. >> Go. Well, you're a great loss to veterary science, but thank you for joining us on the podcasting world. >> See you soon. Bye-bye. >> Bye."
    },
    {
      "id": "MzalF9cbyww",
      "title": "“Starmer is fluffing it up” | Rory and Alastair React to Munich Security Conference",
      "channel": "The Rest Is Politics",
      "channel_id": "UCsufaClk5if2RGqABb-09Uw",
      "published_at": "2026-02-15T18:30:06+00:00",
      "transcript": "I was watching Rubio and I was feeling it doesn't remove that much from the substance of what Vance was saying, but he was perhaps much much more diplomatic about how he put it. I see within this K Starmmer pointing Britain in a very European future direction. What actually Starmer is doing, if I'm going to criticize him, is he is still buying into the Department of Defense rhetoric, which is that it's Europe's fault. We didn't spend enough on defense. There's a big strategic call that Starman needs to make now, which I'm afraid he's fluffing. If he's not able to be clear about in the speech at Munich, I don't think he can be clear about it in the cabinet table or the NYSE. What is his view? >> Welcome to the rest of this politics with me Roy Stewart >> and me Anist Campbell. >> And we're doing something quite radical here, which is our main episode today is going to be located in a time and a place. We're going to bring you right into the heart of the Munich Security Conference. We're recording it a little bit earlier than we normally would, but I hope what you'll feel is that it gives you a sense of the flavor of international diplomacy. >> And then we'll do question time sometime early next week. >> Very good. >> We've also been really lucky to do some fantastic interviews and we are being spoiled for choice for leading in the coming weeks. So, we have been talking here to Sarah McBride, this extraordinary transgender congresswoman from Delaware. We've had a fantastic interview just now with Gavin Newsome. uh who I am strongly encouraging to run for it to go for it and try and get to the White House and also Alexander Stub the uh president of Finland. And we've also got in the can as it were coming up soon Rob Mali who was uh US administration's leading adviser on Iran and also the former German Chancellor Olaf Schultz. So we've been spoiled for choice. Sadly we have not been able to pin down Marco Rubio but who knows one day we will. So this is an episode where we're really going to try to bring you into two things. One of them is just a feeling of what these international conferences are like, what it's like to be here, the kind of things that people are talking about. But then we're going to get I think into the big issues which is what is now happening in the big international relations particularly between Europe and the US. And we're going to focus on two big speeches. We're going to focus on the speech by Marco Rubio the sexist state which happened this morning. And we're going to focus also in another speech this morning by Kama, the British Prime Minister. And I think Alistister and I are going to get into some slightly spicy disagreements about this about whether speeches matter and what kind of vision we need for the world. But before that, let's just give you a bit of a feeling for the tone of the place and what's going on. So to give a sense, we're sitting now uh in what basically uh in normal life is a shop of a hotel. It's the Bay Irish Munchin Hotel and uh we are going in and out of weird bars and coffee shops of what was once a perfectly functioning central hotel turn to a conference center. Yeah. Yeah. Uh with the sort of number of Les you'd expect in a hotel, not the number of LS you'd expect in a conference center and the number of doors you'd expect in a hotel, not the number of doors you'd expect. >> And and and just relentlessly bumping into people. So the first person I met after coming through security was Maya Sandu, president of Moldover. I then bumped into Pretty Patel. Uh I then bumped into uh how do we describe this? Somebody who works for uh British Intelligence uh quite senior in um her too. >> Yeah. Uh and and and on it goes. I then while was we were waiting for Alexander Stub I I chanced upon a presentation by the Ukrainian military about how they'd been developing uh their defense systems since the war started which was absolutely fascinating. I had to leave that early. I like this much much more than Davos. I think there are far fewer people just endlessly looking over your shoulder to see if any more important. >> It's less corporate. It's more defense and security. >> Much more about defense and security. I get the and and I think that there's something sort of quite old-fashioned about the about the setting which I I I quite like as well. So no and and I think speeches are still so important in history and in politics and and in the day-to-day a lot of the conversations this week running going around the place in Davos every single conversation was about Greenland pretty much. This year one year on a lot of the conversations have still been about JD Vance's speech. That shows you how significant it was. And now Rubio's tried to sort of reset that a little bit, I say. >> And yet at the same time, under the surface, this is a place to be reminded of how many other things are happening in the world which are not being properly reported. I um went to an event with Raza Plovi, the the crown prince of uh Persia, Iran, who has been very much one of the leading figures in driving the uprisings against the government in Iran. And then I saw him again uh later in the evening and we had another little chat. Very interesting. So I mean just because listeners probably would have heard our podcast on Iran. We were talking about Trump administration. He says the um the big fight now and actually he's just met uh the the Venezuelan Nobel Prize winner and what she's talking about yeah is Mashado and Pete are worried that what Trump's trying to do is just get rid of Hani and leave the rest of the regime in place. Some sort of revolutionary guard military government in place and he's saying it's just not enough. >> The people won't put up with it. Tens of thousands of people have been killed in the streets. There needs to be a real change. >> But at the same time, the Gulf, who are also here, are terrified that what Trump will do is just enough to annoy the Iranians and provoke a response, >> but not enough actually to topple the regime again. And so there's so there's a very complicated thing going on with the Turks, the Cataries, the Egyptians, and others to try to get some sort of agreement. And and nobody knows what Trump will do. We talked about this with Rob Money, what what he'll declare a success. This episode is powered by Fuse Energy. >> Most of us are buying energy in the dark, not knowing what it costs. You wouldn't do that with your weekly food shop. But with energy, you're often charged first and only find out the number later. >> When you don't have that clarity, you usually end up paying more than you should, which is what Fuse Energy is working to change about how energy works. >> The average household switching to Fuse can save around £200 on their energy bills. >> Fuse handles the practical side. The app shows what you're spending day by day and what that actually means for your bills. >> For listeners to the show, there's an added benefit. Use the code politics when you switch and you'll receive a free trip plus subscription. >> Switch to Fuse Energy and save around £200 on your energy bills. Use the code politics for a free trip plus subscription. fuse energergy.com/politics. The the other thing that I picked up which we haven't discussed uh much for some time is a reminder that the Saudi UAE relationship is disintegrating very very fast. UAE being Dubai Abu Dhabi against Saudi that matters cuz those are the two really most flamboyantly wealthy powerful figures. Katar's influential but those are the two that have really been driving foreign policy in these two figures Muhammad bin Salman and Muhammad bin Zed in UAE who were in lock step. They went together to war in Yemen. Uh they were very close to Trump and now a division has emerged. >> The other thing that happens people will have who followed this on TV will have probably seen the big speeches on the news. So there's Rubio, there's Mats, there's Macron, there's Kstar, there's Vonda, whatever. But there's also all these kind of really interesting kind of panels and workshops. I mentioned the one about Ukrainian military. Um but it was very interesting to watch the Saudi was it defense or foreign minister? foreign minister on one of the panels yesterday with the Colombian uh Kaakalis from the European uh Union and also Mike Waltz, the uh new ambassador, American ambassador to the UN >> who who who managed to put out a tweet where his major demonstration of his >> skills. Yeah. Was 30 pressups as his marine bodyguard. I mean it was impressive. >> It it was it was impressive. But on the other hand, is that really what >> we need from our senior diplomats? Was Talon famous for his? >> Probably not. But Talon, >> was Ernie Beavenon known for his ability to do press ups? Is Is the whole skill of an ambassador being able to do 30 press ups team? >> It's not. But >> so why the hell is he dedicating his big launch to the social media team, watching him do press up? >> Two reasons, Rory. One, because dare I say, he might be a bit of a showoff. And secondly, he might be thinking that's the sort of thing that Trump's like because he likes when we're fit and strong. Anyway, if you watch my if I can go back to my panel, >> the Saudi minister was saying almost in terms, look, I'm I'm feeling all this angst. I'm really paraphrasing now and I'm sort of adding a bit of my own interpretation. >> I'm feeling all this angst amongst you Europeans about the global world order >> is sort of vanishing in front of your eyes. >> But where we've been, it's kind of not really been there for quite a long time. And what you haven't yet fully caught up with is that we're emerging in a very different way as well. The other thing that was fascinating on that panel was I mean Georgia Maloney the Italian prime minister is one of the best eye rollers on the planet. I mean she's just abs her facial expressions are eye rolling. Kaakalas ran her close yesterday when Mike Waltz was talking about all the wars that uh Trump has stopped and when he was echoing the lines from Rubio about basically nothing happens in this world with the United without the United States. She was doing very good eye roll >> on UAE Sa will return to that but you can see in Yemen you can see in Sudan you can see in Somali land and you can see on policy to Israel they're knocking bits off each other and there's a social media war going on that's very distabizing before we move on to the big substance of our thing which is to talk about the big speeches Rubio Starmer etc. I was at a late night event with Google last night, which I'm afraid I didn't leave till almost midnight, so I'm feeling pretty rubbish this morning. And it was striking how much of that was about Europe now really worried about its tech sovereignty >> and Google having to try to reassure Europeans and Microsoft will be doing the same and other American companies the same that they can let you use their products without the American government either being able to spy on the contents or have a kill switch. And the kill switch point is that the head of the international criminal court was sanctioned by Trump basically accused of being a terrorist and Google and Microsoft effectively felt they were forced to completely disable all his accounts and all his access to everything leaving Europeans thinking well could this happen to us and there's some really interesting questions about whether you can set up legal structures subsidiaries to actually give Europe sovereignty on this and how you balance that against the a brutal point which Google would never make openly but that France is spending 20 billion on tech and that sounds like a lot but Google and the other tech companies will be spending over 300 billion next year alone on the next stage of their tech investment in AI. So the Munich Security Conference is chiefly uh known I think for many listeners because this is where JD Vance very radically in February last year a year ago made a speech to Munich to a horrified European crowd which you watched I think live. Tell us a little bit about it. Well, I said at the time it was like, you know, the audience of European politicians, diplomats, security experts, and it sounded like it felt like he sort of turned up with a a bucket of vomit and was just sort of throwing it across everybody. You know, he basically said that Putin's not your big problem, your lack of comm commitment to free speeches. He started the arguments that we then saw develop in the National Security Strategy about what they then defined as civilizational erasia. It really felt like it was signaling to quote Mark Carney at Davos that this was a rupture rather than a transition. And of course what this Munich conference will be most remembered for in terms of the American transatlantic alliance is Marco Rubio whose secretary of state whose speech today I think was it doesn't remove that much from the substance of what Vance was saying but he was perhaps much much more diplomatic about how he put it. The the other thing that was happening a year ago is that um this was the moment when uh Germany was about to go into an election when the AFD the alternative for Deutschan the far right was on the rise and of course Elon Musk was still very much part of the Trump administration. Musk was openly campaigning for the AFD. Vance the vice president took time out of his schedule to meet Dallas as the leader of the AFD and it was the first time that we began to see something that's in the national security strategy which is about the US using its influence in order to support what they seem to see as the kind of patriotic real parties against the sort of liberals who are wiping out European civilization. In other words, a moment where it felt as though the US was and the administration, particularly people like M putting their emphasis on trying to almost campaign for the FD and hoping they were going to win the election. Well, not almost trying to. They effectively were, you know, part of the rules-based international order about which Vance very dramatically last year was condemnatory and and Rubio in a more imolient way was saying pretty much the same thing is that you don't interfere in other count's elections, but they very directly have been interfering. Interestingly, yesterday the the whole conference here was opened by Fred, the German chancellor and in the Q&A he was coming as close as German chancellor has come to to say please vote Peter Muya in the Hungarian election but of course you know Trump is just out there vote Orban. Um, and I so I look I think this is I was a bit troubled by the response in the hall for Rubio because I was watching it and I was and maybe I'm you know we've just interviewed Gavin Newsome who basically basically said I probably do have a little bit of Trump derangement syndrome and there may be something in that but I was watching Rubio and I was feeling this is the same message but much more nicely packaged. >> I picked up a few sentences from it that I I thought were quite striking. We've increasingly outsourced our sovereignty to international institutions. So that's that's one big important American claim which is which is that which is an idea in the MAGA movement and the Republicans that the things that America created since 1945 the UN NATO are actually uh impacts on US sovereignty. They don't give it its full freedom of >> what is he saying? What is he saying the world should have done at that point? >> Well, so this is exactly the the fight, right? The agreement after the Second World War was that peace, prosperity was going to come from America, yes, slightly pooling its sovereignty, accepting rules that applied to America as much as to other people. That's the problem with international institutions. The rules apply to you as well as to other people, right? And what America got from that is incredible influence, power, unparalleled prosperity because it was able to use that system to build coalitions and allies and broadly push the world in its direction. But if you go for a purist view, and of course Brexit's partly about this too, where you say we're not going to make any compromises at all on our ability to do whatever we want, whenever we want, anywhere in the world, then logically of course you do end up where Rubio is just to go on from that. So we outsourced our sovereignty to international institutions, invested too much in massive welfare states at the cost of defending ourselves, imposed energy policies on ourselves that are impoverishing our people, oil and coal and natural gas, and let in an unprecedented wave of mass migration, civilization, the balance of history led to the shutting of our plants. So he's going on essentially his story and he he uses the forkyama world the end of history that basically everything that's wrong in the world came from the liberal global order globalization destroyed jobs made us weaker welfare states impoverished us the UN corporation >> which by the way until he became secretary of state to Donald Trump he did not believe this is what I find so appalling about these people so and actually one of the things I was alarmed by he almost got a complete standing ovation Why do you why do you think the Europeans were so cheered up by but because he talked about Leonardo da Vinci and said how lovely >> Beatles and Shakespeare and the cyine chapel and Christopher Columbus and that's we got our laws from Britain and all this stuff. So what he did was essentially say look we all know and this is something that Gavin Newsome was saying to us just now they all basically exist to imagine that Donald Trump is watching them on television. Now let the reason why the Europeans were quite cheered up is because it was not as appalling as Vance, but the message was pretty much the same. So he had all he said all the things that you were saying, which is what Vance said. Yeah. >> And the National Security Strategy says that Europe because of immigration and because of all the other stuff that they're saying only we do. And just a sort of footnote on this because I'm not sure we've talked about this enough on the podcast. American public diplomacy is now increasingly aligned with the national security strategy and which is a pompous way of saying >> has to be. >> Yeah. Yeah. Exactly. It's a pompous way of saying words matter. This story that you know what Trump says or what's in the strategy doesn't really matter. The whole bureaucracy is now behind the idea that you're meant to be behind parties like Orban populists in Europe and you're meant to be pushing back against liberal democracy and immigration etc. And what I found a little bit alarming about the response was it there was something really needy about it. And the reason was he said the right things. He said look he he did it was quite moving when he talked about the history and and the role of Europe in giving birth to America. And he talked about you know we'll always be partners and we are your children and all this sort of stuff. He had lots of moving lines but it was I I think and maybe I'm being harsh on him. I think it was a very effective political cover of a substantial strategy that is not remotely changed. So I think you know this is where we should talk about Karma's speech as well because in a way um the part of Kama's speech I really liked like for example the fact he's basically saying you know Brexit he's not quite speaking about Brexit in the way that I would but he's basically saying we have no security without Europe and that is more so the case now but I think there was also an element of a rebuttal of Mark Carney in there. Well, let let me do my attempt to sort of do a a minute summary of of my census speech, then you can correct me because you you had a much closer uh thoughtful engagement with it. So, he begins by saying we need to understand that the UK needs to be much closer to Europe. And he talks very explicitly about the fact that Europe's got far too many different national defense systems when the US has one frig, one advanced fighter jet, etc. And that needs to be sorted out. But he then says some people talk about rupture. The person who talked about rupture is of course Mark Carney and that was Mark Carney and Davos a few weeks ago and I disagree and I think we need and he then explicitly says we cannot break the transatlantic relationship. We need to remain very very close to the United States >> and that is why the audience for Rubio so welcomed him saying something similar. So there was a a sort of complimentarity between Rubio's if you strip out the kind of the really kind of negative stuff about Europe and immigration you strip that out it's a very kind of Vansian MAGA speech but the mood music was very very different and that is what pleased the audience which I think will also please the European audience is that there's K star essentially saying this is the bit that that maybe he went down particularly well was we are very much part of EU. We have to reform our defense systems. We have to be much closer. But at the same time, he's saying we have to do our level best to keep this transatlantic relationship with the United States very very strong. And I don't think many people will disagree with that. Um but but what was interesting is that he didn't in a way that Mets did. Stub is now doing the president of Finland and certainly Carney in he doesn't at any point in the speech really call out the US. He doesn't say as everybody is here still Greenland is the game changer. I mean one of the the interesting things I feel with European colleagues when I've been talking to them both in meetings and outside meetings and and late at night is their take on Mets's speech is he needs to buy time. He needs to get an EU US trade deal across the line. >> So he doesn't want to unnecessarily offend Trump until that's done. >> Yeah. But they are in absolutely no doubt that the world changed with Greenland and you get that sense with stop too. The point at which the United States signaled in the leadup to Davos that it was prepared to annex somebody else's sovereign territory. Game changer. >> Yeah. And I and I think Karma's speech is clear about that. I mean he said you know he says in terms we recognize things are changing. The US national security strategy spells out that Europe must take quotes responsibility for its own defense. That is the new normal. >> No no no. Can I interrupt and be mean to him? Right. >> You've just told us what actually is interesting about the US national security strategy. Not that it's saying that Europe needs to take responsibility for its defense. That was a line from the first Trump administration. That was a line from Biden. That was a line from Obama. >> Right. And that's what Elbridge KBY was selling yesterday in his speech wandering around defense. Right. As you pointed out, the key point of the US national security strategy is it's talking about civilizational erasure in Europe. It's talking about putting its energy behind the populist far right in Europe. It's talking about us not being democracies. So what actually Starmer is doing, if I'm going to criticize him, is he is still buying into the Department of Defense rhetoric, which has been running for 10 years, which is that it's Europe's fault we didn't spend enough on defense. And that the US criticism of Europe is perfectly legitimate. If only we'd spent more on defense, we'd be able to stand on our own two feet. But that isn't really what Trump's policy is about. Trump's policy, that's now just it's a it's increasingly clear that's just a mask. this is what the DoD says and we parrot that line and and STAR is paring that line. They're much more radical than that. They're not serious about the NATO alliance. They're not serious about helping us against Russia. They're not serious about helping us rearm America. Isn't serious about getting European defense industries off the ground. They're not serious about helping us with satellite Ukraine. It's  They this is this is a a spin from the DoD, okay, to justify Greenland cuts, aid cuts, betrayal to Putin, betrayal on Ukraine. >> No, I listen, I get that, but I I think that's easy for us to say, okay, he's the prime minister of the United Kingdom. >> How come Carney can say it and M >> I think Carney No, I don't think M did say that. I think >> he's much much closer to it than than than Star. Well, let me just let me just say I said to you the start there are bits about this speech I like and there are bits of speech I like less. >> Did you write the speech? Is that why you're defending? >> No, I didn't write this speech. No, I did not. He said he said there have been a series of thoughtful interventions including the argument that we are at a moment of rupture. >> That was Carney's great speech. >> And that was Carney's word. So this is basically where he's he's saying Mark love you lots. Think you're really smart. thought the speech is amazing but this is the but he goes I agree the world has changed fundamentally and that we must find new ways to uphold our values and the rule of law now Carney was big about saying we can't pretend that we have the same values okay he's saying that very stovachi there but in responding to that change we must not disregard everything that has sustained us for the last 80 years this could prove to be a moment of destruction which is the theme of this conference s is German word for destruction and the the conference is arguing the world order has been destroyed but instead he says I believe we must make this a moment of creation instead of a moment of rupture one of radical renewal and I think the substance of the speech then is actually you're now putting your head in your hands Rory which is making me think I'm making you ill but but I think the substance of the speech is actually say is I've said this so many times meron all of them karmama they're trying to buy time they are. This this speech is about building up our defenses in incredibly difficult political circumstances because what he's saying there probably means at some point in the near future, we're going to have to increase defense spending massively. We are going to have to do some of the things you talked about about rebuilding our diplomacy, investing more in intelligence, but at the moment, particularly in regards to Ukraine, we are having to rely on the United States of America. So he's saying it's not that sensible for us to come around and be like Alistister Campbell and Rory Stewart and just say these people are truly terrible. >> No, I I agree with you. He should not be talking like a podcaster. He shouldn't be doing his love actually moment. But I think that Carney and Macron certainly and even Mets have demonstrated and STO was demonstrating when we talk to how you can do this without blowing up the translation and and you need to because there's a big strategic call that Starman needs to make now which I'm afraid he's fluffing if he's not able to be clear about in a speech at Munich I don't think he can be clear about it in the cabinet table or the NYSE what is his view what is he telling the British Right. What's he telling us about the future of our intelligence relationship with the US? What's he telling British industry about how much we should be creating an economy built on American cloud computing, American AI? What's he saying about how much American defense equipment we should be buying? What's he saying about how command and control in NATO works? What's he saying about what kind of deals we should have with China? What's the big view? We know what Carney's view is. We can see what Macron's view is, even if he's struggling to deliver it. And above all, the only hope for the middle powers is if they get together, if they begin to develop and share a joint philosophy, nothing is less useful than the middle powers sniping at each other and saying, \"Oh, I slightly disagree with your speech. I don't think it's quite like this.\" And >> I mean, it's a real civil servant speech. It's well, you know, on the one hand, on the other, and you know, yes, some things are changing, but we still want to renew and I think I do think you're being harsh because I think there's a part of this speech, you say, what's his message to the British people? Part of his message to the British people is that we might have to prepare ourselves to to be at war and and and as a result of that have to change our defense industries. And he I think he is answering some of some but not all of those questions. And okay, when you say it's a civil servant speech, it is he is sort of saying on the one hand and on the other in a way that I mean Mark Carney and the reason why you and I liked that speech so much was because it met a moment where the American president was basically saying, you know, you lot don't matter nearly as much as you did. And Mark Carney's response is, well, you might say that, but actually if we get together, we matter an awful lot. What I think a lot of K star speech about is actually in relation to what what he's done with the French, the Germans, the Poles, and the others in in relation to Ukraine. That is going to carry on. So I think it's I think it's what you want. I think you do want a bit of the Hugh Grant love actually moment. >> I I'm not interested in standing up to Trump. I'm interested in how he remains in lock step with Carney Mron and Mets. They need to be reinforcing each other's messages and repeating again and again and again. What's the vision? What's the Jean Mon five 10 year vision >> for how the rest maybe I'm being maybe I'm being way too optimistic and this is my own confirmation bias coming in. I'm reading in here quite a substantial step down a much more sensible road in relation to Europe. It was interesting when we interviewed Alexander Stub, what did he say right at the end? And look, it's an old tactic, you know, you you you wait till the very end to say the thing that you really want to deliver with absolute passion. And he'd mentioned how much he admired and respected Karma a couple of times through the through the interview and then right at the end says, you know, it took you seven years to leave. I want you to seven it takes seven years to realize this is a disaster and seven years to get back in. I see within this K star pointing Britain in a very European future direction but saying again to use Alexander phrase he used a couple of times don't throw the baby out with the bath water in relation to the United States >> maybe let's move it off stma and I was thinking about this talking to the Canadians yesterday let's say we want in 5 10 years to create a situation in which we have a rectangular world where the four corners are US China global I've got here. The reason you say that is because this is Al Alexander Stub's book, The Triangle of Power, >> and and he's we detected as we were talking to him, I wish that maybe he' called it the rectangle. >> The rectangle. So, let's say it's a rectangle power where the US book the US is actually separate from Europe, UK, Canada, Japan, South Korea, right? >> Australia, >> Australia. Put them all together, you've got enormous economies. You put those lot together actually the economies larger than the US larger than China if they can coordinate. So let's say those economies want to reduce their dependence on China and the US critical minerals and independence right independent sovereign control of critical minerals quantum AI cloud computing satellite ISR ballistic missiles uh financial payment systems debt right how would we do that architecture what kind of leadership would we be looking for It's a huge shift. The I keep coming back to this very very weird moment where Europe and the UK didn't manage to get their defense agreement together. >> Mhm. >> So, a lot of Star speeches about it. It came down to the fact that Europe wanted the UK to pay a few billion and the UK thought it was too much. But what you expect at a moment of crisis is political leaders not to get caught up in that sort of stuff, to see the big picture, not to get dragged down into few billion here, a few billion there, some rules here, but really think we've got to make this work. I mean that is a fair point and I think it relates to a desire sometimes for governments and politicians not to make people scared and I think we're reaching that point where we maybe do need to make people a bit scared about what this all means. I think we've I think the it was interesting talking to Ali's understood. So he said the part of the argument of his book is you know 1918, 1945, 1989 real turning points in history and the responses then dictated safety or not, security or not, prosperity or not for the next generation. And he was arguing that 2022 invasion of Ukraine rather than as I sometimes see it Trump term two is that moment in history. And what I'll tell you what I'd actually liked to and maybe this is just because I'm too political. You're you're looking for K I think to come to the security conference and make a big big speech about us and I think there's elements of that >> but Churchill would have done it >> possibly. Yeah, I'm sure he would. But I actually quite like the can I just read you the ending of the speech where he talks about the need to build consent for all the difficult decisions that we're going to have to take. All the governments represented here are going to have to take to keep us safe. And he says because if we don't the peddlers of easy answers are ready on the extremes of left and right and they will offer their solutions instead. It's striking that difference different ends of the spectrum. So in the UK this is Green Party and and reform striking the different ends of the spectrum share so much soft on Russia weak on NATO if not outright opposed determined to sacrifice the relationship relationships we need on the alter of their ide ideology. The the future they offer is one of division then capitulation. Lamps would go out across Europe once again. We will not let that happen. If we believe in our values, democracy, liberty, and the rule of law, this is the moment to stand up and fight for them. That's why we work together, take responsibility, etc., etc. Now I you again, you're looking sort of >> I it's not great, is it? it that I think is where he is starting to say to the country which if you relate to the top of the speech about where we might actually be at war. He's basically saying to the country this is this is a much more serious fight that we're in than maybe we have been telling you. >> But it doesn't feel like he's got it yet. I don't think he sees how serious it is. I don't think he sees how radical the rupture is. I think he's just caught up. This is speech. A lot of this is about Russian threats to Europe and they need to defend ourselves. and he's worried about Farage. I don't think he's actually really thinking about how the US has completely shifted the entire global >> architecture. Is Farage in our politics not to some extent a code for Trumpism? >> This is no longer a world that you need to be coded. I mean, we've just interviewed Gavin Newsome, but actually, as I say, there are many world leaders who demonstrate that you can be pretty the only Bani and Macron are really the only ones. I don't agree with you that Mer really pushed the boat out yesterday. I think Mets went a long way further than the stomach. >> He already had though. He already had. But I think maybe they're all playing a different role. I mean, look, we should find out what we will find out the other too much different role. This this this is my obsession that I I actually had this disagreement with somebody yesterday from Europe. They were saying, well, maybe we don't need big ideas and big architecture. Let's look at all the little uh different agreements we already have and all the different initiatives. And if you put them all together, it's a classic civil service speech. Oh minister, you don't really need a big thing because actually we've done a bit of work which proves that the government's already doing all the things you want to do anyway, right? I actually think this is a moment where you do need big unified vision and you need big new structures and big new ideas. And what worries me is they're all thinking they're doing all their own little clever things and they're doing we're doing a bit here and we're doing a bit there. And that's where, you know, I think Tony Blair would have made a much bigger speech. Certainly Winston Churchill would have made a much bigger speech. But my suspicion is McMillan would have made a bigger speech. That would have been made a bigger speech. I mean, good god, even Boris Johnson would have made a bigger speech. I mean, this is a moment that actually requires some leadership and vision because multilateral diplomacy is a lot about that. I mean, just see the power of what Carney did. >> There's no reason why Britain couldn't have led that debate. Would you have been happy or happier if he had said something like this? Trump term two is fundamentally different to Trump term one. We all know that. Um >> name checked Greenland. Even the word Greenland would reassured me. >> Okay. the um a year ago JD Vance set out a very very different vision for relations between the United States and Europe and it's one that since then we've all been coming to terms with >> and let me add to that and I do not accept civilizational Russia. >> Okay. And we did that. We showed in relation to Greenland that together in our different ways with our different tones and our different this and that and the other, we can push back and we and we did that and I'm very very pleased that we did that and actually Marco Rubio Rubio's speech today in part reflected that. However, the scale of the change that we're undergoing with a different Trump administration with China on the rise with Russia now doing what it's been doing since 20 well since 2014 that we as a country have to face up to far greater responsibilities on defense, intelligence, diplomacy etc. And we are going to do that and it's going to mean some very difficult choices >> and it's going to mean bit of pooling sovereignty gonna mean working with others >> and then go on to the bit about Europe and we don't have defense without European NATO and we have to be strong in Europe and therefore this is where I would go but he and I I maybe I'm just being a bit sort of naive about this. I think that's what he's starting to say in that. Now, what I where I would like to get to is a place where we can continue to have decent relations with the United States because I know that's important in intelligence and all the other stuff and at the same time persuade the country because I think the country is eminently persuadable on this. We made a huge mistake in 2016. We are still paying a price and we now have to fix that faster and in a more radical way than thus far we've been considering. Would that have made you happier? >> Absolutely. The thing that's cheered you up and cheers me up is it looks like the policy is to get much closer to Europe. But my goodness, we seem to be fluffing it on the first test with defense, which should have been the easiest thing of all, >> which was a two-way thing. >> Yeah, absolutely. But it's got to go much beyond that. We've got to get that feeling that we're thinking about Canada, Australia, Japan, South Korea. We've got to be thinking about critical minerals, rare earths, AI, all this kind of stuff that I'm talking about. We've got to have a sense that this is where we need to develop sovereign capacity, be independent. We need to find a way of being respectful to the US and playing the president's language back against him. The way you say it is, listen, thank you, Mr. President. You're absolutely right. We need to be more independent. You keep saying it. It's in your national security strategy. Marco Rubio said it. We need to send our energy feed. That's why we're going to be spending three and a half% of GDP on defense. That's why we're going to be building our own defense equipment. That's why we're not going to be buying quite so much defense kit from you because you don't want us to. You want us to be independent and standing on our own two feet. That's why we're going to be uh making agreements with France to develop new forms of deterrent. And we'll do this in partnership and we're stronger to be there and we're stronger allies. >> But the direction of travel is independence. >> Okay. Well, I don't think we're fundamentally disagreeing. I think you probably just wanted a >> Well, I want some leadership. I want some leadership. No, I want leadership. I want vision. I want a sense that he cares about the multilateral system, that he cares about the international order, that he's not just sort of making little comments about Carney. I mean, what was the point of that? What was the point of having a go at Carney? I mean, really, he could have made the whole speech being polite to the US if that's what he wants to do, being pro- Europe without having to distance himself. That's sort of actually sounded I'm afraid a bit chippy and insecure as though he's a bit jealous the fact that Carney's saying to him. So where's the big story? Where does he think we're going to be in 5 10 years time? Well, I hope the big story is where Alexander Stub wanted it to be at the end of our interview, which we'll be putting out in the next couple of weeks, which is understanding that at a time when our closest ally, United States historically, is making clear that in their eyes, whatever Rubio says today, this is a rupture, that our future is very much as a leading economic, political, military, diplomatic power in Europe. >> Very good. Well, let's end on that, Alistister. Thank you very much indeed. >> See you soon. >> Thank you."
    },
    {
      "id": "EcrV-7Mwo7o",
      "title": "Can Liz Truss’ Mini-Budget Work in Japan?",
      "channel": "The Rest Is Politics",
      "channel_id": "UCsufaClk5if2RGqABb-09Uw",
      "published_at": "2026-02-12T18:00:07+00:00",
      "transcript": "Sana Takichi. She's in power for 110 days. She does some really quite bold economic things and then she calls a snap election and she's won massively. >> Japan really, really matters. They would effectively go to war to defend Taiwan against China. She is very clearly going proTrump. For decades now, Japan was pacifist economic powerhouse. If she shifts it to an assertive, more militarized nation state, then I think we're in a very different world. >> This episode is powered by Fuse Energy. >> Most of us are buying energy in the dark, not knowing what it costs. You wouldn't do that with your weekly food shop, but with energy, you're often charged first and only find out the number later. >> When you don't have that clarity, you usually end up paying more than you should, which is what Fuse Energy is working to change about how energy works. The average household switching to Fuse can save around £200 on their energy bills. >> Fuse handles the practical side. The app shows what you're spending day by day and what that actually means for your bills. >> For listeners to the show, there's an added benefit. Use the code politics when you switch and you'll receive a free trip plus subscription. >> Switch to Fuse Energy and save around £200 on your energy bills. Use the code politics for a free trip plus subscription. fuseenergy.com/politics. Welcome to the rest is politics with me, Alistister Campbell, >> and with me, Rory Stewart. >> Now, we've done three episodes at least in recent days on Labor and the current travailes flowing from the Epstein files. So, we're not going to talk about that in question time. We're going to talk about the Japanese election. Fascinating. We're going to talk about the presidential election in Portugal. Also fascinating. >> We know a little bit of sport, Rory. Y >> but the politics of sport. >> Okay. >> Winter Olympics. Y Super Bowl. >> Lovely. >> Um and then we would do something a bit lighter. >> Lovely. >> Later on. Okay. All right. >> So, should we try and be really disciplined and not talk about Labor? And should we try not to talk about Trump? >> Okay. >> How that be? That be it could be hard, but we'll try. >> Okay. Yeah, I'm not going to take your challenge on not mentioning Trump because the first question that we're getting is from Matthew Wright in Wiltshire which is about Japan. What does Japan's election result mean for its relationship with China and tensions in the Pacific? I mean the beginning of the answer of course Matthew is that Taiwan has become the big flash point between China and Japan in this election because San Takayichi who is the Japanese prime minister has now said explicitly for the first time as Japanese prime minister that they would effectively go to war to defend Taiwan against China and she is somebody who's seen as being closer to the man that you don't want to mention in this podcast and the US alliance >> just this episode >> and it's going to be weaponized a great deal by China and we'll we'll get into that a bit later on the podcast how the Chinese might perceive it but first tell us a little bit about this election. >> Yeah. No, it's it's incredible story this. So Sana Takichi is the first female prime minister in Japan. She's the leader of the LDP, this incredible party that has been in power kind of all of my life and more. um and is a sort of formidable political machine that's sort of been spluttering in recent years and prime ministers falling over the edge. A lot of corruption, a lot of gerontocracy and along comes Takichi and she takes over the leadership. She becomes prime minister for the third the third time of trying and she's in power for 110 days. She does some really quite bold economic things. We'll talk about whether we think they're going to work or not. And then she calls a snap election and she does three things that you constantly told not to do. Don't make the campaign so short that even your own campaign candidates can't prepare properly. She has a two-e campaign. Never do it in the middle of winter because people struggle to get to the polls. She does it in these massive snowfalls. And don't do it when students are doing exams because particularly like her when she's got a big appeal to young people. Um so she does all those things. middle of winter, students off and it's a snap, literally a snap election and she's won massively 316 of 465 seats >> up from 198. So she's gone from a minority to basically nearly 2/3 of the lower house >> and if you get two/3s in the Japanese system it means you can make massive change and she can do that with a bit of support from this other party, the innovation party. So, she's going to do a lot and she she's she's a very she is a very interesting figure. When we first talked about her when she became the leader, we both said, you know, that she because she dresses like Thatcher and she says she she she says she likes wants to be seen as the iron lady and she models herself on that. And I had a very interesting email from a woman called Tina Barrett who is a professor of political science at a university in Tokyo. and she sent me a long note way back saying, \"You guys are getting caught out by the propaganda. This woman is more less trust than Margaret Thatcher.\" >> Well, listen, I mean, so so much to talk about here, but I think first thing is Japan really, really matters. I mean, we we'll get we'll get on to Portugal in a bit, but Japan is still one of the largest economies in the world. It is America's big partner in the Indoacific, big balance against China. And the first thing I think that really strikes me is a reminder of how unpredictable global politics has become because I was um following very closely I I was in Japan last year and I was following very closely a series of Japan experts both Japanese and foreigners talking about this election and basically it's been surprise after surprise after surprise who got it all wrong. So the the first thing is that when she was running for leadership as you say cuz she'd been defeated twice already and she's a woman and she's quite an unusual woman from the right. A lot of the conventional wisdom uh was hoping that the victor was going to be Kazumi. Koimi is the son of the man that you knew. So he's the premises son. He's in his early 40s. He's glamorous. He's quite kind of centrist more on the left of the LDP. And actually what happens is that he manages to run against another centrist, split the vote. He ends up with 27% of the vote, she gets 31%. So she comes through on pretty narrow margin against all the pundits predictions and becomes leader. Next thing that happens is everybody then sucks their teeth and says, \"Well, it's going to be pretty difficult for her because actually, you know, she's seen as a bit of a sort of outsider in a party dominated by these people who are, as we've often said when we're talking about Japanese politics, many of them are dynasts, you know, their children, grandchildren of ministers and prime ministers.\" And she's from a a more modest background from Nada, didn't go uh initially to the fanciest universities, etc. So, it's going to be difficult for her and and she's in an impossible situation. The story was she can't do it because a far-right party has emerged, Sens, which is beginning to pick up big anti-immigrant vote. And at the same time, she's going to lose her coalition partner on the left who have signaled they are extremely uncomfortable being connected with the right-wing party. So, her problem feels a bit like, you know, for example, the Tory party in Britain. You don't want to overstretch it, but she's got the rise, as your friend Chris Mason would say, the rise and rise of Sanset of reform. >> The rise and rise of reform. >> He was a bit upset, I thought. But we're not talking about later. Carry on. >> Anyway, that's happening on her right. Meanwhile, she's about to lose the left-wing coalition. And the story is nobody can change uh Japanese politics because to use another cliche from British politics, governance is broken. Japanese government's broken. And basically the story is prime ministers don't last, nothing can get done. The LDP is mired in, as you say, old people, corruption, uh these incredible factions and policy machines. So she's stuck. And then she calls an election >> and then everyone's like, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa. How on earth is this going to work out? Because how on earth is she going to deal with the populist rights and the fracturing Japanese politics? what we talking about in the uh in the episode we did on Monday, this thing about reputational currency in the bank. So what you're describing is a place where she didn't have that much reputational currency and as I said on Monday where politicians get big reputational currency is by winning elections and she has won so big. >> Yes. Exactly. So let me just sort of develop that. But so contrary to most these pundits predictions she's killed it >> and again you know you you can imagine when people call snap elections people have visions of Macron but she didn't do it like Macron having been in for a long time in a very weak position. She moved very very quickly. >> But you've also pointed out three reasons why that election might not have worked and actually worked brilliantly. Okay. So now she said next problem that we have which is that journalists writing about it find it sometimes if you I we can share a New York Times article which is a classic example of this. They get very excited by the fact she's the first woman. She plays the heavy metal drums. So there's a lot of memes about her playing the drums with the South Korean president. >> Yeah. >> And there are lots of um special celebrity toys being made with her face and there's a bit of a movement around her etc. And so a lot of the journalism is quite personalitydriven and it's not really asking the questions we'd normally ask an election. What actually happened district by district? How is it possible for this party to go from basically being a minority to having a super majority? What what on earth happened to the opposition? What's happening with this youth vote? I mean, she's kind of a right-wing traditionalist anti-immigration >> and then the young people >> come and and the other thing that she and again a a position that Japanese politicians traditionally have been very wary of getting too close to is actually the idea of militarization and national identity and the military. And she even had a go at China over Taiwan, which again got very little sort of entrance into the the election debate, but has got massive significance because China has already retaliated, banning seafood, urging Chinese people not to go to Japan on holiday and a fifth of all tourists to Japan are Chinese. >> Okay, so let me just give the Chinese perspective. So I I I I uh over the weekend spent a couple of hours with um somebody from mainland China and he was emphasizing he said you know to be fair he said look some of this is propaganda in our school textbooks but some of this is genuine belief >> the Japanese from the Chinese point of view invaded Manuria invaded China committed unbelievable atrocities killed millions of people and after the war there wasn't really a denazification and they didn't apologize properly. In fact, right-wing politicians, of which she's a good example, continued to visit the shrine dedicated to war groups. So, from the Chinese point of view, they're looking at this and they're saying, \"Here is an aggressive nationalistic militarist power that has never come to terms with what they did during the Second World War.\" And here's a leader from that faction saying that she is going to fight on Taiwan's behalf against China when Taiwan belongs to China. from the Chinese point of view, and this again isn't being picked up in the coverage, there's there's a real sense here from China that they're thinking about Japan in the way that maybe um I don't know, Europeans might have thought about a resurgent Germany if it had suddenly militarized in the 1960s, not long after. >> No, I look I I think you're right. the China um I mean and and tr to be fair this podcast too we don't talk enough about Asia but if you've got the Chinese Communist Party saying to the Chinese public uh please don't go to Japan we don't recommend you go there for your holidays anymore a lot of people not are going to follow that and that is a big hit on the economy and if if I go back to my professor friend Tina the reason why she says that she's more trust than Thatcher is because of the economic policy that she is already pursuing. So she's she's really going for very loose monetary policy, big spending and cuts to tax. So she's she's promising massive cuts in consumption taxes. >> Y >> and at the same time she's talking about massive boosting of spending. >> Yeah. and Tina who's a professor of Japanese politics is say this has got a horrible feel of the truss quart mini budget and >> one of the questions here is we've talked about this a lot the Japanese debt to GDP ratio is enormous scale off scale and normally people say that that's less of a problem than it would be in the UK because a lot of it is owned by the Japanese sort of internal things but there's a limit to that and it's interesting the markets have responded positively to our election but there will be many other people looking saying where on earth is the Japanese economy going and the Japanese economy really really matters the world. Um final final thought um I think we need to watch carefully the geopolitics this and this maybe relates to the the question from our our listener because she is very clearly going proTrump. She sees herself as a disciple very much of Shinszo Abbe >> who Trump liked a great deal. She will be taking a more nationalistic line against China. We really have to watch this question on the constitution. Is she going to change the constitution? >> Because she she probably will be able to if you >> to allow Japan to become a fully militaristic power and if so, this is the big change because for decades now, Japan was pacifist economic powerhouse under American security umbrella. If she shifts it to an assertive, more militarized nation state, semi-autonomous, then I think we're in a very different world. >> Yeah. The other the other thing that she was doing partly I think to to deal with this farright party was very very strong line on immigration. Now of course compared to most of the developed economies Japan doesn't have that many >> very few there's a few Kurds living in some towns. >> Well they've got they've got slightly more >> and she claims in her hometown of Nara that she saw a tourist punch a deer in the deer >> I know and there was never any evidence of it at all. So, she's got a little bit of I'm not going to mention the DJT guy, but a little bit of Trumpism to her communication, but the truth is Japan, I mean, what's one of the stories that we've talked about Japan for years and years and years and years is way ahead of us? The aging population. >> Medage Japan about 51, median age in Britain about 40. Median age in in Europe higher than Britain. Um, but by the time you get down to somewhere like Nigeria, it's 16 to give a sense that >> Yeah. What's your favorite Nigerian stat? >> One in 10 children born in the world will be born in Nigeria by 2050. >> Yeah. The reason why I keep asking you to repeat that is if I live to 2050 and we're going to we're going to come back and see what it's also true that all demographic projections are always wrong. >> Exactly. >> I mean, but also I mean Yeah. I mean, we need to talk about that in more more detail some other time. >> And and so you've got this aging population. They're all living a very very long time. And yet she's saying no more, you know, we're going to cut back on immigration like us. They're going to need it. >> Yeah. And as you point out, it's it's obviously not just that they're very healthy and eating good food. It's also they're just not having any children. And that's a problem for South Korea. South Korea, I think, you know, the average f uh number of children is now getting down to about.3 per family. So there's this demographic collapse and no immigration coming. Yeah. >> Just on on the we should do a thing on demography at some point, but do you see that the French are right the government are writing to every 29year-old basically saying get on with it have kids. Now >> what do you think about Victor Orban's policy? I mean it's quite interesting right? He's saying that anyone any woman who has three children is exempt from income tax. Now any woman who has two children exempt from income tax. It's presumably quite, you know, if you were wondering, am I going to have a second child, third child, being exempt from income tax for your whole life, that's pretty good, >> huh? >> And we've got an election coming up. And I wonder if that might be why he's suddenly saying, let's give some more money to parents. >> Yeah. Now, Josephine in South Hall, what lessons can progressive British politicians draw from the Portuguese presidential election about how civil society can mobilize and cross party elites can coordinate to counter anti-democratic movements. And this relates to the the presidential election, which is not the same as a parliamentary election. Uh I think this is look there is a lot to unbundle here in terms of left right farright progressive battles but I think from the British perspective this is as much about political systems as anything else. This is the second round of a presidential system where in the first round anybody can stand and the top two go through. And what's happened is that the far-right guy Ventura uh who was a former sports TV commentator, the kind of Gary Lker of Portugal, he founded this Chagga party in uh 67 years ago and has made a huge impact upon Portuguese politics. But what's happened is that having got into the second round, there has been this mobilization. So the equivalent for Britain would be if in our we've said often what's what we've known as a two-party system becoming a four five six party system >> is if rather than having our parliamentary elections you had in the next election let's see who votes for them all and then the top two let's say the top two is Stalmer and Farage they go through >> absolutely and so it's a totally different system >> then it's much easier to see people allying against um so I I think the positive story uh which is what our question is pushing is it's rather interesting because what happened is that the Catholic Church came out uh for the leftwing presidential candidate. Quite a lot of right-wing politicians came out against the far right. So there was a sort of nice story of people creating a kind of firewall to exclude the far-right candidate and boy is he a far-right candidate. I mean his posters during the election were this is not Bangladesh right was his key key example of his posters but but but as we've said before two years ago people were still talking about the Iberian exception the idea that Portugal and Spain were somehow immune to populism this guy on the far right this is not Bangladesh over 30% of the vote now that's a big vote his vote share is basically the same as Kama got in the last election in Britain so this is a huge huge political force. He's taken it from zero to I think 50 seats and parliament. >> No, I I think I I wonder whether in Josephine's question is the thinking that this shows you can come together and fight them off. Now on one level it does and there was obviously a lot of public awareness there. So you had quite a lot of conservatives voting for the socialist >> uh to stop Ventura winning. >> Um but I'm not sure there's much beyond that. I agree with your assessment that this shows that actually in a country that not long ago, former fascist country, don't forget that we we see this maybe we shouldn't be too rosetinted about this. This is a little bit of a I think it's a warning sign as much as anything else. It does show if progressive forces get together and fight, they can win, but it also shows that these guys are are on the rise. Maybe that's two elections we've cover. Why don't we come back next week and and talk a little bit about Thailand? >> Lovely. because that's another huge election and of course longer to unbundle that one because the battle there is not necessarily the battle at the ballot box. It's what happens after with the monarchy and >> okay well let let's do that and let me um maybe uh to to bring a lighter quicker tone um because we've done quite a lot of serious in-depth geopolitical >> go sports not serious. >> Yeah, there we are. Uh question from Alex in San Diego. Is the Winter Olympics a sign sport is the only thing that can make us feel good right now? Now, is that true for you? Is that the only thing that makes you feel good at the moment? >> Well, there's a lot of things right now making me feel bad. Neither of which I'm going to mention. Um, but I I have here Here's a great Have you watched any of the Winter Olympics? >> No. And I'm really So, because I ski I mean I ski obsessively. I'm completely obsessed with winter sport. So, I love watching skiing. >> Well, I've I watched I'll tell you what I've watched so far. I watched the opening ceremony which Danny Bole will never ever be beaten. London 2012 with the best opening ceremony of all time but the Milan Cortina opening ceremony was terrific. It was really really good. It was actually quite moving and the speeches were moving. Uh a bit long could have done with a good you know Campbell red pen through them but they were good and their message was about this about there's so much division in the world there's so much hatred. Sport can bring us together sports about this this this. It was good. And of course the fact that JD Vance was in the audience was you know I think it was pointed and the other the other moment uh notice I'm not mentioning his boss. Uh when the American team came in the loudest cheer of the evening bar none was for the Ukrainian team. The Ukrainian team came in and it was really moving. The whole place went absolutely crazy. They went pretty wild for the American team and then the feed, the live feed camera panned to JD Vance and his wife and the booing started and they cut away instantly. >> And it then transpires that one of these American TV stations, one of the ones that's been taken over by these awful tech oligarchs that are destroying the world, they they dubbed out the sound of the booing. My other favorite Van story is one an American athlete, a skater who was, as we say in the sports world, tipped for gold. She she got silver. And I think the reason was it turns out she was almost missed the start because she was held up by this 40 car convoy fing JD Vance around Milan. 40 cars. >> He cost him the gold. That's not good. Yeah. >> So I Well, I don't know if he did did, but I'm saying he did. Um there's there's a as somebody who is um who loves this stuff, I I really all I want to do is live in the mountains and live in the Alps and be at altitude and ski. >> Okay. But just on that, so you ski, you like skiing and your family not not just like it. I'm I'm actually reasonably good at it. I was actually in teams for this kind of thing. >> Oh, we need film. We need film. We need film. The rest is ski. Yeah, you can see that. >> But let me ask you this though. Why then do you not enjoy and like watching I've never skied in my life. Yeah. But I like watching the competition of the skiers. So last night I was watching this sport. I don't even know what you call this sport where these skiers were it was like an obstacle course. They were jumping onto on jumping onto tubes and skiing down those and >> doing these sort of >> This is a freestyle. >> I think it was more than freestyle because it was like barriers and all sorts of stuff. It's almost like show jumping. The other thing I love about the Winter Olympics is that when they're out on the mountain, you know, it's there are relatively small crowds because it's very hard to get to and you can't build the infrastructure, but it's these athletes, they come down and then their family are there. >> Oh, it's so lovely. It's just the other thing that makes it so unusual is I don't know and maybe there are other sports like this but particularly on freestyle for example when you're coming from the very very top of the mountain down to the bottom if you're the ninth person down the course the course is completely transfor because you're you're skiing generally for freestyle on virgin powder untouched thick snow um >> real snow >> real snow yeah so if you're and and if you're the first couple of people down and you you're trying to get lines for your line for your jumps your style your elegance If you're the first person down, you can fly off the edge of a cliff. You land in fresh stuff and then you can do a beautiful series of turns through that. If you're number six, three people have already landed there. That's wrecked. You're going to have to find another bit of the mountain to come down. You're going to have to cross their tracks, etc. Or if you watch Sylm Giant Solomon, it's true to you'll see that it is getting icier and icier and the cuts around the front are getting sharper and sharp. I guess something similar is the fact if you're playing test cricket that part of your calculation is the state of the pitch over 5 days and how it develops. Um but no, that's a good point. But whenever we've talked about sport before, you said basically said you've got no interest in sport because you you think it's almost like you don't think that you're doing sport, you're doing skiing. Sport to me is watching people in competition. >> Yeah, I I mean I I'm happy if I'm having lunch in a in a bar to watch people ski. I love to watch and I'm learning from them and basically I watch it in order to learn technique. I'm interested in learning because I'm interested in their angulation. I'm interested in their weight transfer. >> We're going to um the Munich Security Conference for the weekend. The ski slope is not that far away. >> I would indeed be doing that. >> Well, we got to get a film of this. If you you said I will quote what you said. You said I'm really quite good at it. >> I can give you a shot of me skiing in Antarctica if you want. >> Oh, >> yeah. You can see me skiing on the South Pole. Yeah. >> Excellent. Talking of polls, I've got three plugs. The first is about polls is a while you were doing whatever you were doing yesterday, I recorded a miniseries with the guy whose book I mentioned about the Arctic. It's really, really interesting. I think the first episode's out on Friday. >> Great. >> Guy called Kenneth R. Rosen. Very interesting, very quirky character. Really good. Really enjoyed it doing it. Learned a lot. Hope our listeners and viewers will learn a lot. Second plug is the current leading >> Jeremy Fleming GCHQ. Third plug, Rory. >> Have you got Shashan Valentine's Day card yet? >> Oh, no. Have you got a good recommendation on there? >> Well, apparently, >> yeah, >> you can get you can buy trip plus membership. >> No. >> As a Valentine's present, you just go to the restispolitics.com and click gifts. And this is a perfect present for the woman who stopped me on the tube yesterday said, \"My boyfriend loves your podcast.\" So I get him the bloody membership. >> Do you know where you and I are spending Valentine's Day? >> The Munich Security Conference. >> Where is this going? >> Yeah. >> Yeah. >> Exactly. >> Yeah. That's where we're going to be. Yeah. >> Yeah. It's going to our romantic our romantic moment. The Munich Security Conference. Nothing quite as romantic as the Munich. I wonder whether the Munich Security Conference is going to have weird sort of German chocolates with flowers on. I bet they will. I bet they will. Anyway, let's take a break and then there's some cultural plugging I'd like to do after the break, too. >> Excellent. We have to do Big Bunny. Okay, great. See you after the break. >> See you soon. >> Now, just a quick pause in the podcast to mention our sponsor, NordVPN. >> So, February is when routines take over. We drift back into doing serious things online, but in places that are convenient rather than careful. Stations, cafes, hotels, moments where the margin for error with your data quietly creeps back in. >> That's exactly the gap NordVPN is designed to close. It hides your internet footprint, so when you're working or traveling on public networks, your information is not left exposed. >> NordVPN also includes Threat Protection Pro, which acts like a cyber bodyguard that quietly helps block malicious links and checks downloads. Particularly useful in February when inboxes fill up with expense claims, halftterm travel, and ticket confirmations. >> It doesn't change how you use the internet. It simply removes the assumption that everything is safe by default. One NordVPN account covers up to 10 devices. Or install it on your router and protect the whole household. >> To get the best discount on your NordVPN plan, go to nordvpn.com/restpolitics. You'll get four extra months free on the 2-year plan, plus a 30-day money back guarantee. The link is in the episode description. >> Welcome back to the Restless Politics question time with me, Rory Stewart, >> and me, Big Bunny. >> Yeah. Yeah. Well, that's right. As Alice has picked up, generally what he does, as you might have noticed, is mock me about my incredible ignorance of popular culture, but most of our listeners will be sniggering at the fact that he calls Bad Bunny Big Bunny. >> Listen, before we get on, let's get have the question cuz this was from Katherine in the whirl. What could polit bunny Super Bowl performance? His celebration of love, community, and joy stands in stark contrast to the divisiveness and negativity of name deleted and his allies whose responses to the show looked so pathetic and weak by comparison. >> Um, I watched Bad Bunny. Did you watch him? >> No, I watched a bit on the news. That's it. But I I've never got into NFL. >> It's pretty amazing. One of the weird things is if you watch it on YouTube and it's, you know, it's Apple Music sponsored uh uh Super Bowl. Um they don't offer anything other than Spanish subtitles unless you select the auto subtitle function. And so he's singing in Spanish. I mean, you can see why Trump was completely thrown off balance. I mean, firstly, the whole thing is in Spanish, so you've got no idea at all what he's saying, unless like me, you're trying to rely on the also stuff. Shashana, her Spanish is good, but she couldn't follow half these lyrics. 135 million viewers. It's one of the biggest Super Bowl half. Is >> that bigger than the rest is politics? >> Ever. It's bigger than rest. It's bigger than us. Bigger than us. Yeah, it's bigger than Bad Bunny is bigger than us. >> And and I don't I don't want to annoy any of the 135 million viewers, but to describe that song as purely a celebration of what was it? Community >> joy and love. >> Joy and love. Maybe this is a time turnoff for for younger listeners, but it's an extraordinary performance where he's spending most of his time clutching his crotch and rotating in front with an enormous number of surrounded by incredible Latino dancers, most of whom have got their skirts in the air. I mean, the I mean, it this is this is much more than just a celebration of community and community and world peace. >> The reviews I saw and heard, I heard a guy from Rolling Stone magazine saying it was the most mesmerizing live show he'd ever seen. And I I think I've seen all sorts of people. Um one of my fellow swimmers, Dan, he showed me he showed me a video this morning of I'm going to look at the script. Was it bad or big? I get the mixed up again. Bad buddy performing when all the backing music collapsed. All the electronic stuff collapsed. >> And it was honestly, it sounded like me at the bath. >> It was terrible. So, has he got a good voice or is it the wor is it like Eminem? Is it the words that are good? >> I think his voice is interesting, but I think it's the whole picture. It's the whole I think I mean it's it's about the songs are about celebrity. They're about girlfriends. They're about love. They're about Puerto Rico. They're about being a Latino. They're about the fact that other people want to be Latino, can't be Latino. I mean, it's a whole statement about culture >> and >> and about Puerto Rico. >> Yeah. And I'm going to break my promise now. Um, I mean, the thought of the president of the United States sitting watching in the Oval Office or wherever he was ready to say, \"This is terrible.\" Because the buildup, all the buildup I heard was this guy was really going to go for Trump because he's gone for ICE. He's said they're terrible. He's not true in the States cuz he's worried about Port >> and he seemingly didn't. >> He only thing he did is he said, \"God bless America.\" And then he listed all the countries America. I thought the joke was going to be he was going to go Ecuador, Paraguay, Costa Rica, and then jump to Canada. But actually, he included the United States in the whole thing. >> Right. But Trump then said, \"This is terrible. Nobody can understand a word.\" He says, \"How many Spanish speakers are there in the United States?\" That was revealing, wasn't it? Because that basically shows that he doesn't see them as being American. >> Well, and our research is wonderful research on Texas done by the producers, and not something sort of bolted into the back of my brain with a a weird memory stick. Um, and it was something beautifully covered actually on trip US yesterday. But our research has pointed out that in the Texas election, Taylor Refmed captured approximately 79% of the Hispanic vote in the district, a 26 point jump from the 53% that camel Harris received in the 2024 election. Precincts with majority Hispanic population swung an average of 34 points towards the Democrat >> compared with the Democrat's performance in 2022. So there is a real sense that Trump may be losing the Hispanic vote. The surprise in that election, Trump's defeat of Kla Harris, which made a huge marginal difference, was African-American voters and Hispanic voters voting for Trump. And that seems to be certainly with the Hispanic vote collapsing. And maybe this part of that story. >> No. And it seems really strange as we head to the midterms that you single out anybody who speaks Spanish is somehow being a non-American. So there are 70 million Hispanic Latinos in the United States. That's virtually the population of the United Kingdom. Um, and Donald Trump seems to think that because he doesn't like Big Bad Bunny, as he's going to be called forever, uh, that somehow he should be able to insult them and say they're not really American. >> Yeah. It's kind of It's kind of But it is extraordinary how successful he's been insulting huge bits of his demographic voter base again and again. >> Yeah. Okay, Roy. Uh, we both love trees. >> Yeah. >> So, this is from our friend Darren Moroft, CEO of the Woodland Trust. And by the way, let me say, you know, my that wonderful tree in Glasgow, the Argar Street ash, that was tree of the year. >> It's now in the poll for the European tree of the year. >> And you have you have to go online on vote. So go on to it's the European tree of the year. You can find it all on the the interweb with Big Bad Bunny and um but vote for Argal Street. So Darren says, Rory, this is specifically for you. As someone involved in creating the 25-year environment plan, do you share concerns it's become a largely deferra only project? Very good point. Why, despite growing evidence of nature's crossgovernment value, does the issue seem increasingly siloed? What does this reveal about how the government works and defer standing within it? And how would you fix it? >> Well, so Darren's right. When we were bringing together that 25-year environment plan, even though it was a Tory government, there was a moment of real cross party optimism around this. And actually, you know, I disagree profoundly with Michael Gove and I thought he went too far on some of the reeling stuff, but broadly speaking, there was a moment where we were working very strongly with environmental charities, with the national parks, with natural England, the environment agency to define a 25-year plan, which has largely been taken on uh by the new government and pushed ahead. But at the heart of it is nature or pompously biodiversity. Uh we talk a lot about climate which is completely critical but this is about the fact that we are losing species at an incredible rate. Many indicators suggesting 85% decline in various species. This idea of the anthroposine which is that basically humans are eliminating biodiversity around the planet and Britain particularly brutally affected. We have much less tree cover for example than most uh European countries most comparable countries. So there is a huge opportunity for us to lean into this. Um, and one of the things that's making me sad is if the government's looking for projects that can really have an impact and catch people's imagination and change perceptions, I want them to return again. And if Emma Reynolds is listening, I'm going to push this again on her. Not just thinking about farming and people who look after the landscape, particularly small farmers who I think are being marginalized, but also trees. So for example, I want to push again this idea that I think the green belt around London could become the largest forest in England could be and and I mean a native forest. I mean oaks, I mean biodiversity. It will be great for the weather in London. It'll be great for air quality. It'll be great for climate change because the carbon capture. It'll be great for the populations, millions of people getting into nature. But most importantly of all, it'll be something that will be there for future generations. Some of the oaks trees will still be there in 4 500 years time. So imagine if you're K star or Reynolds, what a wonderful legacy that would be to in 20 years time find yourself in this incredible forest of hundreds of millions of trees with all the transformation of biodiversity >> and and Darren's point about silos is absolutely right. If you think about what nature, the role that nature could play in our health policy, social prescribing, one of the things I love about whenever Fiona and I are taking the dog out in the morning, there are these tiny kids who are all being sort of led up by teachers who are who are learning as part of their education is about just sort of living on the heath for a day. So there's there's a this um I've pitched already this uh documentary is just out on Amazon on the king on harmony. But one of the points that's made there by uh a professor at Cambridge is that on your social prescribing point when you go out into woodland you're literally breathing in molecules from these trees. When you're smelling pine trees you're taking the pine molecules into your bloodstream. And some of these molecules have impacts similar in impact to almost prescription drugs. There's also data that shows that every 300 m further away you are from a piece of green space in a city, your health and your general indicators decline dramatically. So >> green spaces absolutely is I mean the way that cities uh are developed is fundamental to this. >> Okay. And you are a parent of young children in London. Everybody will presumably go through what I went through on Saturday, which is what the hell do I do with the kids on the weekend, right? And there's a limit to how much you can shle around the zoo or go to the museum. Imagine if you could get on a train from central London and be immediately in the middle of one of the greatest forests on Earth. And there is the green belt. Nobody's using it. It's a sort of horrible post-industrial golf course zone that nobody can build houses on because of legislation, but nobody's making it work for nature. M although we should say we're pretty blessed with parks and >> and trees and nature given that it's one of the biggest tribut how well we do with that but but what we don't have um are really lovely natural forest spaces. I mean imagine how wonderful it would be to be able to walk for 20 miles through an incredible native forest. >> Yeah. >> Just on the outskirts of London. >> Yeah. With the planes going over. It's that story of the the American couple arriving at Heathro. The pilot says, \"If you look out of the window, you'll see Windrew Castle where the queen lives.\" And the wife turns to the husband says, \"Why she built a castle so near during an airport?\" Sorry. >> It's good. It's good. It's good. It's good. I like it. Good joke. Okay, here we are. Final one for you. Gareth Trip plus Cornwall. Is happiness a state of rebellion in a world in flux and with so many existential threats from the likes of Trump? I'd be interested in hearing Alistister and Rory's advice on how they navigate all of this and keep sane and positive. And Thomas, what do you do outside of politics that gives you hope and joy? >> Ah, well, funny enough, allows me to plug one of my 21 books, The Happy Depressive. >> Oh. >> Uh, that's a great title. Um, and it's a book about how well it's first of all, how do you think about happiness? Cuz I think one of the reasons we're in such a mess as a world is we're completely confused about what we mean by happiness. >> Okay, what do we mean? >> Well, what I mean by happiness is kind of long-term fulfillment. I think what a lot of people think happiness is is feeling good in the moment. Uh, I actually think that the feeling bad in the moment is often for me the the spur or the inspiration to to then do the pursuit of stuff that leads to the long-term fulfillment where I think you find >> So you're saying it's not really about the minuteby-minute pleasure. It's the sense of a longer project, a bigger activity. >> Totally. Totally. I I think that and and I think along the way you we all have lots of really bad moments, lots of low moments, lots of setback and lots of failure and it's how you use them to build the stuff that at the end of your life you look back and think well that that really matters. So I think that sense of and and that's why I I've said to you before I think we we we think that having a good time and particularly in this country where it seems to me having a good time is so often associated with basically changing your natural state Yeah. through drink or drugs. >> How is how can that possibly really be what the pursuit of happiness is about? To me, that is usually the escape from unhappiness. >> So, and then and and what I went did the book, not less that book, because that was a sort of that was actually a speech that became a book. But then the other book I wrote about my own depression, I was an absolute exploration of how do you find happiness even when you're depressed? >> Well, here here's a couple of things that I was thinking about this week. Um, one is I I went for a run yesterday with Shashana uh down to an exhibition that she's just done in the she >> uh we weren't racing. We were we were sort of doing a sort of plotting couples jog together. >> Um uh back against you. >> Although I'm all kitted out with wearables at the moment. So I'm sort of endlessly following my sort of micro heart rate variations and stuff. >> Pointless >> pointless stuff. Um and we got to the garrison chapel where Shashana and Turquoise Mountain are doing this amazing exhibition open to the public. Please anyone who's coming through London have a look at it. And what it's showing is all the work of crafts people particularly women making incredibly beautiful things in Afghanistan, in Myanmar, in Palestine and in other countries around the world. Um and I loved that because I I I was trying to work out why I felt happy in the evening. But I thought were two things. I mean one of them is yes I was changing my state with my endorphins. Um but secondly it was the sense of being able to help in a small way with her exhibition talk about speech and see all this beautiful stuff. Now the second thing though which is completely the other end. I went to see Hamlet over the weekend. Have you seen Hamlet? >> I have. Hamnet. >> Yeah. Hamnet. >> Yeah. I'm interested in your review. I'll give you mine. Well, basically, uh, as the parent of a young boy, I was in bits through most of it. I mean, I just couldn't handle the grief and the horror of this young boy dying, >> but I also felt it was very, very powerful. I felt a real sense of catharsis. I felt a sense of in a way that I very rarely do, you know. I mean Aristotle says you go to the theater and your go through this cathosis and your whole world views change. I did feel that with that film. I found it devastating. I was crying all the time but I came out the end of it >> really feeling yeah that they had made a really incredible point about and one thing you should be able to relate to I thought is the extraordinary sense that William Shakespeare who's the central character is saying to his wife yes our kids got has just died but I'm going back to work in London. I've got to write my play. >> Yeah. Yeah. >> And she's like, \"No, you effing aunt. You're not you're not leaving me with a dead kid.\" And all your sympathy is with her. You think it doesn't matter what your job is. >> Don't abandon your family like this. And then you have to get to terms with But on the other hand, his job is being the greatest playwright that's ever lived and he's writing the greatest play that's ever lived. And what the film I thought did at the end is balance those two things that as it were the tensions of work and life. You see, I I that's really interesting. When I went to see Oh Mary, >> okay, >> which is on just down the road here at the moment, which is about once you get into it, it's very funny, >> right? >> It's about Abraham Lincoln being this sex starved gay sort of it's it's not based on the I don't think the real Abraham Lincoln and the wife is alcoholic, mad, demanding, crazy. It's a it's a crazy sort of play. And I spent the first half hour really not enjoying it because I think this is so not Abraham Lincoln. It really offends me. And I felt that a little bit about about Hamnut. I couldn't quite get my head around the fact that Shakespeare, who I regularly think is the greatest person who ever lived because of what he's what he contributed to the world and still does. And by the way, if people haven't seen it, Ian Mckllen on the Steven Colbert show last week doing this amazing piece of Shakespeare anyway, which is about what's happening in America now. We'll put it in the newsletter. Um, so I got really irritated by it. I then got really irritated by some of the production stuff, the end when they're all that sort of the the the focus on on the wife and the and the the sort of dreamy bits and what have you. I thought it as a film I thought it was rescued by the performance of The Sun, >> right? >> Who I thought was brilliant, but I wasn't as moved by it as you were. Maybe it's because your kids are so young. I don't know. >> I I I I was a bit cross with my mother because she told me to go and see it and I was like, where is the health warning? How can you possibly expect a parent of an 8-year-old to watch a whole film about an 8-year-old dying? >> Yeah. See, I I a part of me couldn't imagine that Shakespeare could have been quite as harsh and cruel and self-centered, but maybe he was. And that's the other thing I think with these when you're dealing with historical figures, the truth is we don't know. We know a lot. There's the one of the most amazing things about Shakespeare is actually beyond what he's written, we don't know that much. It's not like it's not like >> Well, it's amazing. Have you have you read for example Shakespeare and Silver Street where they take a single >> uh two sentences Shakespeare's only recorded words are in a small court case in London which was then discovered in the 19th century in an archive. But you're absolutely right. I mean that that film is based on uh Anus Hathaway or or an and uh the one of the questions around her is based purely on his will. He leaves her his second best bed >> and there's birth certificate or death certificate stuff and we have some idea about how many children they had and we know that Hamlet died and out of that Maggie Farrell has created this incredible masterpiece. But yes, certainly if you were doing the rest is history. It's astonishing given his stature today how little was recorded about him. >> I think that's part of the reason why he's so it's not just that he's an amazing writer and brain. And I think it's also that he's that allows itself to mythology. Um anyway, I'm glad you found it moving because that's two things we've learned today, Roy, because normally I say I'm the one who gets terribly moved by, you know, the music and culture that you've been moved by that. And then and we've also learned that you're an Olympic quality skier. Maybe this is a really good thing to close with. I This made me This made me really happy this week. It's a It's a message from one of our readers. Okay. She's called Saraphina Jennings and she says, \"Dear Alistister, my name is Saraphina. I'm 17 years old. I'm a regular listener of Trip. Politics is a huge interest of mine. And after watching your recent episode, this is my monologue when I was sort of bearing my soul about all this recent stuff in the well, not mentioning Labour, but you know what I'm talking about. She said, \"I can't help but want to reach out and offer reassurance. As a Gen Z, there is no one better suited to talk about reactionary politics. Most people my age get their knowledge from Tik Tok. And as an avid Tik Tok user, I haven't seen this far-right domination of the app. Every politics video I watch denounces Farage. For every video which supports him, there are thousand comments educating people of the nastier policies reform would implement. And it's not just my algorithm. I went out and made fresh accounts where I don't interact with anything political. And the first videos to do with current affairs were leftwing, proabortion, anti-Trump, anti-reform, not to mention millions and millions and millions of pure disgust at Trump and Epstein. I urge you to look at the Democrats Tik Tok page. It brings me a lot of hope for the future. As for the image of New Labor, she goes on after the Mandlesson revelations. Can I just say most people my age hadn't heard of Peter Mandles until last week? We cover the Blair Brown governments in history. He actually isn't mentioned. And from what I can gather, even in A-level politics, plays a very insignificant role. Tony Blair is often credited amongst you young people and in the many conversations I have as a great prime minister. We've grown up with no memory of new labor, but the stories of non-existent waiting list, massive education in child poverty, etc., etc., etc. Finally, you'll be pleased to know Brexit is treated as the biggest sin of our time among young people. repeatedly videos anti-rexit surpassed 100,000 likes denouncing it as the biggest failure we have seen. So she goes on, she says, \"This is probably a stupid thing to write to you. I just wanted to make it transparent. There is a future. I genuinely believe humanity will always prevail over hatred and lies. Please don't lose hope.\" So Saraphina, that made me happy this week. >> That was wonderful. It's wonderful. I will restrain uh myself from >> go on be cynical >> a massive series of pro Tory skeptical comments about the whole >> Saraphina austerity was the right thing to do says Rory Stewart >> exactly yeah was all this exactly no I I love the lovely stuff um well thank you and uh look forward to hearing what viewers made of Hamnet whether they're you're on your side or mine >> I think they'll be on your side I think I was probably in a bad mood I went to see it as escaping from the thing that I'm not talking about and it didn't lift my mood. >> And and I'd also love if anyone makes it to Garrison Chapel, see what they think about what all these artisans with Tqu Mountain other. >> Absolutely. And by the way, if you want to if you're not a member and you want to listen to the miniseries on the polar war in the Arctic, then just go to the restispolitics.com and sign up after you've got your Valentine's Day gift. >> Brilliant. Okay, bye-bye. >> See you soon. Bye-bye. This episode was brought to you by Penguin Audio books. There are audio book club parts. Very I love Penguin audio books partly because I'm a Penguin audio book person. Selecting the titles that help us think clearly about where the world is heading, what's at stake when power and technology move faster than politics. >> And a book that we are recommending to all of you. If anyone builds it, everyone dies. >> It's written by Lisa Yudkowski and by Nate Source. Um, it is a really fascinating lesson and and if you want to see the extreme case for fear around AI, this is a book arguing why AI could potentially kill us. And he does it in the style of really good popular science. He's also very very good on explaining how in some ways these large language models are evolutionary. They're sort of natural bodies that are developing rather than things that are fully programmed like old models. He was right at the heart of the AI revolution. He's very controversial. There will be people, and you'll see this in the miniseries, who are horrified that we're recommending it. But I think listen to it. >> Visit penguin.co.uk/tip to browse our audiobook club and find the link to listen to if anyone builds it, everyone dies in our bio. Find Penguin audio books now on"
    }
  ]
}