{
  "category": "betting",
  "scraped_at": "2026-02-20T13:50:40.329140+00:00",
  "days_back": 14,
  "video_count": 6,
  "transcript_count": 6,
  "videos": [
    {
      "id": "LaUoZF_HqbU",
      "title": "'Majborough Should Be Shorter' - Champion Chase Ante-Post Preview",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-19T16:18:48+00:00",
      "transcript": "We're going to head to the champion chase. Our first one of our Antipost previews this week. Just a quick look at the betting before we bring in Matt Majbra 3.0 favorite to Marie National. Last year's winner 3.5 or 5-2 8 to1 or 9.0 on Illette. Tom 9.8 Lud and Kixios is 19.5 around 30.0 and bigger the rest. So yeah, Matt, that sets us up. I had a quick look at the entries. Are we looking at 12 13 runners or where are you what are you working off that basis before you hit us with your trends and then your thoughts on each price? >> Uh I was thinking more high single figures um for entries. uh trend is that the shortest second season chaser in the SP market 11 from 25 this century 105% profit and I'm glad you read those prices out Daniel to give context to this because this is what I call a prejudice market by which I mean that punters prejudices are playing a bigger part than usual in forming the market and actual form slightly less prejudices biases you know they're part of every market but there seems to be a collective belief that there's a strong chance that either Masbra blows or marine national improves out of all recognition from the Dublin Chase. Now, I have no stats on this, but it must be a rarity to have a market for a championship race where the two main protagonists clashed at levels last time. One beat the other one by 19 lengths fair and square and they're this close in the antipost markets 3.0 3.5. You know, double chase form alone mably about 1.4. Now, he left behind two disappointing efforts at DRF. But it's not as if he's got a book of top class work. Um, I covered some of this in more detail in my article that's on the matchbook insights page, but I think he badly needed the run in the hilly way, not just coming on for it as would normally be the case. He only ran at Christmas, which is very unlike Willie with the 20-day gap just to get more practice in. So, the combination of cheap pieces and 14 tactics of course was a big part in improvement, but I do think it was the first time he'd been really fit. So, what can Marine National do? He should improve for better ground. I think a drop back in trip will help. I think Barry Connell looks like he's proving a trainer who really does do well at peing his horses at Chelenham. It's another plus. The ground wasn't that bad on the chase track at DRF. Only 11 seconds above standard time and they went an even gallop. You not as if it was a swamp and so you should be putting a line through Marine National's run. He won a supreme royal bond on similar ground. So he should get closer at Chelton. But can you see him making up 19 lengths if Masha runs his race? I so typically there are only three or four with a realistic chance in an average championship. Shocks are rare. 21 of the 25 renewals this cent gone to the front three in the market but it is generally such a test of jumping at that eyes out gallop. It's an unpredictable race between those three four five who have a realistic chance and 10 of the 13 odds on odd shots this century have been beaten. But MBA was not odds on you know he's nearly about 3.0. So, he's the most talented horse in the race. He's just put in a fantastic performance. Yet, that's the sort of price you can back him in. Yet, he's got to get into a jumping rhythm in the early part of the race, more jumping at Chelenham in the the first half mile or so. You'd also hope Mark Walsh doesn't do the sort of repeat of the left hand down tactic that he did as they came into the straight in the Arle because you got that trappy second last fence that comes up very quickly. But, he's much the most likely winner. Um there's a case for saying it should be odds on. So I keep it simple and back the best horse. If you want to back at a bit of a bigger price, I'd take on both I Tom and Lo's got a bad record at the festival and it took an exhausted looking fall last time. That's a terrible prep. The last horse to win after falling at any run early in the season was Martha's son in 1997. And loders I think the the freshness factor is being overplayed. Yeah, last year he was impressive in the November then backed it up by running to a one pound higher mark on RPRs in the Henry VI at Sandown. Yet this season when he was thrashed 18 lengths by Tom Pating Creek just apparently should be ignored because it came too soon. I just don't think he's good enough. He likes Shelton his best fresh but his only piece of form giving him a chance is the schlower and I think John Bomb was never going. So I take those two on and at a bigger price I give a word to my old friend Quilixios. I only have it as 6040 in Marine National's favor. Um, re-watching the race where they came down to last year. He is a really good horse. He hasn't run since, but he's a excellent record fresh, including beating Marine National by seven and a half lengths, giving him four pound on their seasonal debuts last season. Had a bit of a chasing experience advantage there, but even so, it was a very good performance. The vibes weren't brilliant in Henry's Racing Post Stable Tour this morning. And you would want to look at the vibes in the three weeks we've got left before the festival starts because Henry's winners off moderate preps are often heavily punted in the last week or so. Yeah, both Bob Olinger and Manila Indo 21.0 week before the festival. One stairs at 9.0 and the Gold Cup at 10.0 respectively. So keep an eye out for the Quilixios vibes. He might be one for momentum punters. If you opt for one at a big price, but the prices to me, Masma looks far too big. I think barring accidents, he'll win easily. >> Okay, before I move on to Don, so when you have a bet where you think genuinely, you could be odds on. Now, I don't know exactly if you if you'd go as far as that, if you were making the book math, for example, but 3.0, you'd obviously just go a little bit under what what all the other firms are at, for example. So, that's my first question. How can you when the market's completely disagreeing with you basically, do you always are you a little bit wary that you might be missing something? And the second thing is if management somehow managed to sneak that article and win it, would we be seeing 3.0 in front of us or do people associate because he didn't manage to get back up and win despite those two mistakes that you know he could be vulnerable over fences at Chapman? >> Yeah, two good questions. The first one, yeah, I'm always looking for reasons I've missed something. So, for example, I rewatch a lot of races. can't watch a race once. Um, particularly if you had a better because you be watching one specific horse. Uh, and what I tend to do is if there's a horse I'm really positive about, I try and rew watch the race looking for things to be negative about and and vice versa. So, yeah, that's definitely it. And the record of odds on shots, 10 of the 13 this century have been beaten in a champion chase. You've got to factor that in. Um, but I I think the the Arle was I don't think it was a an ideal piece of race riding riding him right down the inside there because he's a bit slow to react to things. Um, and he came up against that second last fence and just made a complete mess of it. And as you said, he won easily otherwise, but he has made mistakes and and looked a bit tricky on other occasions. It's not just a one-off. And that's what a lot of people are saying. The reason he's such a big price is people know, well, the cheap pieces, yeah, they've worked once, will they work again? He's put in one brilliant performance, but some average ones, so you can't rely on him. And and that has to be part of his price. Um, so I I personally I wouldn't have him odds on with all that. I would have him slightly odds against, but maybe if I was pricing it up, and I've not done a book, but it'd be something about 2.2. So I certainly think at 3.0 he's good value. Yeah, Don, I don't know what you're going to go for here, but um good luck to you if you're taking on management after that case. But >> yeah, I like I haven't had a bet in the race yet. Um and I'm finding it hard to get an angle into the race. My my my I suppose default position is to look for something to take on the top two. Um because obviously they taken out a massive a massive percentage of the market between them, but I can't find it. Um but look, yeah, like I'm I'm a fan of both horses. Majbor was brilliant the last day. I thought that his his jumping to his left would bring him on to the worst to the ground. Two things happened to negate that. A he didn't jump to his left in his cheek pieces for the first time. He was very straight, which was great to see, and B the the track seemed to be quite uniform throughout the chase track. There was there didn't seem to be a great advantage to be to to be deemed from going wide, but it was to me it was one of the performances of the season so far. He was brilliant and as Matt said, he beat Marine National by 19 lengths. How can Marine National bridge that gap? Maj's jumping on the race IQ jump index. He he gained over 16 lengths. Marine National gained or sorry lost over four lengths. So if he can jump on a par with manage bread through Chelnham, which there's every chance he will be able to do that given that he's back at Chelton where he's two for two, he's a supreme hurdle winner and a champion chase winner. Um there's every chance that he'll at least close that gap a little bit. Um, I think the better ground will have marine national. I think he's, as Matt was saying, Barry Collins horses just seem to, you know, it's a small, it's small sample size that we have. He's a small yard, but they seem to really zing at Chelton double there the other day as well. Um, so all of you're kind of looking for reasons why Marine National might bridge the gap. Um, that said, Maj is only six. Now, he's nine years old, but he's only had nine runs over fences, so I wouldn't hold his age or or his depth of experience against him. Um, it's probably a positive actually, but Major, he's the triumphal winner. He ran a massive race in the ARA last year. He like he he actually made a mistake at the fourth last fence as well, which we kind of, you know, we're we all we hone in on in the second last, but he made a mistake at the fourth last as well. made that terrible mistake at the second last. Wasn't good at the last either and still was only beaten through parts of a length by Django Bay. So, um, look, he's he's he's got a serious engine and yeah, he's he's a Chelton horse as well. So, to me, he's he's he's a rockolid favorite. I think Marine Nol will get closer to him than he did at Leopard Stan. But whether he can bridge all of the all of the 19 lengths and a little bit more in order to go and win it, I'm not sure. Um, but I I'm really looking forward to the race. I probably won't have a bet in it. Agree with Madam Ludas. I just don't think he's that class. Elle T like whenever when he won the Tingle Creek and every and he was put in his favor for the Champion Chase shortly thereafter, I was I was I was against him then. Um thinking that he could be taken out a lot of the market, but because at Chelton he just hasn't been able to do it at Chelton for whatever reason. Um then he got he obviously got beaten last time in the Clarence House chase and now he's out to probably his correct price. So he deserves his chance in the race, but I just can't see him beating Marine National or Majbra. Um, Kixius, yeah, fair case that Matt's made for Kixio. He could run well at a price. He was upsized Marine National at the last fence. I think Marine National would have beaten him and beaten him pretty well anyway. Um, just the strength with which he went to the line. But look, Kixios, he's he's a player in the race and he's a Chelton horse as well. He's a he's a trial winner as well as running that big race in the champion chase last last year. Interesting that Irish Panthers still in here, he's probably going to go for the Arkle. But they did give him an entry in the champion chase as well. So if it cuts up a lot, then you wouldn't if there were going to be three or four or five runners that Irish Panther could take his chance, but I think he's going to go for the Arkle anyway. Um, but no, I I can't find a betting angle into the race. I agree with with Matt that Mars should probably be further ahead of Marine National in the market than he is. Um, and if Marine National were to drift and if that kind of school of thought starts to gain traction, then maybe Marine National would become a bet at at a bigger price. But at the prices at the moment, yeah, I find it hard to find an angle. >> Yeah, maybe Matt, follow you. What odds do the top two go off SP? >> Uh, I would say about six to four and about 11 to four, I thought. >> Okay. And then Don Don's back in Marine National 11 to four. Do you foresee that around the SPS or No, no, you need bigger. >> No, I I look at if they if they bet six to four and 11 to four. I think probably Mford is maybe overpriced at 6 to4 more than Mars is 11 to four. I think maybe closer to the time they might come for Mer, he could go off closer to 2.0 and maybe Marine would drift out to >> 4.5 or 5.0. >> Yeah, maybe. Although Marine National has his supporters and you know that counts for a lot in in Ben because it is ultimately down to the money that comes in. So um yeah, fascinating >> Mark depend on how Willie Mullins has done to that point. >> Yeah. Well, that Irish pan before Yeah, I wouldn't be surprised if he ran the champion chase because I don't think he's going to win the art. So maybe I know I listen to an easier race than the Arle. >> Definitely not. Definitely not. But third in a champion chase is more glory I guess than third in he will obviously be short of price for the art. We'll see. >> Yeah. And he's >> Yeah, that's true."
    },
    {
      "id": "ZoNGhvh-fqk",
      "title": "Cheltenham Trail Ep 12: Jonbon | Champion Chase & Brown Advisory Ante-Post Preview",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-17T13:24:45+00:00",
      "transcript": "You're very welcome along to the Matchbook Trail. We have three weeks to go to the Chatland Festival. It is getting to that time of year. I'm your host, Daniel Hussy. Delighted to welcome Matt Tombs and Dom. We've been at this since November, but we're getting there. And we're every single week we cover the weekend in review eye catcher section, but now leading up to the festival. We're going to do two races this week focused on the Brown Advisory and the Champion Chase. So, looking forward to getting into the teeth of it with Matt Tombs and Dom. As I said before we get going, a quick reminder into a brand new Chatam offer. It is our most generous offer out there and it's it's available right up to the Chatam Festival. So if you haven't got a matchbook account and you'd like to set up one ahead of the festival, just enter the bonus code pod 50 POD 100 and you can see the full T's and C's there about£50 essentially get 100 pound worth in free bets. It's all the T's and C's are available on screen there now. Just enter the bonus code P O D 100. Um yeah guys, we're going to run through the weekend review and we'll get into Chat and talk later in the show. You scan can skip ahead. We will clip out the separate races on YouTube as well if you just want the focus on the antipost preview. But we'll start with the Ask Chase. Matt, hit us with your trend and your thoughts on the race because it was a great race on its own for John Bond to win, but it felt like his chairman credentials almost took a hit off the back of it just based on the commentary. What was your assessment of the race? >> Yeah, I agree. a fantastic advert for the game. Then the training skills of Nikki Henderson and Paul Nichols, two veterans fighting out the finish of this grade one. Be interesting to see about Chelham. I I personally, and we'll get on to it in a minute, will bypass Chel trends wise. First nine Ryan runners um four from 19, 49% profit, but in the last 12 renewals, they're not from 15. and only Frodon and Protectorat have won for Britain in the last 10 renewals after British yards have won the first 11. So it's a classic race where the power shift westwards across the Irish Sea in recent years has impacted how good a trial it is and only three of the last 10 minutes winners have even gone to the festival rather than go to the Meling Chase instead. Now John Bon had a pretty hard race in the Clarence House four weeks earlier. I was keeping an eye on the markets, but he was really strong in the betting and he looked in trouble coming into the straight. But what really caught the eye was how he looked to win this through stamina, not speed. It was truly run 101% finishing speed. If you've never seen him before, you'd be saying he might improve for going up in trip beyond the two mile five here. So that question you ra what do you do with him now? He showed last year he could back up one hard race quickly in the champion chase by then William the Melon. But when asked to back up a second time, three weeks later, he was flat in the celebration. So having had two hard races, maybe it'd be going to the well once too often with just a 26 day break to the Ryan Air. A lot would depend on what happens with Factor File, of course. I'd imagine that the Meling Chase would be the best target. He's never been at his best at Chelenham. I give the bowl some consideration, too. If there's a sound surface, it's another four furongs, but it's a fast track. He might well get it. He might even improve for it. It was an 11th grade one win over fences, 12th in all, been a fantastic servant to connections and so did Pit Dory. This was his ninth season in training. He won in seven of the previous eight. Jumping got a bit scrappy mid race, but he still ran really well. I thought he was going to win early on in the straight, but although he's 11, he's has looked as good as ever this season. Paul Nichols rightly talking about keeping him in training next season. Why would you retire him when he's still at his peak? He hasn't run at Chelton since the triumph seven years ago. So he'll go on to a tree again where it had the melling or the bowl as feasible options. So I doubt the ascet chase is going to have too much of an impact on Chelton this year but it was a cracking race to watch. >> Okay. Yeah. Don would you concur with a lot of that? I mean the race itself as we said was a great race but looking at the Chattton Festival which this show does you know maybe John Bon perhaps might not even go to the festival according to >> Yeah I I I wouldn't disagree with that at all. And look what a race and brilliant to watch it because it kind of eb and flowed going to the third lass. It looked like John Bond was traveling all over Ptorii and then running around the home turn when Harry Cobden just kind of gave Ptori a little bit of a squeeze. Nicwell had to get more serious in John Bon and for a for a few stries it looked like he might not get him. Um neither was was good at the third last. Neither was good at the last either, but by then John Bon just seemed to be getting the upper hand and he just needed to jump the last fence. No worse than Pictor did and he did that and like what what a horse John Bon is. He's had now 27 runs. He's won 20 times, finished his second seven times. That's some record. Never been out of the first two given the level of competition at which he's competed. Um but no, like it's uh he's just I I fully agree with what Matt said there about skipping Charlton. He's had those two hard races. He's never had his best at Chelenham. Five of his of his seven defeats have been at Chelenham. And going back over Racing Post ratings, the his best run at Chelnham is the joint eighth best of his career according to Racing Post ratings. So, you know, we we we and it's kind of been said that like for a for a while his seconds were at Chelenham, but I think it's kind of the proof is probably there. you know, we probably I think it's safe enough to conclude that he's not at his best at Shelton. He's not as good there as he is at definitely at last or entry and Sandown as well, even though he's been beaten twice at Sandown as well. Now, he's finished second twice at Sandown. Um, but yeah, bring him bring him to entry, go back to the Melon Chase. Um, and yeah, he's had he's had four runs this season, but the last two runs were were hard runs. So I I think I wouldn't be surprised at all to see him going to the melon chase or even as Matt was saying stepping up in trip because this is 2 miles five and and run at a strong pace finish speed of 101% according to race IQ. So, and he saw it out well. He won it through grit and stamina. He outstayed Pori. So, yeah, like e either he'd be very interesting stepped up even to three miles and three miles in the furong for the bull. Pori likewise an 11 year old now. Um and he's he he won a melon chase as well. He beat Faker Dares in the melon chase in 2023. He's been he's run three times today at entry. Pulled up in the other two races including behind John Bon in the me chase 2024. Um he's only had that one run at Sandan as Matt alluded to. He was only he was 10th in the time hurdle or at at Chelnham. Uh so again wouldn't be surprising to see him skip that again. He would be interesting in a bowl like he he stays well. He's only had one run over three miles. That was in the Charlie Hall chase earlier this season when he finished second behind Jello. So I'm sure this was his Gold Cup. I'm sure Paul Nichols had him train to the minute for this given his record in the race. He's now won it twice and finished second in the race twice. Um, but if he were, I'm sure injury is the plan with him now, but I wouldn't mind seeing him stepping up and trip. He's an 11 year old now, but he's only, you know, if a if a if an 11-year-old can be unexposed at a trip, he's still probably unexposed over three miles. So, yeah, I wouldn't mind seeing him stepping up and trip and take it in the poll. But, uh, yeah, brilliant horse race. Apparently, there were plenty of people at that Scott on Saturday and they they got a treat from this race. >> Yeah. And John Bond's just what a horse in fairness like um for all the hype he lived up to he's lived up to isn't he in fairness to him. Don we'll stick with you for the Redm Mills chasing and another horse that's you know big name horse I would say in Perry Pass. I mean firstly this was a very cool ride from Paul Town. I thought um he knew he was on the best horse as he said after the race and well thank god he did. I guess >> it it really was a cool ride. Like obviously Paul felt the the energy that he had on under him and he didn't he didn't go for a par pass until quite late in the piece. Um it's his first run since he was brought down in the duly insurance office chase over three miles at Punchestown back in April or May. Um Lucky Watson actually stable companion was brought down at the first fence in the home straight but great to see him back. It was only a four- horse race. They went no gallop at all. Finished speed of 123%. So it tells you a the the the sedateness of the gallop and b the speed that Empire pass had to show in order to pick up and and and and get the better of Sapphire because when Sapphire went down, he looked he looked set for for home. And it's a funny angle at Goran Park. I wasn't there, but watching the TV pictures on racing TV, you could see Sapphire go down to the last and he jumped it. You were kind of expecting him paria pass to be nearly upsized, but he wasn't. He was about a length and a half behind him and it was only then really that Paul Talon gave him a squeeze and he wasn't on the best part of the track either. He had to go towards the far side in order to make his ground. But no, it was a really impressive performance by Empire Pass. He won the manifesto chase last year. He beat Gidley Park in that and Django Bay. That was a big performance. Um he's only run once at Chelton. He won the Bearing Bingham in 2023. He beat big Gaic Warrior in that. But he's kind of he skipped Chelton in 2024. He went and won the entry hurdle. remember that race in which he got the better of Bob Aller and Langanger Dan that three-way go to the line and yeah like he's he's got a a hurdles mark 163 which is I think higher than his new chase mark even is 157 going into the race I think he's 160 now over fences but it tells you he's just top class over hurdles and fences so yeah it's going to be very interesting to see where he goes he's only had six runs over fences so he's still a relatively lightly raced horse and he was sent off a long odds on shot here but no it was it was a really nice performance performance. Yeah, super rider Paul Tannon who went four for four on the day at Goran Park. Um so yeah, it's going to be interesting to see if Empire pass does go to Chelham. He's got obviously the Ryan air chase will be the race for him or if he skips it again and goes on to entry. Saf safer who finished second. He's a better chaser than Hurdler. He's his his chase mark is I think 17 pounds higher than his hurdles mark and it looked like he was going to go on and and get get another win on the board. His last win was in the Fox Rock Handicap chase at Navan in December last season. So, but he he ran his race as well. And Classic Getaway finished third. He he led from early. He had the run of the race. He's 10 years old now. Um he won this race last year, beat San Sam and Journey with me in the race last year. And he goes well at Goran Park and I just he just just didn't have the class or the pace to cope with that par pass. But yeah, and Buddy won. Interested in Paul Paul Gilligan saying that um he could go on to the Carl Cup at Chelenham and maybe onto the Grand National after that. He's he's got an entry in the Grand National. Um I think he's still a better hurdler than Chaser. His rating tells you that he's he's a better hurdler than Chaser and I yeah like the the Carl Cop that would be an interesting an interesting project for him. He finished third behind Aoko in the Martin Pipe Hurdle in 2023. He finished fourth in the Sarah's hurdle, fifth in the Sarah Hurdle last year, and maybe drop him back into handicap company pieces on here for the first time. Um, that would be interesting for him. So, maybe keep a little eye on he won, but of of all of them, obviously in Paris, he's the most exciting one time to see where he goes next. >> Yeah, Matt will have the stats on the Carl Cup Grand National double. Um, I'm sure there's a few horses there. Um yeah, your thoughts on this, Matt? And a trend as well, which obviously because Redmill's uh chase is just so close to Chelum invariably, even if horses do attempt to run the Chon festival, it doesn't always go great. >> Yeah, that's right. Runners one from 36 this century for exactly the reason you say, Daniel, the Grand National. Now, the there is a bit of a theory that you want a moderate jumper of park fences because they can if they hit the top of those, they have that trajectory. They go through the Grand National fences. Um you think about Iron Maximus and Tiger Roll and Vanilia and those sorts of horses. So perhaps Buddy one is the right sort for it. It's an interesting idea. Imper echo what Don said and for me he's always been a speed horse. The Mullins camp have been trying to turn him into a stayer. You look at his form he's thrashed Gaelic warrior and a typically steadily run bearing. Bingham beaten only three lengths over state man the December herd at least two seasons ago and he's never been given the chance to run over two miles over fences. I suspect intermediate trips probably suit him best now. He's got a bit lazy. Takes a while to get going, but he's got a real turn of foot when he does. Um, so as Don explained, Paul very cool on him. Um, didn't seem worried at all and he came up the the worst part of the track. Didn't have a hard race here. Maybe that was what Paul was aiming at because normally you'd be a bit worried seasonal debut and then only 26 days to the Ryan Air. But this year with four weeks between Chelton, he could do Ryan Air and then on to the Meling Chase, I would have thought. And it does put the the Ryan Air plans for the Clutton team up in the air a bit. I've been working on the basis that one of Factor and Gaelic Warrior would run and Willie would wait to see what JP wanted to do and then Gay Warrior would run in the other race. But Imper now this was his first run outside novice company. So, he isn't a proven top-notch over fences like they are, but he's got the inherent class to be. So, it' be fascinating to see what the vibes are for him in the runup to the festival. Uh, and apparently he couldn't go the gallop with cop the board in the private schooling race at Punches Down. So, for what it's worth, that's a small positive for Copek fans. Um, though I understand Perry Pass didn't have that the cheap pieces on in that schooling race. And Safuro Don touched on he really interesting um for what's going to happen now. You know, as Donald was explaining, his form over fenc is much better. Last year, he was given 145 in the Coral Cup, the biggest rise of any Irish horse, 11 pounds. But he's run five times over hurdles since then without winning. So, it'll be interesting when the festival entries come out later today for the handicapped, what he's in, and then next week what the British handicapper does with his hurdles, Mark. Um, because he could be a lurker there if this has been a long-term plan. >> Okay. Okay, we'll stick with you Matt for Kingwell Hurdle and Alexi who we've spoke about after he won the Greywood. Um Champion Hurdle goes there with a place chance. >> Definitely. I think so. It's wide open, isn't it? >> So I you got to run him. Um the the Tizzards are fantastic. You know, if they've got a realistic outsider, they want to give it a go and that's good for racing. And in this case, why wouldn't you? And this has been a good trial for a race that's so late in the season. runners four from 38 in the champion hurdleless century 87% profit all four went off double figure prices including gold ace at 26.0 zero. So, it's sometimes a race where if a horse has had a bit of an interrupted preparation or is just coming through the ranks, then they throw the hat in the ring there. Um, with a champion hurdle like this, then that may be more important than usual. And heavy ground here, that was a question mark for the three main protagonists. Doesn't get too deep at Wing Canton. They look to be getting through it. And I wondered if Alexis's rapid progress had come to an end when he was four lengths third off 147 in the big Ascat handicap just before Christmas. But watching that race again, I forgotten how keen he was. And with Wilfull and Hot Fuss again finding out finish of a valuable handicap at Windsor next time, that form looks better than it did at the time too. Um he was getting two pounds here from Rubo who who was acting up at the start. So the bare form was nowhere near champion but he won. Um and on ground that probably wouldn't have suited. Jumped a bit high early on. Um he jumped better in the great wood. Maybe going a better gallop on better ground had helped that. Still green at the business end here. You know, looking around coming to the last then again on the run in. He's had eight runs on the flat. This was his ninth over hurdles. So he should know better by now. Perhaps he's just a bit quirky. Um the flip side of that is you if they can get some uh him to concentrate a bit more, he could improve again. I'd be tempted to try some headgear with him. Um, you would be worried he'd get lit up, but I think I'd give it a go in the champion hurdle. So, and the more I look at that, the the more murky the picture seems. So, 21.0 definitely a place chance Daniel, but he also could win. Wouldn't be the biggest surprise ever. The stunning Secret Squirrel was back. It's good to see him. He was getting four pounds from the winner. He'd not run Nebby either, but he beaten Cabra Matan on soft in a handicap at Windsor just over a year ago. He looked to go through it. Okay. um rated 133 coming into this and was left on that's hard to evaluate the form and defeat in these small field conditions races but he was progressive last season hopefully that sets him up for a spring campaign he run well in defeat at New Bronasca but he does handle sharp tracks he won a Kemp Taton and Windsor so maybe entry for him uh will be better than Shelton trying to avoid the bounce there's a conditions and amateurs two mile handicap there he looks professional enough for that so he looks one to keep an eye on in in the spring. >> Yeah, Don, for you I guess that champion hurdle picture, I mean we we have to go back to this time last year. I mean people like why would you run and now obviously Golden Ace won. So it just shows you there is a chance of an upset in this type of race. >> Yeah, Golden A scraped home from Burnout Road in this race last year. Burnout Road of course running at Riad on Saturday behind Sons of Lovers. Another big win for Joseph Bri and Dylan. We want to get over there. Um, but yeah, look, it was it was a really interesting race because Alexe, he kind he traveled really well through his race and when he moved up at the second last, it looked like he was going to go on a win and then he seemed to I don't know if the crowds close to the horses at Wanton are inordinately close because he seemed to be having a look at them and then Rubble came back at him. Wasn't great at the last, but then when Brendan Powell got down and drove him forward, he he went on again and he still was still looking around. I I thought he won with plenty in hand and fully agree with Matt. He he fully deserves his chance in a champion hurdle in a really open champion hurdle. He'll be better in better ground as well. Um when he won the Greywood hurdle, he he won it off mark 134, which obviously you have to be a lot higher than 134 to win it. When Rooster to win a champion hurdle, when Rooster Booster won the greatwood hurdle, the year that he won the champion hurdle, he was rated 155, but he was an 8-year-old then and he that was his 14th run over hurdles. Rooster Boosters when sizing Europe won the Greatwood Hurdle. Excuse me. He won it off a mark of 137 and he was only a 5-year-old as Alexe was when he won it. So there is precedent there of sorts as in to make that I know Singer didn't win the champion hurdle but he looked like he was going to when he got injured at the second last. Um so there is there's a path there and he definitely he's a horse on an upward curve as Matt was saying he was keen in that ascot race and that ascot race is working out well. I know it's a handicap but he ran he finished third. He lost out in the runner up spot just in the end behind Willilo, but and and I I think he had to do something like this on on Saturday in order to get back into the champion hurdle picture properly and he's done it now. I think there's more to come. Yeah, interesting. Matt suggesting cheek pieces that that could be an interesting project that ju just that could just elicit a little bit of improvement from him that he might need in order to go win a champion hurdle. And he beat Rubo like Rubo's a good stick. He's 149 rated horse. He was getting two pounds from him. All right. Por Rubo goes well at Enanton. He's won there three times from five runs and um he's a horse probably better on better ground as well, but Alexa beat him and beat him pretty well. Uh I think by a good bit more than the winning margin secret girl. Yeah, first run since he fell at the final fight in the William Hill William Hill back in February last year. H he's never run at Chelton. He's actually entered in the Constitution Hill race at Southernland Friday. So be interested to see if he takes his chance in that. um and into lotto first run since leaving Joseph Bryant for Daisy Hitchens. Um ran well to a point only weakened from the second last flight. I know they didn't go a great pace um but that was his first run since he finished down the field in the Irish Aarovich. He finished fourth behind Sergino in the anniversary hurdle and entry the four-year-old's hurdle back in 2024. He's a nicely horse as well as Dam won a group two race of pre Royale. So um that was a I thought he ran well enough at a massive price in a race in which he was punching way above his weight. So maybe just keep a little eye on him uh after his first run for a new trainer. >> Okay, let's move on to the Redm Mills trial hurdle and stick with you Don because we're going to cover a horse that went off favor to beat Maj Cargisi in a triumph hurdle only a couple of years ago, Storm Hart. And since then it's just been a slow steady moving, you know, into the into novice companies still. But a great win to get a to get his first novice win. And where is the ceiling for this horse? >> Yeah, we we don't know. I I think the first four horses here are all interesting for different reasons. Um as you mentioned Dan Stormheart won well. They didn't go great pace work ahead the runner up. He got it easy in front but it was a nice step forward from him as well from his first run back after a break. Um it's only his second run since he finished. I think he was last in the spring hurdle last year and he he returned there a couple of weeks ago and this was a good step forward from him. So he led he looked like a winner actually jumping the last Daryl Keef just asked him to pick up off the sedate pace that he was able to set in the end. Stormhart just ran him down. But Stormheart yeah really interesting horse. He he won at Limick over Christmas on his first run back after a break. Um that was over two and a half miles in heavy ground in which he kept on well like he was only just beaten by McLarry in the big two-mile handicap hurdle at the Dublin Racing Festival back in 2024. That was a race in which Irish Panther an Aral contender was third. um and in which he finished off off quickly. So the fact that he was able to see out two and a half miles well and his previous run at Limmerch on heavy ground suggests that coming back to two miles off a sedate pace in a Red Mills trial hurdle wouldn't be ideal for him. So I I thought he did well to win. As you said Dan, he split Cargazi and Major in the spring juvenile hurdle as a juvenile back in 2024 and was sent off as favorite for the time hurdle in the back of that run. He was the choice of Paul Townan in that race as well. That's the race in which Majber and Cargazi fought out the finish. Of course, he couldn't have ridden Majra, but he could have ridden Cargazi. So, it's interesting that he chose to ride Stormheart instead. Um, that's that was his only run at Chelham so far, Stormheart, but he's got a mark of 147. I think that like if if Willie Mullins and Digan wants to go down the handicap route, that's probably a mark that could underrate him. And I think back up to two and a half miles, we'll see him in a better light as well. Um, and the fourth horse, Kawabonga, this this was a a really good run. He's one of my catchers, which we'll come on to later on. Um I just thought he did really well. He was he was again off a pace. It was his first run back after a break. It's only his fourth run over hurdles. Um he won his maiden hurdle at Ferry House back in January last year as a last season. He beat William Money and Cocktail Dean and Zenous in that race. And that race been working out obviously spectacularly well. William Money finished second in the Supreme. Cocktail Devan was really impressive winning his beginner's chase at le Christmas and Zenous she's now three. She's won her last three. Cola Murphy's mayor. She's got a rate rating of 130. So that was a big run. And even in in the race on Saturday, Kawabooma was kind of going for a run up the inside and work ahead then move back after the second last fight work ahead moved back to the inside and Markwatch had to check him and take him around. He finished off his race well. I think thought this was a lovely run back. I don't think he's got a rating yet if they were thinking of handicaps, but I think he's he's better than a handicapper anyway. And yeah, wherever he goes next, I'll be interested to see where he is. Yeah, Matt, there any of those four horses interest you going forward that finish in the top four? >> Oh, yeah. Yeah, this was a really interesting race. Um, I don't care what Don said about Storm. I'm a fan of his that marker 147 Don mentioned in Ireland. Just to put that in context because Willie said he'll be entered in the county and what was the Coral Cup that Coral Cup race whispers won that of 153, Commander Fleet 152. William Henry won 151 in the last dozen renewals. So you can win it from those sorts of marks. A very classy race and I definitely with Don I think he could well be a fair bit better than that. So it be interesting to see what the BHA handicapper makes of him. Work ahead was reported to be still burly in the ring um around well he got the run of things a bit out front. Henry's talking about the county hurdle for that because he's had his fifth run here to qualify him but he went out like a light in the supreme. Um, so you'd have a little bit of a question mark about the track, but he's up two pounds to 145 in Ireland. And again, it'd be fascinating to see what the British handicapper makes of that. Problem obviously is the run style. Can't remember any horse making all in the county. Um, even prominently ridden horses don't have a good record. So, uh, he's one to keep an eye on. Um, Kawabonga, yeah, definitely at echo everything Don said. This was his fourth hurdle start, so he's not eligible for the Chelenham Handicaps. Um but he might well be going into graded races of a sort of higher quality later in the spring. And finally your man now you couldn't call him an eye catcher really because he didn't do anything the race that was eye-catching but what was really eye-catching was that he was running in the race at all given in the HOT grand national trial over three and a half miles on this car for the last two years winning it two seasons ago. Now he's qualified for the Ptemp's final having finished second at the the Leopard Stand qualifier off just 118 at Christmas. Perhaps the idea was to get some practice jumping hurdles here. What byemp standards would be a decent gallop. He's about 20 pounds lower over hurdles in Ireland. One, two, three. So I wonder what the British handicapper will make of him if he's entered into the tempmps today. He's a bit of a monkey. Um, and he probably wants some fair bit of cut in the ground, but if he was given a really low rating based on pure hurdles for him, he'd be dangerous in that. >> Okay. And we'll stick with you, Matt, for the prestige and a win for the skeletons. Dalston lad justifies favoritism to win this. >> Yeah, an interesting race. A typically uh interesting race in terms of it being open beforehand. You generally don't get hot favorites for these sorts of races. Um and it's not the sort of form to be dogmatic about as a trial at the first eight Albert Bartletts 13 runners, two winners and four places. So really good trial. Last 13 renewals, none of the 14 runners has done better than fifth. And of course the Irish have dominated the Albert Bartlett in recent years. Um winner Dston Lab got a good positive ride, jumped well until the last problems with olters in the autumn. Been really progressive since cheap pieces were applied. wrapping up a hat-tick here. Uh he hadn't shone in two starts at Chelenham, but that was at 67.0 in the bumper and in the autumn were not firing. So I thought they'd want to give the Albert Bartlet go given how typically wide open it is. But it was interesting Dan Skelton was pretty clear they'd go to entry for the Septton. That might be a pointer to the chances of Money Garrow who's their intended runner in the Albert Bartlet. It's around 34.0. Um and Uber Tuba who's one of Don's eye catchers. So, I'll let him talk about him um because he was very interesting. As I understand the plans for Sha Bowen to ride They Call Me Hugo in the Albert Bartlet, but if that were to change, he's definitely an interesting horse here. >> Yeah, Don, anything to add on that? >> Yeah, it was it was a good race. Um they went a good pace, 104% finishing speed, and Don Lad was prominent up up in behind it from early like he's he's a horse in in really good form. He's won his last three now, all in cheek pieces actually in the last two at Haddock. He's a half brother to Martan, so nicely bred horse as well. Um, and apparently he had ulcers as well earlier in the year. Um, so maybe uh that's a that's a that's a factor, but he's he's in a really rich vein of form. He won the the handicap hallelu. He beat Stayway Fay in that. And yeah, as Matt was saying, it looks like he's going to skip Chelton now and go on to entry. So yeah, but an interesting horse, but no, I thought he did well to get as close as he did. He was well back in the field early on and he was actually last turning for home. Now they didn't go a really slow pace, but still it was 104%. It wasn't a break neck pace either and it is difficult to make round from the rear at Hock sometimes. It's it's it's a tight track. Um, and I thought he did well. He wasn't happy either at the second lap when when rectus spending made a mistake in front of him and he had to check and it never looked like he was going to get to do Donaldson lad but he had to be impressed with the way that he that he stayed on um he's entered in the turners and in the Albert Bartlett but I think Ollie Murphy said afterwards that the Albert Bartlet is going to be the race for him and that makes sense like it's the procedures over an extended three miles three miles and half a furong that was only his third one over hurdles he's a pointto-oint winner as well so I think lots of potential upside to him and he handled heavy ground at Leicester in his previous run, he handled the better ground here well. So, and you know the the the kind of staying test that the Albert Bartlett presents that could suit him really well. He's a horse who looks like he's going to continue staying. His Dan's actually half sister to Giggly Park and he's from the family of Denman. So, um lots to like about his breeding as well. I thought Tashan ran an interesting race. He was well out the back early on. Um I know he's an 8-year-old now and he's had plenty of runs, but he's only had four runs over her as he finished fifth behind All Park Star in the Rington Main. And that was a disappointing run. This was a good step forward from that. And similar to Ubatuba, I thought he did well to close like he did to take third place. He won a a handicap at Haddock over a mile six on the flat offer mark of 86 back about four years ago. He finished third in the Cesarovich behind the Shunter and he finished second behind Trusan as well in the long distance Cup of Ascot. So he's a classy horse. He's got a a flat rating of 98 and a hurdles mark of 119. That's obviously um a lenient mark if he can reproduce his flat form over Hurdles. And with just four runs over Hergles, there's every chance that he he might be able to do do that. He's not entered in the Albert Bartlett, but he could be an interesting handicap project somewhere along the line. >> Okay. And we'll stick with you for the novice hurdle over two miles at Punchestown. Donna, this could be an impressive winner. Heads up got the better Lazar, the star of Gordon, who was highly thought of obviously. Yeah, this it was uh to me it was great to see heads up bouncing back. John McConnell is he's regarded highly obviously with just cause for a little while and it was just good to see him bouncing back. He he finished second in the champion bumper at at Shelton last year and this year he won at Letol on his on his hurdling bow. He was good that his jumping was very good. Um then he ran in the the grade two novice hurdle at the November meeting the hyde hurdle I think it is and he finished second behind no no no drama with the send and no drama descend obviously he's gone on won the winter hurdle won the shall or the shallow hurdle as well he's high in the betting for the bearing bingham and heads up finished second behind him he was well beaten by him in the end but he went around the inside for most of the race that day um he can probably be marked up on the bare form with that run disappointed with him the last time at Shelton but that was the race at the end of the card I remember when they had the problems with the and it was delayed and maybe that wasn't ideal for him because he was so keen through the early part of the race. He made a mistake at the first flight. His jumping was poor thereafter and you just had to put a line through that run and hoping that it was just too bad to be true. Therefore, hoping that he would bounce back and he did like it was a it was a good performance as you say down to beat Lazard who's really highly regarded. Um it wasn't a great pace. Danny Mullins was able to set a sedate pace as finishing speed of 115%. and that helped him. But to me, like he he wore a hood for the first time as well, which helped him settle better. He wasn't great at the first flight, but after that, his jumping was was good. And to me, when Lazard came up on the outside, Lazard flew the final flight, landed with momentum up, got up, probably joined Heads Up, maybe maybe nearly joined him, but the way that Heads Up battled back on the far side. To me, that was impressive. He went on and won by about three parts of a length in the end. And yeah, like he's he's in the the Supreme Hurdle and the Bearing Bingham. Um I think he's he's probably a horse who stays well is is is Dam's sister New Horizons one over two miles five and over three miles and he's another horse from the family of Denman. So you think the Barry and Bingham would be the race for him if he does go to Chelton. John McConnell saying after I said he wasn't certain to go there but no it it was good to see him bouncing back andard. Yeah I don't think he lost much in defeat. Um he was beaten by Zeus power the last day at Navan who was a non-runner in this race who just got up and beat him and he's had to he's had to play second fiddle again. But I thought he did well to close on a classy horse officer pace and to get up beside him. um in the end he just he was he was I don't know if he was outsp speeded or out battled in the end but it was a good run his fourth one over hurdles there's more to come from his artist for sure um but I was I was happy to see heads up back >> yeah any thoughts on heads up Matt >> yeah I was impressed with him um and the context is John McConnell was having his first jumps winner in Ireland since October did one in Britain in November is a bit of a streaky yard so well worth keeping an eye on in the three weeks running up to the festival he's got a a good record overall at Chelenham, including winning a plate that said three years ago. Um, and yeah, it was interesting in the context of Don was saying that 115% finishing speed how much better uh he did settle here and that's going to be crucial. So, what's going to happen if he does go to Chelham? Do you go for the Supreme or the Bearing Bingham? Uh, it's tricky. The Hulloo that goes with the Supreme might mean he runs his race before the tapes go up. Equally, I think the temper that race, you know, going to help him settle. Um, so I think that's probably the route I'd go down. I don't know whether Danny Mullen's availability, you know, will he's going to be mobhanded without bankers in these races is going to impacted at all, but he's definitely one for the long list and they're going to be big fields, I think, in these novice hurdles this year. So, you're going to have to be keeping an eye on some of these horses who've got good, for example, in his case, festival form, but got good credentials, but are at big prices. >> Okay. And we're done our weekend review eye catchers time. And Don, we'll start with you. You obviously covered Calabunga in the novice hurdle. So, maybe lead with that and into your other two eye catchers. >> Yeah, Kabunga for all the reasons earlier on first run back after a break, only his fourth one over hurdles. I thought he did well having to check after the second last flight to keep on um yeah like he's he's uh whether he goes handicapping or goes up in grade I think he can go up in grade but depending on what handicap park he gets he he could be interesting in a handicap before stepping up in grade um but not saying he does have to have another run if he's going to go in a chat handicap so that's very unlikely he's only had four runs over hurdles but not a horse to keep on the right side I would say wherever he goes as well we touched on in the prestige hurdle finished second beh well behind Dston Lad. I thought he did well to stay on from the rear and close on a horse who was ridden prominently. He's only had three runs over hurdles and he stays well. He handles all types of ground and say that the Alberta Bartlett is probably the race for him. Ollie Murphy indicated that afterwards as well. And the third horse then is Becket Rock. I thought he ran really well to finish second behind Manfrisco in the Car's Cottage Cup. The last race at Orin Park on Saturday. He was the the ground was probably softer than ideal for him and it was a race when Slanig goer looked like he was going to go and win easily. He went on over the second last and looked a winner. He probably idled on the run in. He's probably a horse to keep in mind as well. Man Frisco rallied on the far side and got up to beat him. Becket Rock was rallying as well. He made a mistake at the final fence. He seemed to jump it okay. Just kind of nodded a little bit on landing over it. Um but I thought he did well to finish second on on ground that should have been softer than ideal for him. Like he's he hasn't won yet over fences. And actually when he won his maiden hurdle at Goran Park actually back in November 2023 he had a setback after that. So he missed the rest of the season. So he he missed basically his whole novice season. So he had to the following season he was competing in open company overheard which wasn't ideal. But last year in the Coral Cup he he ran a really big race. He finished sixth behind Jimmy Desoy. And I had a look at that race again this morning. Um he was down the inside. He didn't have a lot of he wasn't unlucky or anything, but he just was in traffic a little bit towards the inside. It got a little bit crowded over there and he he stayed on well up the up the hill. He wasn't beaten far by Jimmy Doy. He's got uh a chase mark now of 130 in Ireland, which is seven pounds lower than his hurdles mark. And to me, that's really interesting. We know that Henry de Brum head horses, they can often be a lot better over fences than they are over hurdles. And Beckard Rat now has had four runs over fences. It'll be interesting to see if he's entering handicaps at Chelton A and B what mark he gets from the British handicapper because back on better ground this two and a half mile trip suits him well. Um I think um if he is if he is set to go and take his chance in a handicap at Chelman he could be really interesting. >> Okay and Matt over to you for your eye catchers. Firstly, Cabalero Cliff, who was beaten just over three lengths in fourth in the champion bumper at a huge price. Uh he showed plenty of speed there for all being prominently ridden was an advantage in an unusually steadily run renewal. Particularly encouraging for his future, I thought at the time because he was the first four-year-old to finish in the first four since bluear in 2019. Chung nothing in four other runs, two in bumbers before that, two since over hurdles, but had a wind dot tongue tie fitted and he was absolute revelation at Wantampton. bit keen in the early part of the race but cruised into it and bolted up. Now the runner up Mahabara Prince with an uncertain yard stick. This is the third time in a road being beaten odds on the winner couldn't have done it any better. Robert Stevens just come into form recently on the flat and Cabaler Cliff still a three-f figure price for the Supreme. So if you like backing rank outsiders, he'd be one to consider. Second one's Kiss Will who was a useful novice hurdler last season after winning a maiden on herling debut in January. He was taking the Chelman Festival more for experience I think with the future in mind. much too keen to bearing Bingham. Rounded off the season by winning a strong looking uh listed race at Perth. Went up to three miles. He run okay on his two starts over fences over intermediate trips. Um stepped up to 2 miles seven in a strong looking beginners at Punchan on Sunday. Jumped soundly fast finishing one and a half second to a potentially good horse in Soldier in Milan. Rather had the run of the race out front 114% finishing speed. Um so what are they going to do with Kiss Will now? I thought right marathon trips if he'd settled he looked like three and a half miles uh he could be a really good horse. He'd been given 139 in Ireland. So you think right be under the 145 ceiling for the national hunt chase or maybe go for the Irish national. Um we're recording this as the entries for the festival handicaps close. Earlier on he'd only been entered for the Jack Richards. So maybe that suggests he'd run there to get some big field handicap experience before stepping up in trip. But I think he's one to keep an eye on in the spring. And finally, Karatal, who was a good bumper horse for Willie Mullins last season, bolting up by nine lengths in what's now known as the docks bumper at Goran over two mile two in early March. That's produced first lieutenant York and Bob Olinger to win the bearing Bingham the following season. Both Willie and Henry de Brum had liked to aim one of their better prospects of it and he settled well there but didn't at Punchtown Festival in the Coulson Gings winners of one. It was far too keen and he'd been switched to Barry Connell. Um he made a belated hurdling debut here and jumped really slickly for a first timer. did go left and bump Danny Donadoni on the run in, but when the runner up came and challenged him again because Arattow pulled clear and Sean Flanigan Shrewley rode him out of the line to make sure there was clear space between the two so the interference didn't change the result. He's entitled to prove a fair bit fitness-wise for this. Be no surprise to see him competitive in graded novice hurdles later in the season. The plans apparently Fairy House and Punches Town and he's one to keep an eye on. Okay, Kazar, Fatal, Kiss Will, and Cab Cabo, Cliff, Becket, Rock, Ubatuba, and Kabonga for Don. They're the six eye catchers across from Matt and Don. We're going to head to the champion chase. Our first one of our Antipost previews this week. Just a quick look at the betting before we bring in Matt Majbra 3.0 favorite to Marine National last year's winner 3.5 or 5-2 8 to1 or 9.0 on Elate Tom 9.8 Lud and Kixios is 19.5 around 30.0. zero and bigger the rest. So yeah, Matt, that sets us up. I had a quick look at the entries. Are we looking at 12 13 runners or where what are you working off that basis before you hit us with your trends and then your thoughts on each price? >> Uh I was thinking more high single figures um or entries. >> Uh trend is that the shortest second season chaser in the SP market 11 from 25 this century 105% profit and I'm glad you read those prices out Daniel to give context to this because this is what I call a prejudice market. By which I mean that punters prejudices are playing a bigger part than usual in forming the market and actual form slightly less prejudices biases. Yeah, they're part of every market. But there seems to be a collective belief that there's a strong chance that either Majbra blows it or marine national improves out of all recognition from the Dublin Chase. Now I have no stats on this but it must be a rarity to have a market for a championship race where the two main protagonists clashed at levels last time. One beat the other one by 19 lengths fair and square and they're this close in the antipost markets 3.0 3.5 you know dublin chase form alone match be about 1.4. Now he left behind two disappointing efforts at DRF. So it's not as if he's got a book of top class work. Um, I covered some of this in more detail in my article that's on the Matchbook Insights page, but I think he badly needed the run in the hilly way, not just coming on for it as would normally be the case. He only ran at Christmas, which is very unlike Willie with a 20-day gap just to get more practice in. So, the combination of cheap pieces and 14 tactics of course was a big part in improvement, but I do think it was the first time he'd been really fit. So, what can Marine National do? He should improve for better ground. Uh, I think a drop back in trip will help. I think Barry Connell looks like he's proving a trainer who really does do well at peing his horses at Chelenham. It's another plus. The ground wasn't that bad on the chase track at DRF. Only 11 seconds above standard time and they went an even gallop. You not as if it was a swamp and so you should be putting a line through Marine National run. You won a Supreme Royal Bond on similar ground. So he should get closer at Chelman. But can you see him making up 19 lengths if Masha runs his race? I So typically there are only three or four with a realistic chance in an average championship. Shocks are rare. 21 of the 25 renewals this cent to the front three in the market. But it is generally such a test of jumping at that eyes out gallop. It's an unpredictable race between those three, four, five who have a realistic chance and 10 of the 13 odds on shots this century have been beaten. But Mash was not odds on you know he's nearly about 3.0. So, he's the most talented horse in the race. He's just put in a fantastic performance, yet that's the sort of price you can back him in. Yeah, he's got to get into a jumping rhythm in the early part of the race, more jumping at Chelenham in the the first half mile or so. You'd also hope Mark Walsh doesn't do the sort of repeat of the left hand down tactic that he did as they came into the straight in the Article because you got that trappy second last fence that comes up very quickly. But he's much the most likely winner. Um there's a case for saying he should be odds on. So I keep it simple and back the best horse. If you want to back at a bit of a bigger price, I'd take on both I Tom and Lo's got a bad record at the festival and took an exhausted looking fall last time. That's a terrible prep. The last horse to win after falling at any run early in the season was Martha's son in 1997. And Lois, I think the the freshness factor is being overplayed. Yeah, last year he was impressive in the November then backed it up by running to a one pound higher mark on RPRs in the Henry the eighth at Sandown. Yet this season when he was thrashed 18 lengths by Tom Patingle Creek just apparently should be ignored because it came too soon. I just don't think he's good enough. He likes Shelton his best fresh but his only piece of form giving him a chance is the schlower and I think John Bomb was never going. So I take those two on and at a bigger price I give a word to my old friend Kixios. I only have it as 6040 in Marine National's favor. Re-watching the race where they came down last year. He is a really good horse. It hasn't run since, but he's a excellent record fresh, including beating Marine National by seven and a half lengths, giving him four pound on their seasonal debuts last season. Had a bit of a chasing experience advantage there, but even so, it was a very good performance. The vibes weren't brilliant in Henry's Racing Post Stable Tour this morning. And you would want to look at the vibes in the three weeks we've got left before the festival starts because Henry's winners off moderate preps are often heavily punted in the last week or so. You both oling and Manila were 21.0 a week before the festival. One the stairs at 9.0 and the Gold Cup at 10.0 respectively. So keep an eye out for the Quixios vibes. He might be one for momentum punders if you want for one at a big price but at the prices to me match looks far too big I think barring accidents he'll win easily. >> Okay before I move on to Don so when you have a bet where you think genuinely he could be odds on now I don't know exactly if you if you'd go as far as that if you were making the book math for example but 3.0 he'd obviously just go a little bit under what what all the other firms are for example. So that's my first question. How can you when the market's completely disagreeing with you basically, do you always are you a little bit wary that you might be missing something? And the second thing is if management somehow managed to sneak that article and win it, would we be seeing 3.0 in front of us or do people associate because he didn't manage to get back up and win despite those two mistakes that you know he could be vulnerable over fences at Chen? >> Yeah, two good questions. The first one, yeah, I'm always looking for reasons I've missed something. So, for example, I rewatch a lot of races. can't watch a race once. Um, particularly if you had a bet in it because you'd be watching one specific horse. And what I tend to do is if there's a horse I'm really positive about, I try and rew watch the race looking for things to be negative about and and vice versa. So, yeah, that's definitely it. And the record of odds on shots, 10 of the 13 this century have been beaten in a champion. You've got to factor that in. Um, but I I think the the Arle was I don't think it was a an ideal piece of race riding riding him right down the inside there because he's a bit slow to react to things. Um, and he came up against that second last fence and just made a complete mess of it. And as you say, he won easily otherwise, but he has made mistakes and and looked a bit tricky on other occasions. It's not just a one-off. And that's what a lot of people are saying. The reason he's such a big price is people go, well, the cheap pieces, yeah, they've worked once, well, they work again. He's put in one brilliant performance, but some average ones. So, you can't rely on him. And and that has to be part of his price. Um, so I I personally I wouldn't have him odds on with all that. I would have him slightly odds against, but maybe if I was pricing it up, and I've not done a book, but it'd be something about 2.2. So, I certainly think at 3.0 is good value. Yeah, Don, I don't know what you're going to go for here, but um good luck to you if you're taking on management after that case, but >> yeah, I like I have not bet in the race yet. Um and I'm finding it hard to get an angle into the race. My my my I suppose default position is to look for something to take on the top two. Um because obviously they taken out a massive a massive percentage of the market between them, but I can't find it. Um but look, yeah, like I'm I'm a fan of both horses. Majbor was brilliant the last day. I thought that his his jumping to his left would bring him on to the worst of the ground. Two things happened to negate that. A he didn't jump to his left in this cheek because for the first time he was very straight, which was great to see, and B the the the track seemed to be quite uniform throughout the chase track. There was there didn't seem to be a great advantage to be to to be deemed from going wide, but it was to me it was one of the performances of the season so far. He was brilliant and as Matt said, he beat Marine National by 19 lengths. How can Marine National bridge that gap? Maj's jumping on the race IQ jump index. He he gained over 16 lengths. Marine National gained or sorry lost over four lengths. So if he can jump on a par with manage bread through Chelton, which there's every chance he will be able to do that given that he's back at Chelton where he's two for two. He's a supreme hurdle winner and a champion chase winner. Um there's every chance that he'll at least close that gap a little bit. Um, I think the better ground will help Marine National. I think he's, as Matt was saying, Barry Collins horses just seem to, you know, it's a small, it's small sample size that we have. He's a small yard, but they seem to really zing at Chelton double there the other day as well. Um, so all of you're kind of looking for reasons why Marine National might bridge the gap. Um, that said, Majra is only six. Now he's nine years old, but he's only had nine runs over fences. So I wouldn't hold his age or or his depth of experience against him. Um it's probably a positive actually, but Major he's the triumphal winner. He ran a massive race in the ARA last year. He like he he actually made a mistake at the fourth last fence as well, which we kind of were we all we hung in the second last, but he made a mistake at the fourth last as well. Made that terrible mistake at the second last. wasn't good at the last either and still was only beaten through parts of a length by Django Bay. So, um, look, he's he's he's got a serious engine and yeah, he's he's a Chelnham horse as well. So, to me, he's he's he's a rock solid favorite. I think Marine Nol will get closer to him than he did at Leopard's tan, but whether he can bridge all of the all of the 19 lengths and a little bit more in order to go and win it, I'm not sure. Um, but I I'm really looking forward to the race, I probably won't have a bet in it. Agree with Madan Ludas. just don't think he's that class. El like whenever when he won the Tingle Creek and every and he was put in his favor for the Champion Chase shortly thereafter. I was I just I was against him then. Um thinking that he could be taken out a lot of the market but because at Chelton he just hasn't been able to do it at Chelton for whatever reason. Um then he got he obviously got beaten last time at Clarence House Chase and now he's out to probably his correct price. So, he deserves his chance in the race, but I just can't see him beating Marine National or Major. Um, Kixius, yeah, fair case that Matt's made for Kixio. He could run well at a price. He was upsized Marine National at the last fence. I think Marine National would have beaten him and beaten him pretty well anyway. Um, just the strength with which he went to the line. But look, Gixios, he's he's a player in the race and he's a Chelham horse as well. He's a he's a trifle winner as well as running that big race in the champion chase last last year. Interesting that Irish Panthers still in here. He's probably going to go for the Arkle. But they did give him an entry in the champion chase as well. So if it cuts up a lot, then you wouldn't if there were going to be three or four or five runners that Irish Panther could take his chance. But I think he's going to go for the Arkle anyway. Um but no, I I can't find a betting angle into the race. I agree with with Matt that Marber should probably be further ahead of Marine National in the market than he is. Um, and if Marine National were to drift, and if that kind of school of thought starts to gain traction, then maybe Marine National would become a bet at at a bigger price. But at the prices at the moment, yeah, I find it hard to find an angle. >> Yeah. Maybe Matt, follow to you, what odds do the top two go off SP? >> Uh, I would say about six to four and about 11 to four, I thought. >> Okay. And then Don Don's back in Marine National 11 to four. Do you foresee that around the SPS or No. No. You need bigger. >> No. I I look at if they if they bet six to four and 11 to four. I think probably Mer is maybe overpriced at 6 to4 more than Marinel is 11 to four. I think maybe closer to the time they might come for Major. He could go off closer to 2.0 and maybe Marin National will drift out to >> 4.5 or 5.0. >> Yeah, maybe. Although Marine National has his supporters and you know that counts for a lot in in Ben because it is ultimately down to the money that comes in. So um yeah, fascinating depend on how Willie Mullins has done to that point. >> Yeah. Well, that Irish pan before. Yeah, I wouldn't be surprised if he ran the champion chase because I don't think he's going to win the art. So maybe I know I listen to >> an easier race than the AR. >> Definitely not. Definitely not. But third in a champion chase is more glory I guess than third in he will obviously be short price for the Aral. We'll see. >> Yeah. And he's bring >> Yeah, that's true. And he especially with Romeo Kulio potentially heading to the brand advisory >> which we'll head to next. So the brand advisory, novice chase the Well, I'll go through the prices and and maybe Don, I'll start with you, but we got final demand. I think I might have missed something because last time I checked this markets, they were all joined fabs. But final demand, there has been a small bit of money on the matchbook exchange over the last couple of weeks. 5.0 fab 7.2 the big westerner. You've got 9.2 Wendigo who's been quite popular. tipped up a lot with a lot of the racing post tipsters actually. Western F 9.4 uh K Doahi there who I missed 8.2 two and then you've got Romeo Kulio very interesting runner if he does go 13.5 and the lay price similar enough so it does look like if he does go to Chatton race he will go here and we 15.5 and bigger the rest there is of horses that we will cover Don G give us your thoughts on the ways we'll bring Matt's trend in in a second but um yeah I was I was caught a little bit surprised yesterday having a look at the market I hadn't looked at the brand advisory for about a week and uh am I missing something why are we all going back for final demand is there just a lot of forgiveness in the air off off his run DRF Yeah, and I think you can forgive him his run in the the Leopard race. Um maybe the the media visit to Willie Mullen's yard has been has been a factor in that. Um but look, he was he was so good in winning his biggest at Navvern and then I I thought he he he was impressive in the fine chase at Limrich. I've heard a couple of comments since that he wasn't impressive, but I I thought he was. I thought his jumping was really really good. He got stronger as the race developed. We know that he handles that soft ground, but we know he handles better ground as well. Like it was it was yielding ground when he won Punchestown back in May. So yeah, like just the last day in the the Dublin Racing Festival race, he just he didn't jump. It it never it never looked like he was comfortable. So for whatever reason, Willie Mullen saying that, you know, they'll try a few different things with him and see if they can just leave that run behind and move on from it. And if he got back to the form that he was showing that he showed at Limrich or obviously his hurdles form then that would make him a big player in the race. That goes without saying. But I I think the kind of his defeat at least 10 maybe deflated some of the hype about him which I think is correct. You know he's I think it's correct that he should be very high in the market if not if not at the top of the market. But um I think now he's around about the price that he should be. Romeo Kulio fascinating inclusion if he goes here. um the Ryan Air Chase was an option, but I think that's not an option anymore. So, it's the Aral or or the Brown Advisory or or skip it and go on to the Willow Warm Gold Cup at Fairy House, which is probably the ideal race for him, but his owners QT racing, they obviously like to run at the Chelton Festival and you can understand why. Um but Gordon was kind of thinking that um he's like he's a Gold Cup horse in the making for next year, please God. So, what race do you run him in here? If that's your ultimate goal to try and win a Gold Cup next year, what race do you run at this year's Chelton Festival? And I think the arc is the answer to that. So, it's going to be fascinating to see where he goes. The Big Wester, she's a she's a big player in the race. Obviously, she ran a a massive race in the Bartlett Hurdle last year. She was beaten by Jasmine Dvau. She was she she suffered a bit of traffic problems down at the second last flight. She was towards the inside and Jasmine DVO came in around the outside. I think you can mark her up on that run, but I don't think she'd have beaten Jasmine Dvau anyway. He he won with plenty in hand, but it was still a massive run by her. Um, and then her debut this season, she's 5 second behind Jimmy Desai, who's not in the race anymore. And then last time she was really good in winning the mayor's race, the Dawn run chase at at Limick over Christmas in beating Jed Gruji. She she probably is a better horse on soft ground. That goes without saying like she she she ideally she'd get soft ground, but it was good to soft for the Bartlett last year and she handled it well. So I think she's okay on the ground. She's only had two runs over fences. Um, and we know obviously that she goes well at Chelton. We know that Henry Dev horses, they seem to improve when they get to Chelnham. So, I think she's a big player in the race. And Wendigo, yeah, he ran in the hurdle last year. He's a massive player in the race as well. I know he's popular now, but he he actually at the second last flight, he stumbled quite badly on the run to the home turns and he he finished fifth in the end behind Jasmine Devote. was a big run. Um in the Kado Star chase when he finished behind Kitsull he jumped to his left the race wasn't the race to suit him. Um he's he stayed on well and he finished best of all he's finished second in a shallow hurdle last year was running the the Alder partner last last season told you that um he he could be or or that he is a Chelton horse that he goes well with Sheldon. He had a nice run at air when he where he was seriously impressive in winning last time that obviously was you know to go and win a race having having had that run in the kind of star chase. So I think he's a player as well. Chelenham the stamina test that Chelton presents will suit him uh back left-handed will suit him and he goes well at the track. So yeah he's a big player in the race and yeah you mentioned Ky was good at at Leopardstown gets bull has to bounce back from his sandown run. Western fold is the other horse just give him a mention. Um like he's he's a really unusual novice. He's run 11 times now over fences which is kind of so unusual for a high class novice but he won the galway plate um he beat Afford Fury at Goran Park and then last time in there at the Dublin Racing Festival I thought he ran really well and finished second down Kate Dothy it was his first run back since early November he'll come on for that run the ground should have been softer than ideal for him and he'll be he'll be a better horse on on better ground as well so he's an unusual I'm sure he he probably doesn't fit in with any of Matt's trends which you'll hear about in a second 11 racer raced over fences gway plate winner going to a brown advisory chase but it's interesting in the race and also Oscar's brother if he were to come here um not sure what plans are for him but he's been a credit to Connor King and his brother Daniel they've only got two horses and he was brilliant at winning the 10 up chase he got out in front was the first run back since November as well but Daniel King obviously had every confidence in his fitness for the job and he stayed on well to beat the wallpark that was a big run he's still lightly raced still progressive and Yeah, wherever he goes next, he'll be interesting if he does line up in the brand advisory chase. He's a player as well, I think. >> Okay. Yeah, Maf, I guess we got to start and you hit us with your trend whenever you feel fit to to bring it into your analysis, but you do have to start with that final demand price of 5.0 zero and in some ways it's the wrong price in the sense he should be shorter or should be bigger if you believe the DRF run or maybe he's been overrated by excuse me by the market or whether you believe the hype or maybe less so given he he has produced on the track obviously in his first run and maybe less so the second run so that 5.0 it's not going to be 5.0 is there on the day is he's going to come in for support or maybe we might see a little bit more of a drift or or what do you think of that? >> Difficult, isn't it? And it's a fascinating question. Um I'm basically in the same camp with Don on him. The one thing I'd add is seeing a Willie Mullins interview the other day since his DRF flop suggesting he hasn't been sparkling at home all season and I wonder if that maybe was didn't really go for him at Limmerick at the business end. is he a bit of a sort of course he bullies less sor opposition and then when he comes up against a good horse isn't so good so I couldn't have him at that sort of price and this is a fantastic race you know this is a real tribute to Chelton's brilliant decision to go back to the pre-210 program of two level eight novice chases rather than four because uh you could easily find out it's still about 4.0 of the field on the day could well be into double figures in the number of horses running. Just to answer Don's question on the western fold statistic. Uh the horse uh is rule supreme. He was a second season novice who run eight times over fences. That's the most this century. Normally four or five as many of any of them have had. So yeah, really unusual preparation he's had. I mean on the bare form then that 157 rating for splitting um or just been behind Emoen and Afidel Fury at down Royal is well earned. I just think that you're going to have to run to a little bit better than that here and he hasn't got the obvious improvement in him. Um but on a sound surface he should be there and thereabouts. Might have more one for the place market. Uh the statistic here is that horses that have run in the previous year's Albert Bartlett 7 from 35 122% profit and they finished 1 P1 4 P15 in the Albert Bartlett. So a real mix of performances never be put off by a good horse not having taken that test early in their career. It's the race that's most underestimated at the Chelton Festival every season. So that form we'll come on to in a moment. Kade Dorty, I think perhaps that race fell apart a bit at the DRF because Final Demand didn't perform and Western F was looked like he's having a bit of a pipe opener on ground that he wouldn't like. He's already in cheek pieces which he wore his last start over hurdles as well. I'm not a big fan of that in this race. It's a tough attritional concept contest. If you need headgear already as a chaser, suggesting that you're not inclined to put it all in horses in headgear not from 34 since Garrison Savannah won in 1990. I personally would be surprised if Romeo Culio showed up here um after teaching him to run as a two- mileer and the last two starts. The last thing I would do is run here. To me, it's either Aral or Fairy House. Um so I I'd want to take him on. for all I think he's a really good long-term prospect as silly Isles rather fell apart um Kitsfield have been so good in the CTO star going sideways at the ditch in front of the stands I didn't see that coming and Carl Conti not having the scope to jump out the ground so looks like Ferg Brian might be going for a handicap with six mile bridge a cocktail dean looked good over an extended 25 on yielding ground at Christmas and blowing apart that beginners at Leopard'stown but he'd been beaten stairs and handicap projects they didn't look to get home when three length second Oscar's brother in the Florida pearl over three miles at punches down. So better ground would help but I'd still be a bit worried about Salamina for him. Oscar's brother pranked that form by winning what was probably a week 10 up. Um he does tend to give some of his fences a lot of air but he is tough and game. He's got a bit of a chance. But the two I like from that partner stat, the big westerner, as Don said, didn't get a clear run when second there. And I agree with Don would have been close to Jasmine Dvau, but without winning. And Henry's top novice chases often halfcooked on chasing debut. His Gold Cup winners Manella and Don Naput are both beaten on their first chase start. Uh she ran a good race behind Jimmy Desoy who looked a different proposition on a sound surface in that race to uh the two runs in the mud subsequently. She then outstayed the classy Jade Degrrui over an extended 26 at Limmerick. She jumps, travels, she likes soft ground, albeit she showed she can handle a sound surface in the Albert Bartlett and Henry's bringing her here off just two chase starts as he often does. So I think she's likely to put up a big run. It's a narrow call. I like her, but um I've gone with Wendigo who looks absolutely the right type for a Broadway. As Dom was explaining, he was really bulked in the Albert Barter after two out. I think he'd have been in third, not far behind the big western had he got a clear run. Um he stumbled badly there. He's had four runs over fences stretching back to October. Now, if we're going to get a bigger field, oldfashioned Broadway, they're going to gallop. That experience could be a big plus. Horses have been able to get away without that in small field steadily run renewals recently. He won the grade two barker over two and a half despite clearly not wanting that trip. CO star wasn't his cup of tears as Don said he was jumping out um to the left and that was good fast ground but he stuck at it really well be less than four lengths behind Kits Bule. He's a pretty good jumper. He gallops. He stays and he showed in the Ber even though that didn't suit him. He had a touch of class. He's uh from an underrated trainer in Jamie Snowden who's a a string of big reg successes with uh you know not having big money owners backing him. If you look at the sort of horses the ratings they've got the ones that he has had managed to get 140 150 a lot of them have won good races. Um so he's a trainer who tends to be a bit underestimated. Only six of his 27 runners at the festival have gone off shorter than 21.0 and two of them have won. So, I think Wendy goes made for this. He gets soft ground all the better. And what just tilted it his way was he might be a bit more battleh hardened over fences than the Big Westerner is. Uh, but I like them both, but I'm going with Wendigo. >> Okay. So, Big Westerner, current price 7.2, Wendigo 9.2. Can you see them going off shorter than that? I guess it a lot depends on the final demand wise, Matt. >> It does. And also, um, how many are going to turn up here? Yeah, we had a lot of people saying, \"Oh, we're going to get 15, 18 runners, and then the prices are going to hold up if that happens.\" But it might be that it cuts up down to 11 or 12, something like that. I don't think we're going to get six or seven as we've had in previous years. >> Yeah. >> And the final demand vibe. Yeah, it'd be interesting to see. Um, and I think again we discussed earlier, it might depend a bit on how Willy's done on the first day. >> Yeah, it's going to be a fascinating market, especially if we get 10 11 runners and you six of them have a proper chance. Don, for you, final final word. anything jumping out of the price at the moment? I know listen to your analysis there or you wait on the day or day or two before the race in Dex. >> No, the the two I were I was interested in are not running neither of them. They're not they're not even in at this stage. Um but no, I I I'm I'm in I'm in Matt's camp with with both actually, the big westerner and Wendyo. I think they're both big players in the race. Um I think I'll be taking on Final Demand. That was my kind of position early in the season anyway. and it's kind of softened a little bit since he was beaten and since he's a bigger price, but I think I think they will they will back him close. I >> agree. Clear favorite. Yeah, >> I think five to2 job on the day. >> We'll see. Again, all depends on how Woody's been doing, but even given his four timer there over the weekend. I think he's going to time that right for the Chon Festival. But we're done. My thanks to Matt and Don. Comprehensive look at the Brown Advisory there, Champion Chase, Eye Catchers, and Weekend Review. We've only got a couple of weeks left on the show, but very much looking forward to chatting with Matt and Don over the last couple of weeks. And stay tuned to confirmation of our chat preview night, which is coming your way very soon. But enjoy the week's race and we'll be back this time next week for another Chamom Trail. Bye-bye."
    },
    {
      "id": "Z8J6omqCypg",
      "title": "Football: CHAMPIONS LEAGUE Play-Off Round",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-17T01:51:25+00:00",
      "transcript": "You're very welcome along to the Matchbook Football Podcast. Marco Hair and Adrien Clark are refreshed after an FA Cup weekend off and are going to get cracking into the Champions League playoff rounds as the knockout stages kick off. We've also got Premier League this weekend coming as well. So, quite a busy time on the Matchbook Podcast. Make sure you hit that like button and subscribe completely for free wherever you're watching or listening. And a quick reminder of the podcast offer and I keep saying it, but we have seen a lot of people come over try Matchbook Matchbook for the first time. You get the benefits of that exchange pricing, but also your bet builder options as well. And we try to cover it on the podcast from both ends of the scale. Enter the bonus code pod50 POD50 and you get 50 worth in free bets when you bet 50. If you want the full T's and C's, head over to YouTube right now. You can see them on screen now. Um Adrian, the downside maybe of all the Premier League teams qualifying bar one is there's not enough narratives for us English Premier League centric focused people here. So, we get to cover other games, but the one Premier League side in action is Newcastle. And >> arguably the team to get the hardest grasp on where they're at throughout the whole season, I think I don't think anything's changed is this Newcastle side. How do you think they're going to do away the carabag early kickoff Wednesday? >> Yeah, look, it's it's on paper a trick-ish game, but at the same time over two legs, I think that Newcastle will back themselves. I don't think they'll be too disappointed with the draw. I think Newcastle obviously will take great heart, won't they, from from what happened at Anfield in the last game. You know, Liverpool absolutely wiped the floor with them 6-nil. So, you know, that showed that really if they can get their game together home and away across these two legs, they they really should have too much for them. Obviously, it's a it's not ideal to to be without Bruno Grim Marish. He he is a talisman for them. But you know what we saw at the weekend at Villa Park was Sandro Tinali sort of step up a little bit, didn't he? Um and they've had to change the system because they basically don't have enough midfielders left. So I think what they what we might see now is is more of a 4-2 3-1. And that that in turn could could give the team a nice little refresh, a little bit of a reset as well tactically. And it'll be interesting to see, you know, if Altomada, for example, will will continue maybe playing in behind um a striker, whether that's Gordon or whether that's Vissa. We have to see, but I do think that that they've got a bit more firepower if if they go with 4231 ahead of 4 4-3. So, we we'll see how they see how they go there. Um I I quite fancy them. I got I got to say they weren't great early on in the game against Villa, I must admit, but but they did obviously benefit from from from the the red card, but the way they set about their work from there on in was was very good, very professional, and I think it would have given them plenty of confidence and they will have confidence because in the Champions League this season, they've done Brian pretty well. Score draws at Paris Sanain and and by Leverkusen. They did lose in Marseilles, but they won they won in Belgium. well against Union Sanji. They've scored in every Champions League game so far this season and they've got more than one goal in five of their eight games as well. So, they've they've they've shown that they can score goals in the Champions League where things are a little bit more open. We've talked about that before with with Arsenal's the difference in their performance levels in Europe compared to the Premier League. And I think maybe it suits them a little bit more. I think when they've got when they teams come on to Newcastle, that's when they they they find space to go and hurt teams on the break and I I think they're really good on the break actually. Obviously, great pace down the down the flanks and Carabag I think I think have to go for it here, right? They have to because they're going to St. James's Park. They don't have a strong away record. This is their moment. They've got to take the fight to Newcastle and for me that might play into Eddie How's hands again. the priority for the season now with given their league position has to be the cups has to be the FA Cup. It has to be the Champions League. So I do feel do feel that that Newcastle will be really focused on this game. My pick is going to be Newcastle to win an over two and a half goals. That's 2.08. Um Carabag have been involved in a lot of highscoring games. um their last three home games in the Champions League, 32, 24, 22. Um across their last seven group games as a whole, they've let in 2.71 goals per game. And I do think that Newcastle can go there and scored two or three goals. I really do. Given Yeah, given the the golf in in quality won't be easy and I I would probably put Carib at least one goal, but I think Newcastle can get the job done here. So yeah, I I fancy them to probably win home and away here, but all we want for this bet is is over two and a half goals and a Newcastle win. It's Yeah. 208. >> Okay, Adrian, confident enough Newcastle can get the job done. Mark, I'm guessing you're maybe less so away to this Carabag team? [snorts] >> Uh just a price thing to be honest. Um I'm quite happily sort of steer away from them when they're sort of sub 1.4 away in Azabaijan. Uh you know, all the sort of stereotypes. It's a a tricky away day as Adrian says, agree with everything he says really that um Newcastle will have been quite happy with this draw over two legs to to get through and make progress in this competition and I thought they played pretty well against Spurs. Uh that was before they won away at Villa in the FA Cup. So back to back away wins for the first time since April last year I believe. Um they'll be boyed by those results. Eddie how had been coming under plenty of pressure beforehand and now they have got a very winnable Champions League tie but uh yeah 145 140 quotes away and Baku uh I can leave that alone with Bruno Gimme missing Linton might be back um I think Ramsey and Willick have stepped up okay Tanali played excellent at the weekend yeah awkward away day despite those backto-back away wins it is still just five wins on their travels in 19 across all competitions this season traditionally not great travelers under how that's domestically don't often doesn't win away in Europe either. But um I know Carabag aren't your your standard Champions League side, but there's enough sort of doubt there for for me to leave that price alone and just focus on goals. Adrian's already made made a good case for it. But I'll propose both teams to score here at 196. So not far off evens for both teams to contribute because Carrick Bag's games in this competition have been very goal heavy. Completely agree. They have to sort of go for it here and be be proactive if they want to sort of progress in this competition. I think defensively they've left a lot to be desired at times in this competition too. Um their schedule particularly at home hasn't been too taxing and they've looked pretty open full of mistakes but uh we'll give it a good go as well. So um yeah being a two-legged tie I know the importance of getting something out of this match. Um but yeah they've scored twice in all four home Champions League fixtures albeit against Copenhagen Ajax in Frankfurt and a much changed Chelsea. They've averaged 1.4 non penalty expected goals at home. Again the caveat being the opposition um and yeah they have shipped twice or more themselves in three of those four and six of their eight in this competition in the league phase have gone over three and a half goals and then you got Newcastle in town three of their four away in the league phase both teams have score as have six on the spin across all comps plus 12 of 15 away since October's international break and you look at those 15 away games since October's international break one Newcastle clean sheet and that came at Wolves so um whilst they may win they should win the market fully expects them to win uh I'm more comfortable just taking both teams to score at 196 because if Carabag don't score here, it's very difficult to see them qualify or have an opportunity to do so next week at St. James's. >> Okay. Yeah, tough enough assignment for Newcastle, but we're going to lock in towards Adrian with the Newcastle win over two and a half goals for the 10 pound money back special and given it's a Newcastle game and some of the stats outlined over the last couple of weeks. Both Mark and Adrian have agreed to lash in over seven and a half corners in the game. That'll give us a 2.4 shot if you back that true. The matchbook beter. That's Newcastle win over two and a half goals and over seven corners. You get your money back as a free bet up to 10 pound if the bet loses. So that's our podcast special this week. It is the Wednesday early kickoff taken note of that 545. Um Adrian, let's let's stick with you on Galatas versus Juventus. This is the early kickoff Tuesday. Again, the games are more spread out for the playoff round. Um what where are you at with these two sides at the moment? Um, yeah, look, I I I can see this being maybe a more cautious affair. Personally, I know that Juventus games in in Syria have been quite lively of late. They've been involved in some really exciting games. In Europe, it's been a bit more circumspect. They haven't really been involved in in too many thrillers. Uh there was the nil nil at Monaco. Of course they lost one at Real Madrid, the Benfica game, the PAOS game, the Sporting game. All lowscoring affairs under two under two and a half goals and and that's kind of where I'm leaning here. I'm also looking at Galataseray in Europe at home this year. The last well three of their four group games were at home were really low scoring. One nil they beat Liverpool, lost one nil at home to Union San all with Atletico. Um yeah, they've been a little bit cagier the the games, haven't they? Galatasaray are known to blank a little bit. I know they've got a lot of experienced players, a lot of names that that we'd know. Maybe a little bit past their best some of these guys, but they have they have blanked in three of their last four Champions League games, which is could be problematic. I mean, obviously there'll be a part of them that that thinks they've got to go for it to a degree here at home to Juventus, but I sense that they they will want to stay in the tie rather than than feel the need to win it first time out against against a UV side that has got plenty of European now. Three straight clean sheets for Juventus in the Champions League by the way at Monaco against Benfica and Pathos as well. and five of Juventus's last six in the competition in the league phase all went under two and a half as well. Galatas five of their eight went under two and a half. So I just think I think in general the these first legs might be a bit cagier than um than than what we've seen in the in the league phase where where obviously defeat wasn't quite as costly. I think this is where it gets a bit serious and this is where you might start to start to see teams looking to stay in games or stay in the tie rather than going out to necessarily win the first leg. So, so I'm taking all of that into into the equation with the numbers that I've outlined from their campaign so far. I do I do feel like this could be a a sort of a a nil nil one or one nil either way kind of game. Um so yeah just just going to keep it simple under two and a half goals. It is odds against. It's 2.04. Um yeah I can see it being a bit bit tight. >> Okay. Yeah Mark over to you. Obviously Juventus had that well bit of a classic game in Syria where Inter got the win and extended their lead. We're more on Interlay in the show but on the generic point that Agent raised on the goals angle. So we've obviously got rid of the away goals for a few years now. So we have a good data set. But versus the league phase, do you expect the games to be KG or KG in a general real? >> You would assume so. Yes. Uh but just before the show, I looked at last season's uh first legs in this particular round and six of eight went over two and a half goals and very very very small sample size, but um I would buy more into Adrian's point than what happened last season. But uh even still, I think you need to judge each game on its own merits and and yeah, I can see this being pretty tight. Um, Juventus have improved massively since Luciano Spleti took charge at the end of October. Not just results-wise, but their performances too. They've been dominating the data quite impressively. So, and with that has come much more respect from the betting markets, too. So, they're quite a short price to win this match in Istanbul and I would say probably a little bit too short. So, they come here following a a disappointing and very very controversial defeat to enter in the derby datalia at the weekend. um means they have lost twice and failed to win in three having been held at home by Lazio and and having lost convincingly at Atlanta in the copper Italia. So come here and it's their worst run since Bleti was appointed conceded eight goals in those three games having previously conceded seven goals in their previous 15 matches. Um but uh they've also returned a negative process across their four away Champions League matches. The schedule was was okay. You know, they won at Bodo, failed to win at Monaco and Villa Royale, lost at Real Madrid, and now they've won just once in the last eight away Champions League fixtures stretches back to October 2024. And you know, there's enough doubt there for me to leave them alone at these kind of prices, this kind of position in the market. And uh I'd rather be of Galatastaster with a half goal start here at 184. That's how I'm going to play this. Um we know it's a sort of stereotypical away day, tough away day in Europe as Liverpool found out. Uh Bodo were beaten quite handily. Atletico Madrid were held here. Unon Sanjaw did win here, but it's just two home defeats and 45 across all competitions for Gala going back to September 2024. This is a bit of a fortress for them and as we sort of talked about in the previous game, they will know the importance of staying in this tie and getting a positive result here. There's a chance Leo Sane could be back in the squad as well. Even if he's not available, they're packed with experience and I think quality that still can perform when push comes to shove. No Lang was signed in January. So you've got Noah Lang, Icardi, Ozamean, all sort of three threats um who started the weekend. You got Gundawan and Leina Lemina in midfield. Um there's always doubts about that defense, but I'd expect them to score here and make a real game of it. So um yeah, Galatas right plus half a goal would be my play here at 184. >> Okay, that's on the Asian handicap under two and a half goals for Adrian Mark. We'll stick with you for Monaco versus PSG. And where are you at with this PSG team? because looking on a matchbook betting exchange this morning, third favorites for the Champions League right now are PSG. >> Uh I I I don't know. Um every time I feel like they're sort of finding their way and starting to find their form, they go and chuck in another stinker as they did on Friday night at Ren. I say a stinker, they shouldn't have lost that game. The final score 3-1 to Ren was a bit of a disservice based on what PSG produced in that game. They had an xG of 3.6, six, nine big chances, 18 shots in the box. On another day, they probably win that game, let alone get a point out of it. But, um, yeah, I mean, they went to Monaco and lost in November quite recently, 1-0il, and Monaco have now won three of the last five home games against PSG and kept three clean sheets in that sample. And, um, yeah, in none of those five fixtures were Monaco as big an outsider as they are for this match. You know, trading at almost 5 to one here, it's a big old price there on the home side. But um yeah, even if you consider PSG haven't been at their best all season, only sort of playing in fits and starts, they have been quite underwhelming, quite inconsistent for for quite some time, you still look at them and what they're capable of on their day. Um there was been a has been a little bit of a fallout from that game on Friday. Dembele called out his teammates and said they have to start playing for the club instead of thinking about themselves and Lewis Enrique had to try and sort of pour cold water on those quotes. But there is a suggestion that behind the scenes things aren't completely uh aligned there. No Fabian Ruiz this midweek he's injured but their midfield options are a little bit limited but elsewhere they're looking relatively healthy um and obviously you just assume the high-profile nature of this game of this competition PSG will bring the noise uh they have had their struggles on the road recently lost at Sporting of course uh but have won away at Barcelona as well this season so we know they are capable obviously as the Champions League holders um and yeah I'm going to give them my support here because because of the occasion because we know how high their ceiling can be when they're on and how motivated if they are. Um they should win this game. I've got more concern about Monaco to be honest. I know they beat a very poor non side on Friday, but that was just their second win in eight. Three of those eight games ended goalless and I just thought the move to sack Adihuta was so premature back in the autumn and things have steadily regressed really with Monaco. It's five wins in 17 league and Champions League matches coming into this clash. Eight defeats in that sample. They've been trying a back three, trying a back four without sort of consistently finding success. And they've been quite impotent in attack as well. If you look at their last eight league earn games, they're creating just 1.1 uh expected goal per game, which is basically a bottom six return uh in the French top flight. So you look back to last season, of course, PSG uh went on to win the competition, but they met a fellow French team at this stage in breast who are sort of hovering around in mid-table as Monaco are, and they absolutely destroyed them. And um I'm not expecting PSG to do quite so much damage here against Monaco. But I think the odds against offering on PSG to win under four and a half goals, 2.16 is is where I'll head here. You've got the 1-0il, 2-0il, 3-0, 4-0, 2-1 or 3-1 all on your side at odds against Price. And I think that's fair enough really. >> Okay. And Adrian, you've landed on the same bet. So same question on PSG. I mean, where are you at? They are third favorites for Champions League than N 9 to1 on matchbook. >> I think that's about right. I do. I think Arsenal and Bayern Munich were the standout team in the in the teams in the league phase. So they they probably deserve to have that status but PSG have climbed the mountain, haven't they? So they have to be considered part of the equation. They didn't have a great league phase last time and went on to to steadily improve all the way to the final where they produced one of the best, you know, Champions League final performances, you know, in memory. So you have to respect them. Um, I'd probably put them on, to be perfectly honest, I think you could probably go blanket across the three of those teams at a similar price and that would be fair enough. Um, I I just agree I agree with Mark on on all the points really and there's not not a great deal more to add. I think I think the the key thing apart from Monaco's form which is definitely has to be taken into into consideration and their lack of goals because are they really are they going to keep a clean sheet again PSG? I know that they did in the league in November with that one nil win, but they capable of doing that again. I I don't know. I just feel that PSG have got big time players, players that will step up in on these nights where where they're really needed. And you got to remember during the league phase, they were ravaged by injuries and very very rarely, if at all, were they able to to put out anything, you know, close to their strongest 11. It it just didn't happen. But I looked at, you know, the the last lineup. You got DE, Dembele, Kavashelli are up front, Fatinho and Neves back fit in midfield. Barka coming off the bench. You know, you've got the defenders are fit and raring to go the fullbacks. You know, Hakee and Mendes. I just feel like they're they're primed now to maybe um just remind everybody why why they're defending champions. So yeah, look, Monica have a good record against them at their home stadium. Um but I think the classes with with PSG and the reason I want to go unders is that Monaco their strength is at the back. They you know they keep things nice and tight. The last three home games by the way in this competition nil nil Juve 1 nil Galatasarine nil nil Spurs. So they you know this is a step up in in level but but they're able to they're able to to be well organized and make life difficult but yeah I think PSG will win. So same bet PSG under four and a half 2.16. >> Okay. Could be a good bet there. The all French tie or good game rather. All French tie. Let's move on to the final game in the main section. Although we are going to add another one from any other bets. Effectively the same game. Bodlim versus Intermark. Inter flying. Absolutely flying in Syria. Really I mean that was set up to be a great title race. They've almost nearly put that to bed with their winning run recently. And Bod Glim. I mean I watched that Manchester City game. I'm expecting the exact same atmosphere, exact same performance from Botto Glim. So I think it's set up to be a cracking knockout Champions League tie. Yeah, I'm really looking forward to this one. I did find it quite tricky in trying to find a real sort of strong punting angle because if if my sort of case was to try and make a strong uh play here for the home side as big underdogs, I definitely could. If you asked me to try and make a case for in as rock solid favorites, I definitely could. Goals, yes. Opposing goals, probably not. Um so, uh yeah, I mean, yeah, in 15 wins in the last 19 games across all competitions after that. Derby Ditalia against Juventus at the weekend where they were actually second best before the controversial red card went in their favor. Um and they managed to sneak it at the death but um that was their first win in 14 games against the big four in Italy of Napoli, Juventus, Milan. Um yeah, is it those three teams potentially another one? Um uh they just haven't been winning their big games that matter the most, but they've just been such flat track bullies domestically that uh they've been able to sort of open that lead at the top of the table. And uh good news for them. They've got Bella and Chalanoglu back in the fold. Denzel Defree is the only major injury concern. The European away form is strong. Seven wins from the last uh 11 in this competition since the start of last season. Winning win odds on favorite in all five of those fixtures as well. But then you have to take into account the conditions here. Um it's going to be sub-zero temperatures in the Arctic Circle. they'll be playing on a plastic pitch and we've seen examples of that in the FA Cup this season and in the Champions League of course with Bodo playing Man City about how that can be a bit of a leveler and uh yeah Bodo are fresh. They're still in preseason. The only games they've played competitively since mid December have been in the Champions League and surprisingly they've just been at it when they've come back to play in these fixtures. Um they've been exceptional in those cont contests and uh yeah they promised plenty early on in this competition without getting the results but then they go and take seven points off Dortmund, Man City and Atletico to to pinch that place in the top 24. Just incredible stuff. What a story. And uh yeah, we know what we're going to get from them. Very front foot, high energy, awkward opposition. They've scored twice or more in six of eight in the league phase. Average two goals per game. They pose a big threat from set pieces um and open play. Uh and to give you an idea during the league phase, Bodo averaged 1.54 non-penalty expected goals per game. Barcelona averaged 1.59. So we know they can create they know we know they can cause problems. Their issue is keeping the goals out and the opportunities out and and in did score twice in three of their four away days in this competition. They scored in every away day across all competitions this season. They average 1.95 non-penalty expected goals in this competition, the fourth best figure during the league phase. So they obviously command huge respect, but um yeah, I did toy of backing Bodo with a a big start here, but I've gone down the Adrien Clark classic route of both teams to score and under four and a half goals because it came in at 2.15. And it kind of seems mad to say this, but um I think both teams are scores. It's obviously not a banker, but I think it's the the more reliable of the two. The more concern I have here is it will it go under four and a half goals because we know what Bodo are like. six of their eight league phase games did see this bet win but um the way in which they play we could easily see five six or seven goals but um I'm just hoping go back to the start you know it's a first leg knockout tie perhaps we will be uh a little bit more guarded here but um yeah I think Bod need to be proactive to stay in this tie uh but I do expect in to to contribute too so BTS and under four and a half goals at 215 is my selection >> okay and yeah Adrian or Mark said you can go either way in terms of making a case you are going to make the case for boto glimp back to that city game I know City were shambles at the time particularly defensively but some of the goals the breakaway goals Bod Glimp got were just unbelievable. Yeah, they were team inspired, weren't they? And it wasn't a fluke, you know, had one disallowed as well. So, no, they they they were worthy winners in that game. And then to go to Atletico Madrid of all places and win, I was just it's crazy, you know. So, they will be, you know, full of beans and the fans will will bring it, won't they? I know it's only a small stadium, but there there'll be so much excitement around this tie and and the possibility of taking a lead to the Sans and really rattling the cage of another big boy and they've shown that they're capable of it. There's no there's no doubt about that. And I I I do agree with Mark. I could have you could make a case for in to win this easily. I mean there were waveforms been super professional in the competition. They're playing great. Um I think the emergence of Espacito is a is a really interesting one. I think he's he's a absolute handful um to join sort of Laro and Tam and those guys. So yeah, they are a good team. They they look a bit more exciting than they did on on route to last year's final if truth be told. Um but but there's a vulnerability there as well. I don't think they're they're amazing at the back. Um and but a glimpmp I think can can certainly score in in this first leg. as Mark's outlined, they create a lot of chances, particularly in these home games on on the surface that they've got. And I'm going to go with a plus one handicap here. It's not a huge price, 1.79, but it does need inter obviously to to win by two clear goals for us to to lose our money. And and and the reason I'm going with this is that it just doesn't happen very often. Okay. Um, I've gone back this century, so since the turn of the century, so 25 26 years of home games in Europe for Buddha Glimp. Um, they've they've lost eight of 45. So they win most. There's a few draws in there. They've lost eight. And they're normally to the to the big guns, but out of those 45 games, they've lost one by more than one goal. And that was against Tottenham in in the semi-final of the Europa League. West Spurs, you know, put in a really good performance um up there in the Arctic Circle. So, it's very very very unusual for anyone to go there and wipe the floor with Buddha Glimp. So, that that's where I'm coming from here. They've scored in 17 of their last 19 home games in Europe as well, Bud Glimp. And and as as we said, they've been they've been in good form in this year's competition. I like I say, I like Inter, but this, you know, this still gets a few score lines, you know, on side, particularly the draw. It wouldn't surprise me if if if this did end in a draw, but we'd still we still come out a winner. So, yeah, for me, a glimpse plus a goal, uh 1.79. >> Okay, good stats there. I'll not lose my two goals. We'll lock that in. And we're going to cover a fifth game here because both the guys have landed on a similar selection or similar angle for Dortmund versus Atalanta. So, Mark, take it away here on Bruceia Dortmund. um given the bets to come here, I feel like you're quite sweet on them this week. >> Yeah, it's uh it's actually probably equally kind of pro Dortmund and and negative against Atlanta. I I do think there's a good opportunity for for Dortmund to get a first leg lead here. They've been pretty strong in this competition, particularly at home. Uh six wins in 11 going back to the start of last season in this competition. Go back further and 11 wins from 20 home Champions League games. So very impressive across a a large sample size really too. Uh they're what two they've drifted out to about 2.14 on the matchbook exchange right now. And that was about 2.04 on Sunday night. So I'm going to back them with a minus a quarter start at 184. Uh it just means if the game ends in a draw, we only lose half of our stake and we get paid out at 184 if if Dortmund wins. So it just provides a little bit of protection and insurance to get a against a potential draw. So I think it's a nice position to be in. But Dortmund's recent form, 10 wins in 15 and 11 wins in 14 at home. Results wise they've been excellent even if they have been running a little bit hot compared to performance levels. Um they definitely came to the party on Friday night at might you know three of their four goals came from set pieces but even still it was a a very good statement victory. Serassi has been leading the line in fine form and you look at things everything seems to be moving in the right direction even if the overall performance level hasn't always matched those results. uh they're very more very close to being into a Bundesliga title race again with the the Classica at the weekend to come. But um you look at them and where they are right now compared to Atlanta who I think have got big issues in attack coming into this midweek. Uh Adamola was sold in January. They've since lost Charles to Catalara and Jean Lucas Gamaka to injury as well. So um that's three big players they are without this midweek. Um they have bagged three straight wins albeit to Alatio on the weekend. They turned Juventus over in the copper Italia as well. But um they did the wet the bed a little bit in this competition when they chucked away a really promising top eight position with a home defeat to Athletic Club and before losing to Unon Sanja Wats as well. So I just think those absentes might be too big a hurdle for them uh in a tough away day in midweek. And um just one other thing I haven't got a bet surrounding this but the referee appointment for this is the Dutch guy who I can never pronounce his surname Sar Gosh Bork I think it is. um he has given four or more cards in 19 of his last 21 UEFA club games. So I haven't got a bet to support that appointment yet. But um he normally doesn't require a second invitation to produce a bit of punishment. So if you like cards, I would definitely look towards him and this match because uh he's normally quite reliable. But yeah, my selection here would be Dortmund minus a quarter at 184 minus a quarter on the Asian handicap. But if you want to check out the cards on the matchbook bet builder that Mark says are outlined there, check them out. Uh Adrian, pro Dortmund, anti-A Atlanta, are you somewhere in the middle, similar to Mark or if you had to lean one way or another? Which way are you leaning? >> Dortmund. Yeah, Dortmund all day long. Yeah, I like I say, they've lost they've lost too many good players and even though their domestic form is fine. It's quite solid. Um it's been quite a kind kind fixturist for them. It's really Dortmund. I just think that in in these kind of scenarios often it's those with the sort of course and distance experience that that that that know how to navigate their way through a knockout tie and and Dortmund's record at home in knockout ties in the Champions League is really strong. They're unbeaten in seven and obviously that's going into into the the deeper stages where you you end up coming up against some some top teams, you know, but they they've been in this position a lot in recent years and they very rarely let you down in front of their own supporters. Obviously, they got beat at home to enter towards the end of the league phase which was a bit of a shock. Um and they actually they they stumbled a little bit towards the end of of the of the league phase. Um but their domestic form is is fantastic. It's absolutely brilliant. They've lost once all season. It's it's remarkable really. They've won six on the spin. Garassi as Mark points out in really good form and those set pieces. It's a wing back isn't it Ryerson the Norwegian. He's got 11 assists in Syria. Not Syria in the Bundesliga this season which is absolutely brilliant. I think he got four in one game the other day. So So yeah, quite remarkable. And I just think that Atlanta as Mark used the term wet the bed probably is very apt. I mean that was a proper collapse. They they basically were in the in the top eight and they completely blew it and I just think yeah now they've got to go to Dortmund if Dortmund put their foot down win this game. I just think it might break break Atlanta heart. So yeah for me quite a nice price really and you know a team you know such a good team as Dortmund to be backable at 2.1 at home. Yeah, I'm I'm yeah, I'm definitely on board with that. >> Okay, well, both the guys quite sweet on Dortmund. Dormund, incidentally, three six points off Byron and play them and host them, I think, at the end of this month. So, want to keep an eye on the Bundes League and we might cover that on that weekend podcast. It's it's unfortunate for Dormund. They have these two Champions League games before that. So, they'll have a lot of miles on the clocks by the time that game comes around. Inside matcha.com, full recap of the guys picks as we move on to long shots here. So, Mark, kick us off with the long shots here. Um, Club Ruga hosting Atletico Madrid. I I've seen enough of Club Ruga, those two wingers. There's a lot lot of good stuff going on there that they could cause an upset here. And I'm delighted to see you've landed on something similar. >> Yeah. Uh, I picked them out on the last show on match day eight to to win and both teams to score against Marseilles and was let down by Marseilles not turning up in Bruge. Uh, they won that game 3-0. If I'd gone club Ruger and over two and a half goals, maybe we'd have a long shot winner or we would have. So, I'm going to adapt my approach here and back Club Buger to beat Atletico Madrid alongside over two and a half goals because it plays a a nice 5.1. Um, I expect Buger to bring the noise, especially in front of their own supporters. We've talked about it enough in the show now that these first legs are very important for these underdogs to go out and put in a performance to stay in the tie for the second leg. But yeah, in three of their four league phase games here in Belgium, Club Ruger scored at least three goals. Only Arsenal managed to shut them out. And last season they sprang a few surprises in this in this competition too. They beat Aston Villa, beat Sporting Atlanta, held Juventus as well. So they are a lively bunch. Um and I think they can hurt an Atletico Madrid side who are coming off a wild week or or 10 days or so. They smashed Bettis 5-nil away in the copper del at home to them in La Liga just days later. Demolished Barcelona in the copper del 4-0 and then got beaten 3-0 at Rio Vakano at the weekend. That game was on neutral territory, too, because Ryo's home ground was out of use. So, you've had easily the best and worst performances of the season in the space of 10 days. And um I still think they're a team that can be opposed at short prices on their travels. They're round about evens or just trading at odds on at the minute. They failed to win 12 of 19 away across across all comps this season, but two of the wins came at lower league teams in the copper. So take those out of the equation and they failed to win 12 of 17 away against La Liga or Champions League opposition. So in Europe too they've had struggles on the travels for quite some time. It's five wins in 17 away European games. Just one clean sheet in that sample and 1.94 goals per game conceded as well. So that's pretty well surprisingly bad I'd say for a Simeone side. And having seen Buger really put Barcelona to the sword in in a thrilling three- draw this season. Um no reason why they can't do similar here. It's a big price. So yeah, bugger and over two and a half goals at 5.1 is my long shot. Just in terms of the numbers include qualifiers and overs has banked in 11 of 12 club bugger Champions League games this season. Seven of eight Athletico in this competition have followed suit and seven of those eight also saw both teams score in Atletico games in this competition. So yeah, expecting this to sort of go against the grain I guess in in the first legs and produce some fireworks and hopefully plenty of goals. Just on that. So you you pronounce it Bugga. The early kickoff I tune in to the commentator was saying it was Buga and obviously it's being Club Bruge. Which one of the three is it? I mean the commentators usually get the it's sent to them. So I've been I haven't been going on a solo run with this Buga. I've been going with the commentator the TNT commentator >> but you're certain it's Burger I guess. >> I'm not certain of anything Dan. I I just call it Club Bugger. Um having called him Club Rouge for most of my lifetime until Yeah. Obviously. >> Yeah. Well listeners on Buger. I like club Ruga on on comm so I said I'd stick with it. So just saying that's not just coming from me. Um Adrian, we've had this game already. Benfica versus Real Madrid. It's round two. >> Okay. I mean Jose not found out, but is it like Madrid will be ready for it this time around or do you think history can repeat itself? >> I don't know. I mean long shot it's I think Real Madrid are a bit short is is where is where I'm coming from. I know that their domestic form is has been good since they made the managerial change. they've sort of stabilized. I mean, I think there's eight wins in a row now in La Liga, but um I just think that yeah, Lightning can can maybe strike twice and and a price of 6.0 for Benfica and under three and a half goals. It it appeals to me. Um they'll take so much confidence, won't they, from the 4-2 win. They had 12 shots on target. I know the goalie comes up and gets the fourth or whatever right right at the end of the game, but they they played really well in the match and it was a thriller. 12 shots on target against Real Madrid, you know, anywhere in the world, it's going to give you confidence that you can you can get a win against them and, you know, with a second leg against at the Santiago Bernab about calm that they know the value of course of of of maybe getting getting a first leg advantage. I I I also wonder about the Jose Marino factor. I mean, he is, you know, he doesn't he's not happy with how things sort of worked out at at Real Madrid. And I think he would take enormous pleasure in in in getting one over them again. Obviously, maybe after the World Cup, let's there's talk, isn't there, that he'll take over Portugal or going to national go and work with the national team. So, we who knows how many more Champions League ties he's going to have. Certainly Champions League ties against clubs like Real Madrid. So I think he will be unbelievably motivated here. I think the fact that they played recently and it was a shootout would I would I would go against that happening again. I think this happens so often. You see it from one half to the next, don't you? In football you get five goals in the first half, none in the second. You know, it's often like that and I I kind of view this match a little bit like that. I think Real Madrid will certainly give them a bit more respect and they they'll know what they're they're coming in for. Uh and Benfica as well obviously um they'll attack but but I think in a way that they they don't take too many risks as well. Obviously Ralenti I think is suspended. Um so that's a blow for Real Madrid at the back. Vinn Vinnie's in good form is he Vinn Vinnie Junior is in good nick and beapp probably come back in for this I'm sure. So um yeah look Real Madrid are favorites for a reason. I don't think it's beyond the realms of possibility that that Benfica could turn them over again. and Real Madrid not that trustworthy away from home in the Champions League in recent times. So yeah, if they if they bring it Benfica, they can win. Um yeah, so Benfica and under three and a half is 6.0. >> Let's lock it in for long shots. And best bet time, Mark. Two games you've just covered. You're going to basically take an extreme version from one, extreme version for the other, and double them up in your best bet on the Champions League card this week. >> Yeah, I mean I wanted over two and a half goals in Club Ruger versus Atletico Madrid. It's just too short. It's 169. So, it has moved a little bit in the last 24 hours. So, we might be able to get up to 175 180. Probably unlikely, but yeah, I'm just going to pair it with Dortmund double chance because uh uh I'm pretty pretty comfortable comfortable and confident that they will get something out of that first leg tie against Atlanta for all the reasons we've already outlined. and just wanted to support goals in this game in Belgium because I think club bugger only know one way of playing and we've seen them cause plenty of teams plenty of problems over the last 12 months in this competition better teams than Atletico Madrid and seeing Atletico in close quarters in the last 10 days you don't know what you're going to expect from them but defensively they have or they do give you opportunities to to hurt them so we've seen that in this competition from the very off and we've seen it away from home in this competition for quite some time too so I think bugger will be very proactive here look to try and get some goals get into a first leg lead and try and defend that in the Metropolitano next week. But uh yeah, over two and a half goals in Club Rugo versus Atletico Madrid uh with Dortmund's double chance comes in at 2.15. >> You going to do your multiples on the Matchbook betting exchange. Final word to you, Adrian. The game we're covering here, Club Buga, Bruge, >> Buga, whatever way you want to put it, they're hosting. So I'll let you lead on what three you want to go for that one. >> Yeah, I I'm going to change my mind now. the way Mark's been talking, you know, talking down at Leo's chances, but the bottom the bottom line here is that I wanted goals, the same as Mark. Um, both teams to score was what I wanted. Um, it's too short on its own. No clean sheet for Atletico Madrid in this season's Champions League. They've scored in all but one game. The only game they didn't score in was at Emirates Stadium when they got woped. But I got to say, they did carry a big big threat in that game. You know, Alvarez was was particularly lively. Um, so I think Atletico will score here. I think they'll concede. I think both teams will score. It feels feels quite solid certainly based on on on on Mark's take on on Atletico's defending, but I just sense that that Simeone and Nouse and European experience can can prevail and I think they can avoid defeat. So that's what that's where I I want to go with here. Atletico double chance paired with both teams to score. the the one reason I'm I'm I'm relatively confident in in Atletico is is that they rested so many players at the weekend. I know it was a bad result they got beat but you know there's there's a load of load of guys coming back in here you know Alvarez Griezmann Koke Simeone Lukeman you know all these guys so I think that they'll be ready to explode into life and bugger will take it to them and I think that Simeone and his players are clever enough to to maybe pick them off and score goals at the other end. You know I could I could absolutely see this being a a two a piece for example. Um but but I I think they've got enough in their locker not not to lose the game personally. Atletico Madrid so yeah both team score and them on the double chance is 1.88. >> Okay insights on matchbox.com full recap but just uh note that for the next few weeks the guys are going to be very busy there. We've got Mondays covered with either Champions League or Premier League football for the next three or four weeks including in in around Chelton week where of course match will be very busy. So check out your podcast feeds but also the weekends as well. It is the busy time of year. I can show you as someone working in the industry February, March, April time, it's just non-stop football and we are very grateful for it. As always, if you can take two seconds, hit that like button if you enjoy the content and a comment as always is read for questions for Mark and Adrian. But we'll be back around Thursday, I think this week, to preview this weekend's football. And we'll join join us for the second leg of the Champions League playoffs next Monday. Bye for now."
    },
    {
      "id": "9BVZ9P7Qe0w",
      "title": "Cheltenham: 2026 Arkle Ante-Post Preview - Lulamba or Kopek Des Bordes?",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-13T11:51:36+00:00",
      "transcript": "Time to move on to the article and we will cover this from an antipost perspective. Don, I'll actually go to you first and then might come back to Matt's trends and then final selections from both of you guys. But Don um just the prices that we currently have in Matchbook Lamb 2.7, Copic Dour 3.7, CargI 7.8, Romeo Kulio 16.0 big drifter there which potentially looking like he's going brown advisory slash maybe not at all who knows Irish Panther 20.0 similar price Kappa J Pike and 24.0 zero steel alley who we covered earlier. So where are you thinking with the current prices what we're going to be left with on the day in terms of declarations and perhaps final prices? Is there any value in the market right now? >> Yeah, it's a really interesting article as we speak here Dan. Um look, Lamba was tightened up after he won the game spirit. Um I I thought they might have left him alone actually, but I I suppose he's won and he's won impressively in the end just for all all the reasons we were outlining earlier on. I just suspect he could be he could be vulnerable in an artle especially if he's run on good to soft ground no softer but look he's a he's a top class performer he's a top class juvenile last season he's three for three over fences now he's good at sandown in the Henry VII he's a a dual grade or a grade one the grade two winner now at the grade one in novice company the grade two in open company so it's hard to argue with that that CV um you can understand why he's favorite board yeah like the reports on his piece of work have been very positive there over the last couple of days. So, it looks like he's back on track. I think he had an operation to remove a chip in a knee. So, we haven't seen him since point. He missed Christmas, missed it over the racing festival. So, it's a big ask going into an arc on the record. Just one run over fences and Western Warhorse did it. Sprang a big surprise, but he'd had runs over hurdles before that before he had his run over fences. And Welch Chief likewise, he' been running over hurdles earlier in the season at a high level, then had his run in in a chase and then went and won the Artle. So there is precedent there, but one run only one run this season. It's a look, we know Willie Wellins is a genius, so he's in the right house for trying to accomplish something that isn't accomplished very often. But um it'll be a good training performance now if he does go and win it. Um and but look, he was such a high class hurler last season, the supreme hurdle winner obviously, and he was so good. His jumping was really good when he won his beginner's chase. He kind of it warmed as the race went on. He he was a little bit free and a little bit um enthusiastic through the early part of the race, but once Paul tannon allowed him stride on in front, his jumping down the back straight was good. His three best jumps were at the last three fences. They got progressively better as he went on. So, um that's obviously going to stand to him. But, look, it's just just going to be so exciting to see how that pans out. Romeo Kulio, yeah, like we know he's a two and a half mile horse minimum who is potentially a Gold Cup horse for the future. All going well. And that said, he's a he's a fourtime winner now over fences. He's a a triple grade one winner over fences and he needed every yard of the two mile one furong trip at Leopard's town to get up and catch Irish Panther at Christmas and similarly again against Cargazi. It looked like he she had him beaten on the run to the last then he closed up then she made a bad mistake at the last and she came back at him. So um and it's you know it's a conundrum where they're going to go and I think the Ryan Air has been ruled out even though it's over the right trip. So see that they are kind of the brand of Rosary Chase chase or maybe on like fairy house it's the the willow warm gold cup is the right race for him but I know connections want to go to Chelton so he could do both he could go on to Chelham and then come back to fairy house so he's a player all right if he does line up in the race but I I prefer Kazi I just think that the better speed test will suit her better she was unlucky not to beat Romeo Koulio I think if she hadn't made that bad mistake at the final fence she would have beaten him um we We didn't we spoke about this at the time as well, Dan, like we didn't I didn't anyway appreciate the severity of the mistake that she made on the the initial view, but it was only when you saw the overhead camera, you could see how much ground and how much momentum she lost. So to for her to get back going again and close Romeo Kouli to a neck that was that was a big performance. Um also key I think is her her Chattam form. She's run there twice. She finished second behind Majora in the Triumph Hurdle when the two of them had between them from a long way out. It looked like she had managed for his measure actually going over the last or going to the last at least and he just stayed on better in the far side and and got up to beat her but then she went back she won the county hurdle last season. So I think all of that better ground at Chelton will help her greater speed test of the arkle over two miles exactly not even two miles um as opposed to two miles in a furong and heavy ground at Leopardtown then I think that'll suit her better. So she she's at the top of my list at the moment at the prices. And the other two on my list are Cape Pike who seems to have surprised everybody this season over fences. Like he beat Salvatore Mundy. Salvador Mundy was a one to seven or one to eight to eight shot at thless in November and he beat it seemed to beat him on merit and then he went back to the grade three race at Punchtown and he won that as well. Breed predators gold better fancy stable companion and Jacob's ladder and Jacob's ladder was an impressive winner at the handicap at the racing festival. So that's all solid for him, but that was over 2 miles, three and a half furlongs. Um he'll be dropping down in trip as well. He he ran in the Turners in the Bearing Bingham last season at Shelton, not the supreme noviceses and he ran in the Merry novices hurdle at Entry, not in the top noviceses hurdle. So they're kind of the intermediate trips he was running over as a hurdler. Then it's a case of is he going to have the pace for an Oracle or is he going to even go there? He's another one he might wait to ferry house. Um but he's an interesting contender. And the other one is Irish Panther who only just got caught by Romeo Kulio in the the the grade one race over Christmas. Again, Ellie and Patrick Hart the Hardy, they did say that they weren't definitely going to go to the Dublin Racing Festival. They were going to see what the ground was like, and I suspect the ground was just too soft for them to allow him take his chance. So, it looks like he's going to go straight to Chhatland now to the Arkle. But I wouldn't mind that. I think he was a he was a progressive horse for um the late Edward Grady and then came on and was impressive in his two his first his first win over fences at Nace when he beat Jacob's ladder. Again, that form has been working out and then big run in defeat behind Romeo Koulio last time. So, he's just a little bit of a forgotten horse in the Aral picture, I think. So, he's he's definitely on my short list, but um Cargazi will be at the top of it. >> Okay. Don effectively taking on the top two in the market at current prices. Matt, it is interesting on the two Mullins horses. First of all, you can hit us with your trend as well that that's heading into the ticker. Um it's rare is it that Mullins has two like like Town will obviously pick Copic to board, but like Caris is a serious contender here as well if that makes sense. Like you've got two really top class N chases not much in them on the Mullins team. So like someone like Danny Mullins could pick up a great ride and dictate this race perhaps. Yeah, I think they're both real contenders. I definitely agree with Don that I prefer Cargis to Romeo Culio. They did have quite a hard race there. I think Romeo Culio might have had the hard race, very slow, um about 93% finishing speeds. Um but she, as Don explained, you dropping down in trip, more jumping, um better ground, then I think she would be really well suited by that. Uh so she's definitely got a chance. My approach to the article is all about speed and jumping at speed. Always a lot of debate about whether you want a pure two- mileer or an intermediate trip horse. So firstly, there relatively few pure two mileers. The vast majority of horses of a range of trips they're effective at. And when they have a class advantage over the opposition, that range broadens. There is the occasional horse like Captain Guinness who's a pure two- mileer, but that's really because he'd be effective over shorter if such races existed. Yeah. The vast majority of champion chases are effective over the sharp two and a half miles of the melon chase entry. They may stay intermediate trips, but they aren't stayers. They're really fast horses. And in the arour, what's different is there's just one cohort of horses. You one season's worth of noviceses. In the champion chase, there might be three or four cohorts. And so quite often, you've only got one or two top class noviceses running in an arle. And if there's only one and they're ideally suited at this stage of their career by an intermediate trip, they often outclass their non-topass rivals even though the trip isn't ideal. Gave warrior did that two years ago. If there's a top class two- mileer and a top class intermediate trip horse, then if the top class two mileer fluffs his lines like Mas did last year, then the intermediate trip horse Django Bay wins. But if they both run their race, the top class two mileer almost always wins. Well, chief beat kicking king sprinter sacriic qard duan beat sizing John. It's hard to remember a top class intermediate trip horse beating a top class two mileer when both have run to form. The closest I could think of as captain Chris beating Finian's Rainbow. I suspect Finian's Rainbow might have been a bit short finisher at that point. So the trend that relates to this is to do with hurdles form and it's horses that achieved a racing post rating of 160 or more over hurdles the previous season 10 from 20 since 2002 46% profit um often key players in the article they've just been winning their chases so easily you could tell more about how fast they are and what trip they want from their hurdles form sometimes so hurdles RPRs for the antipost market leaders here cop 160 so Monday 155 Lambo 154, Caris 152, Romeo Kulio 150, Cappa J Pipe 136, Irish Panther 133. So the result of all that theory, my starting point is want to start with the top two class miler and then you look at the actual horses. So good as Kis and Romeo Kulio are, I think there's a pair of topnotch noviceses in here. Um, and to my eye and a lot of people, I think Lamba doesn't jump like a two- mileer. He takes a while to warm up at his fences. Um, and he had to be stoked up a fair way from home at Newbury. Now, he then powered clear, but that kind of looked like Ster at the trip to me. Um, and all be it a very high class one. So, if Copecore doesn't strut his stuff, I think Lambo will be able to outclass the others even though he's not a two- mileer. But if copek the ball can overcome his inexperience then both my eye and history tells me he'll have too much speed for the lambber. So the big question for me how much of a concern is coming off one chase start in November. Don's explained that world chief and western waror have been had uninterrupted preps during the season. They've been running over hurdles and that's definitely a big difference. Um, you neither they have been off since November, but I'll be putting up an article probably next week on the Matchbook Insights page about Willie Mullen's record at the festival with seasonal debutants and also horses off one run. You interrupted preparation. There'll be more detail on that, but Willie stands alone at being able to do that. You I absolutely trust him to minimize the chances of cos lack of experience catching him out. And Don said when he made his debut at Navvern that um once he settled a little bit he was much better in the second half of the race jumped really well. Paul can pull him up and I was really pleased with that because he was a bit ignorant as a hurdle. I thought he might just charge at the fences but he was clever when he needed to be and he had a some sort of schooling race the other day. Punches down. Danny Mullins uh who was on imperry pass you 157 rated horse said they just couldn't keep up with Cobain Ward Paul's gunning him into the fences making him have a you know some meaningful experience so that all sounds very positive he will need to settle on um because he's a keen go but lots of fences early on in the arc will hopefully help with that it's going to be a fascinating matchup but as usual I'm with the top class speed horse because he's 4.0 zero roughly. You know, for me that makes up for the risk of the inexperience catching him out. So, I think Copekward's the right bet here. >> Okay, so that's interesting. We've got Don effectively now, I say effectively taking on with the price, current prices, the top two in the market. You're largely with them and you think it's potentially between the two, Matt. Um, who goes off fav between the two? >> I think the vibes will be crucial. >> Um, I think if the vibes are strong for Copek D'vor, then he might do. Lamberta. I think he he's going to be one of those horses that really divides opinion on the preview night circuit. It'll be fascinating to to see who thinks what. >> Yeah, Don for you. Who goes off? >> Yeah, I fully agree with that. Um I think where they are at the moment is correct. You can understand where they are. As we get closer to the time though, we'll we'll probably learn more about Copek Board on the previous circuit. Like I suppose out of sight, out of mind. We haven't seen him since November. So it's understandable that he's behind a game spirit chase winner at the weekend, but I think as as we get closer to off time, they'll converge and I'd say they'll be close enough on the day. >> And then Matt for you. So Cargi, she won't get closer to what she currently is to copic board. So that was my next question. So like I mean she's obviously had she's been running in that DRF race and 7.6 versus 3.65 4.0ish for Copic. You think that'll be largely the same difference come race day or is there any chance that there could be some money for the the two-mile cargisi and her chaton record as well? >> I think it'll all depend on on those vibes because if cope the board is really strong and I think Don's right that then he will get close to Lamber in the market and it won't be much in it then she's probably going to drift at the moment. Part of her price is that if things don't go well with him and he has had an interrupted preparation then if Paul's on Cargisi then she's going to be a lot shorter. If as we expect Paul's on cop board she might drift a little bit. >> And then Matt finally for you. So I know the big prices does and I know you mentioned it's probably between the top two in the market but if I said to you you have to have about the current prices on anyone outside the top two in the market that would be shorter on the day. Is anything making your short list on that question? Um, I think I mean I suppose Kis will be it because I think she's the the next best horse. Uh, it's it's hard to see one of those. We'll get the scratches um through shortly. Um, I suppose the old lunatic Salvador Mundy, he was good the other day. He's got the um the ability in the herds form to play a part, but equally he's likely to pull too hard and, you know, be tailed off at the top of the hill. But, you know, he's 50 odd on the matchbook exchange. You could have a throw a few coins at him if you like long shots, but uh the Arle very predictable race generally and I do think we've got really good horses in it this year and therefore one of those top two top three caris is going to come along and struck their stuff and therefore it's going to be hard for the outsiders to win. >> And final word to you Don putting you off from Matt's case in the top two in the market. Are you happy with to go to war with cargis? Yeah. The fact that Matt's with the top two puts me off off Kaz. >> He said top two there. He even said top two, maybe top three there. Yeah. So, >> no, look, I I like Kazi as a mayor. I liked her for a while. I I I thought she really ran a gutsy gutsy race the last day. She was unlucky not to beat Romeo Koulio and if she'd beaten him, she'd be short in that and she is. I love her going back to Chelsea. Her two runs there have both been very very good. The better ground will suit her. the speed test will suit her and yeah like Matt's right Paul Tanner will probably ride COP to board but Danny Mullins you know he's top class rider as well and I wouldn't I wouldn't be at all averse to Cargazi going in there with a big chance for Danny Mullins on board as well >> yeah I do think I think Copek goes off of and just just beats Carzi who knows we'll see if Lamba wins I mean there there's a ponorous uh long-term form uh boost ahead of the champion hurdle who knows what he could go off um after his one run This"
    },
    {
      "id": "HIvSbQ8dagM",
      "title": "Cheltenham Trail Ep 11: Lulamba's Performance & Arkle Preview",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-10T13:31:47+00:00",
      "transcript": "You're very welcome. Along to the Matchbook Chatton Trail. Hard to believe it is four weeks to the Chatton Festival. Someone told me that and I genuinely had to double check it. It's the short February month. Happens every year. We've talked about it loads. It's just going to fly in. I'm your host Daniel and delighted to welcome Chatum Trends expert Matt Tombs and Racing TV's Doman each and every week leading up to the Chatam Festival. The guys, every week we're going to review the weekend with a view to the Chatam Festival and some Chattam trends. We're going to cover a race or two each week. This week we're going to cover the article given Lambbo's performance and also three eyecatchers each from the guys. But Matt, a bit of bonus trivia slash uh things to be aware of that myself and Don weren't on something changing in the cross country in terms of the handicap. So do you want to just give listeners and viewers uh things that it's not just related to Chattanoo Festival but overall for cross country starting from the 1 of January this year? >> Yeah, that's right. I think it's going to affect the cross country. It's a new rule for all handicaps in Britain. uh you can't run from further than 15 pounds out of the handicap and it' be rare it'll have much of an impact on the other festival handicaps but the cross country's only a 19 pound weight range not the full 26 pounds and equally importantly attracts highly rated course specialists. So Stumptown has a BHA performance figure of 163 for winning off 157 last year. So if he runs as top weight 163 then only horses rated 144 or higher will be in the handicap proper and any horse rated below 129 therefore wouldn't be eligible to run. So based on the current ratings that would mean the second home the trials day race shared delest 126 third escar 10125 six unanswered prayers 120 seven peaches and cream 124 placet as well 127 they'd all be ineligible to run now given last year six were balloted out the cup was 132 they might not have got to run anyway but I think there are more of them lower down the weights this year and there is a potential difference for punters if your antipost bets declared but balloted out, you get your money back. By contrast, if they're ineligible for the race, you don't. So, historically, that's been because horses are too highly rated to get into races like the Kim Mure with a 145 ceiling at the moment. They're expuned when the weights are announced. Here, the situation's slightly different. The likes of Jere can be declared, but then be ineligible. So, how would those bets be settled? Is it the case that you get you've been declared not got a run so it's the same as being balloted out you get your money back or is the horse ineligible and so not deemed to have been declared and the bets will be settled as losers aspect 365 they said they settle it as a loser so if you are antipost betting the cost country you do need to bear that in mind with horses like Jere when analyzing the race you need to factor in that plenty of the core specialists may not be allowed to compete so those that can maybe shorter come the Yeah, because it's an interesting angle. a lot of people obviously the core specialist now it's a handicap now people becoming a little bit more popular I'd say over the years they become more popular but that is very interesting and something I missed anyway that so for any listeners and viewers we just said we throw that at the start a little trivia we'll do this a weekly segment so Matt's going to find something each and every week uh to to fill us in in terms of information for the festival but very much looking forward to going through the show here today before we get going a reminder if you can take two seconds we see a lot of people subscribing to the channel for the first time for free through this these videos. If you can take two seconds, hit that like button and subscribe if you haven't already. It'd be much appreciated. And point you in the direction of our new Chatam signup offer. It's our most generous offer leading up to Chatam Festival. If you don't have a Matchbook account and you'd like to get involved, just enter the bonus code POD 100, POD 100, and you get 100 worth of free bets. Full T's and C's available both on matchbook.com/promotion and under the ticker there in just a second. So, that bonus code is pod 100. Uh Matt, let's start with you again. um just hit us with the trend for the deen and your thoughts on the race and has it set up the Gold Cup picture now finally we can settle now in for the next three or four weeks. >> Well, I wish it had set up the Gold Cup picture finally. We still got the debate about who's going to run. Factor file in particular, >> but this was good. I I liked Acura's performance here. Um since it became a grade two in 2003, 11 winners have run in the Gold Cup. Four have won. Two of the others been placed. 50% profit. The last to try clandis in 2019. So its influence has faded a bit in recent years. Just four runners. Despite the money for leave of absence, it turned into the match it looked likely to be. But long press had a hard race in the cot a fortnite before. He's a bit knowing these days. Jump left again here. Didn't really get into a rhythm. Um maybe was enjoying not being out of lead. Hard to know what sort of level he ran to. So it's hard to know what the winner achieved in his first win in a greater conditions race. But generally I thought he was pretty good. He was inclined to get into the bottom of his fences but warmed up better at the business end. You do wonder whether they might get him at it in the first half of a gold cup, take him out of his comfort zone. Ruby Walsh was on night. He was suggesting cheek pieces might help keep him focused in the early part of the race and I can see that. I think some trainers still associate headgear with ungenuine horses, but as we've seen with Masber at DRF can be equally effective with completely genuine horses who don't naturally concentrate. So if you ignore his bet flare bet fair chase flop then uh he apparently didn't travel well on the way up to Haydock. So he never went a yard. Other than that he's won six in a row of offenses over staying a marathon trips on a sound surface and deep ground. What underfoot conditions do you want in a Gold Cup? It's tempting to say deep ground to slow the others down. Um connections seem to think he'd want to say on surface. He's unexposed, keeps winning. You can't rule him out. Um horses who run in marathon chases two from 100 in the Gold Cup this century. One of those was Native River who won in a swamp. So my gut feeling is the market leaders will have a bit too much class for him. Uh but he's adds a fascinating dimension. I'm delighted he's running um 11.0. Fair enough. >> Yeah, Don for you. Any further thoughts? I mean, that's the general narrative. Just might lack a class for a Gold Cup, but look, he's he's going to be there on merit. >> Yeah. Know, he ju just firstly on the on the cross country chasing, I mean, it's an excellent point by Matt that Matt brought up. Um, I would have hoped that from an Nancy Post just thinking of it because I just learned about it from from Matt today. Um, if if you're if you don't qualify for the race, then I would have hoped that that would be money refunded. I I would have hope it would have been treated as batted out because you don't know until declarations how by how far you're going to be out of the hand. It's not like and not 145 red and 146, you don't qualify. You know that beforehand, but if you're declaring not knowing yet what the top weight is or by how far you're going to be out of the handicap. If you are, then you would hope that Conexis would get entry fees back and that punters therefore would get antib best refunded. It's a it's it's a watch and see and maybe different bookmakers will treat it differently, but I'd hope that that would be the case. Anyway, on Haley Color, yeah, look, um, what a what a what a fantastic horse he's been. Like, he won the the National Hunt Chase mark of 135 last year, then won the Irish National of 141, then won the W Grand National of 154. So, he keeps on going up in the weights and therefore uh being faced with more arduous tasks, but he keeps on delivering. And this was you kind of hoped and thought that he would go out and do something like he did. get into his rhythm. Sean Bowen seems to get a a great tune out of him that he just always gets him into his rhythm on front. It's going to be more difficult to do that in a Gold Cup. You would have thought and on better ground as Matt was saying that Rebecca Curtis did say that she'd like to get him back on better ground, but you just think that maybe he's such a such a galloper and such a stare. Albeit the Welsh National was run in unusually good goodish ground this year. um you would have thought that soft grammar will suit him well and if he just just gets into that rhythm up on the front end then yeah he's going to last there for quite a while and and um you suspect that at some point he'll be pass he could run a big race and finish third or fourth um but yeah great that he's in the mix lymp finished second balance tire last time in the cotful chase given him six pounds and he's run a a good race again that leave of absence ran well he was making ground on the leaders when he made a mistake at fourth last. Of course, he wouldn't have got to Haiti Kalor, but I thought he he could maybe be marked up at least a little bit on the bare form of that run. He's going to be better and better ground as well. He finished second. He was only just beaten by Deep Cave in the Silver Cup at Ascot on his previous run when Deep Cave got got up the inside. Um and Johnny who was back just back in third place that day. He could be a horse for the Ultima. He's run twice at Chelnham. He won the three mile chase at the October meeting there back earlier this season. So he's a horse maybe just to to keep in mind the Anthony Honeyball horses are are going well as well but yeah great to see how Dalor doing this and he's definitely in the Gold Cup picture now. Yeah, we we hope we have our Gold Cup picture, but as Matt said, we still don't know and probably won't know right up until um well, I guess entries deadline whether back to file will get supplemented for the Gold Cup, although seems highly likely. Of course, game spirit. Now, we are covering the article later in the show, but we did want to cover the race itself. And Matt, I I watched this live. You can do this with your trend obviously. I watched this live and midway through the race, I said, \"Oh, I'm not sure Nico can win this with the way he's traveling.\" And even if he does, it will be of a struggle. Therefore, the archaic pictures wide open. I wasn't quite expecting that last couple of um furlons when he just blitzed the field. So, it went from not an impressive performance to taking it all in context, a very impressive performance. Where are you at with Lambo? >> Absolutely fascinating, wasn't it? I watched this race a few times. Um brilliant. The trend is winners finished 511 in the Arle. I imagine he's going to really split opinion once the preview night circuit gets underway because he took time to warm up again. bit sluggish some of his early fences got into the bottom of some of the obstacles bit ski whiff at some sometimes when he's asked up he's high and a bit slow in the air jump the water like a presence wall on the race IQ data got the worst jump index of the six runners um now he may jump better off better ground connection certainly seem to think that and then as you alluded he was caught in a pocket and you think is he got the tactical speed to get out of this if you'd not seen him before you'd have thought he was really struggling at cross fence and early in the straight um some were saying that was in experience, but you think that was more about jumping at speed, taking him out of his comfort zone. And then he did what he did in the Henry VII was as if Niko would press the super booster button. You know, he power clear and jump better at the business end. And these were uh the weights low 150s horses beating in theory better than in Henry VII. I wasn't sure at Sandown whether the power he looked to have shown was a bit of an illusion given the opposition three beat all be beaten since but having watched this I'm more convinced that he's a top class horse in the making. So the question is about trip which we'll get into more detail when we get to the article preview later on. And Liberty Hunter is worth a quick mention. He was creeping into the champion chase from the rear last season when coming down tipped up in the schlower and looks like he's been in a bit of a rebuilding process. two runs since his holdup style isn't suited to an old course grand annual but if they decide instead of going for the grade ones to go for a big handicap I think he's got one in him off 151 yeah Don for you again similar like you have to be overall happy very happy with Lambo's performance but there was worrying signs the way he travels so it will bring that trip question that we will cover a lot in in the article preview >> yeah for sure and you know like you watching it live I thought he was in trouble going across the even even leaving the back straight. Nicola Bundville had to give him a little bit of a shake and then over the cross fence before they turned for home. He was along the inside. He didn't have a lot of racing room. Calico kind of came in towards him. Didn't cut him off and I left him enough room to go around the bend on the inside and then yeah after that his his turbo kicked in. Um very similar to Altior in lots of ways, but I had a look back at Altior's first game period win and he he led from from from early that day. He always traveled but then you know the Alor that we come to know and love later in his career. He was the one that you know looked like looked in trouble before his server kicked in. But it is really interesting. He lamba will not have the luxury of doing something like this in an article. You would imagine like the winning time for this race was 4 minutes 10.96 seconds. The winning time for last year's article was 3 minutes 53. So what 17 seconds slower and heavy ground over two miles and a half of furong at Newbury different ball game to 2 miles in an arc. all. We don't know yet, but you're kind of assuming until we know differently, it's going to be good to soft ground. So, and given given the way he runs and as Matt was saying at Sandan as well, he's probably going to hit that flat spot at some point and then it's just a case of when when he comes out of it and therefore how much how much he's going to be able to pick up better horses in an article. Like, it's it's shaping up to be a really fascinating article this year and we'll come on to it. I'm looking forward to getting stuck into it later on. Um but Lu Lamba yeah like and look you have to remember it's only his third chase. He was only beaten once over hurdles in the triumph hurdle when panas beat him by a neck and he exacted his revenge and panoras punches sound. So look it goes without saying he's a top top class horse. But I just worry about taking a short price to bat for an aral that on especially on good to soft ground that he just might get out paced at a crucial point in the race. Yeah, interesting comparison with Altier because obviously that's the easy comparison but if his first game spirit is completely differently ran then you know that was only later in career that that does raise a few doubts. Um let's go opera hat race Matt or sorry Don and start with you on Dino Blue and now the mayor's chase is fascinating because this show is looking forward to the chat festival of course especially with four weeks to go. You've got obviously Spindleberry coming back in. Um you've got Dino Blue like the tried andrusted. Where is she at versus previous years? because I think that's what most betterers and punters want to know going into this year's mers. >> Yeah, look, you think she's at a similar level, Dan? I'd say she's a nineyear-old now, just turned nine. Um I don't think we learned a huge amount from the upper hat chase. She's she's won it again. Um won it last year. She was meeting Mayors that were rated vastly inferior to her. Like she's 159, Bioluminescence 142, you have stitch is 130 and then Jetport is in 120. So she was sent off an 81 on shot. I think she won like an 8 to1 on shot should win. Um, whatever whatever an 8 to1 on shot is and what whatever performance it's supposed to put up. But she did it. She did it well. Um, so she's she's bang on for the the mayor's chase. Yeah. Look, I'm sure we'll be doing the lane the mayor's chase in detail in the future, but panic attack is 147. She's a really progressive Mars, so it's going to be interesting if she does take a chance there. Spindleberry is 154 and yeah, look, she's going to have to bounce back now. It was a it was a big ask going and running running on an Irish Gold Cup. It never happened for her. She didn't seem to really get into her zone at all. She was too keen stepping up in trip. Um and in in in on the positive side, she didn't have a really hard race there. She was pulled up quite early in the race. So hopefully she's going to be able to bounce back from that and remain a big player in the Mar's chase. But yeah, look, I'd say Diana Blue, I don't think we learned a huge amount about her here. Just that she's healthy and well and on track again for the Mar's chase. >> Yeah, Matt. anything we learned because I think that's the the question is like punters want to know this year versus last year interested Don's like pretty similar level I mean are you happy with that and a little bit of improvement because people were getting quite excited by her performance there yesterday or during over the weekend >> yeah I'm not sure she's really going to be improving at this stage um but as you guys have been talking about is she in the same form because she's had two penalty kicks since being five lengths second to founder 50 in the for where a blunder cost her she'd gone very close might won but for that so you know she's well in herself but a nineyear-old in a fourth season chasing I'm always a little bit wary of May with that profile for all this has been a a really good uh trial for the mayor's chase in its short history the five winners have all run finished 2-1 are 4-1 um so I just holding fire a little bit for betting in the mayor's chase it as Don was saying looks a deeper race this season and there are some interesting horses in it he's covered them one who I've got a bit on my radar is D.A. Luna, still a novice. I thought Ben Pauling wasn't that keen to run in this, but in his racing post stable tour, he suggested that's the most likely target at the moment. So, this is a race that's starting to bed down the mayor's chase. Dino Blue sets the standard, but 2.75, I can see this being a a more competitive field against her this year, so she might be making the market. I suspect I'll be trying to take her on. >> Okay. Yeah, lukewarm on Dino Blue there, but great to see her back and she will be heading to the mayor's chase. Now, one horse we don't know exactly where he may go after the back of this performance. Don is from the William Hill hurdle is Tudu Quanti here um in that heavy ground obviously is not going to be a champion hurdle trial. But at the same time, these horses not entered in the races they could potentially be in and have to be supplemented. It's just adding more intrigue to the Chatam Festival though frustration as well. I mean, what is it about these? Obviously, entries cost money, but for big yards like Paul Nichols, you think they'd keep their options open a little bit for just in case you see a performance like this that means he may have a place chance in the champion hurdle. >> Yeah. I don't think we could have seen this couple. I certainly didn't see a performance like this. >> Not like this. Yeah. Yeah. Yeah. >> Like he he carried 12 stone to victory and doing the piece for the Irish field beforehand like going back through the waist. Persian war is the last horse to carry 11 stone 13. So he carried it. Now I know it was a way less classy race than we have had like we you know we've had some brilliant renewals of the William Hill hurdle. Um Mestan won it in 97. Measan actually carried a 4 pound penalty for winning the Lanzerati hurdle that back in the day when the Lanzerati hurdle was run over two miles and then Madonna won the champion hurdle. Persian war. He won it off 12 stone and he was so good he won the next three champion hurdles including the one a month later. towanti it it wasn't as high a class of handicap like he's he's only rated I say only but he's 138 was top weight of 12 stone so it shows you the class of race that it was but that said it was a fairly it was a wow performance I know performances and and winning distances can be accentuated on this type of ground and it was really heavy ground at new or it looked like it um but he got out in front and you know as people often make the point we kind of think big weight it's harder to carry on heavy ground, but actually on heavy ground, class comes to the four and he's he's he's obviously well he was the classic horse source in the race according to official ratings and he proved that again. Um yeah, just got out in front and went further and further away. Won by what 15 or 16 lengths in the end. So he was off 138 here. He's up to 151 now. He still has a fair way to go to be a champion hurdle horse. He's only had nine runs over hurdles. So um he he's got the potential to improve again. He was rated 130 when he won the Jerry Field and he won that well as well. I got eight pounds for that. So, he's 151. So, he has to he's going to have to take another leap again to be a champion hurdle type horse. And I suspect given that this performance has come on this type of ground, he would want the ground to be soft. But I I'd say connections, they don't have to make a decision until 5 days beforehand. Um they'll wait to see what the ground is like. And if it's looking like it's going to come up softer, heavy ground, then every chance they should they would supplement him. And I I would say that they should um on this performance. He's got the potential on this ground to to go and at least take his place in a Champion Hard lineup. >> Yeah, I'm no weather expert, but it's still raining in in Ireland anyway. I don't know about you guys. Um so surely it's it's odds on it will be there will be obviously soft in the description on day one, but it could be a little bit towards heavy um depending on the watering tactics if any. Matt, but we won't go down that road. Tell us a little bit about this performance. Uh, and it is it is that point Don makes and it's been around for years and years, but heavy ground tends to exaggerate those winning distances. I think of a lot of Welsh national winners. You know, would they win that on a on a good ground regardless if the horse is suited or not in terms of the distance from the previous horses, but you still got a, you know, a win like this is still an incredible performance. >> Yeah, real real routing of his rivals, wasn't it? Um, like Don, I didn't see this coming. Uh, but he has improved leaps and bounds. very much you the ditch it way very patient and when horses aren't you that mature he ran this horse in the supreme last year now that probably really helped his development even though he wasn't ready to be competitive then um I think just on the the weight side of things for most of this century the top weight was 1112 it got changed from 12 stone um about 25 years ago and it's only just gone back to 12 stone so that's one of the reasons but as Dom was saying it's one off 138 in great style here. Make a stand won this off 140. We've had other handicaps uh winners coming through to win a champion hurdle. Epaton 137, Rock on Ruby 145, both in the Jerry Field and now that is earlier in the season. Um but this was as an impressive performance as any of those are put in. And when a progressive young horse wins a race like this, hard to know what they're capable of. You know, to put it in context with the mayor's allowance added in his mark of 151's exactly the Mark Golden Ace brought into the champion hurdle last year. And you know, it's a it's a weak champion hurdle. The favorite the new lines fallen and then won a weak buler in workmanlike fashion. There's no horse to be afraid of here. So, if he is very ground dependent, fair enough. You wait until, as Don said, five, six days out at the confirmed stage to supplement him. But I wouldn't want to be laying 21.0 with a run. I think if he does get his ground, I'd be very open-minded about the ground. You only need a week or so of dry weather and with the drainage there and it'll it'll dry up to lovely ground. But if we do get um a wet run up to Chelham, the water table will be so high we could get genuinely heavy ground. And picking up on your point about um the distances that horses get spread out on heavy ground. Sometimes when a winner spread eagles a field like this, all the attention's on them. But it's worth noting Wellington Arch beat the rest by 18 lengths. Had the winner not been in the race, we'd be talking you logistically about his performance. Now it could be the winner handed the ground much the best, no better than a smart handicapper, in which case Wellington has just run okay. But in some ways it reminds me of the the 10 up nine years ago when ac cappella bourgeois made all one by 32 lengths and all the discussion afterwards was whether he was therefore an outstanding novice so the one to beat the Broadway or whether he'd been given a freebie it was grossly flattered and it turned out to be the latter but what punters and me included missed was if he had got a freebie when you took him out road to respect to won the other race by 11 lengths >> yet because he'd been beaten a distance he was basically left on the same mark bolted up in the plate of 145 and went on to win three open grade ones. If you take the winner out of this, you know, Wellington Arch has been kept on 132 and he was taken out of a couple of races early in the season because testing ground. So, he might improve again on a sound surface and this has produced three winners of the race formerly known as the Coral Cup. Um, he could be under underestimated in that. He stays that trip well. He's 34.0 for that. He's one to keep an eye on. >> I like that, Matt. I do like that uh that argument. Yeah. going back nine years to find a similar um to suit the argument. However, I I the ears picked up when I heard Road to Respect's name versus AC capella bourgeoa. Let's go to the boy hurdle at Don and I do want to start with Staffordshire. Not I don't know if anyone else is talking about this but he was entered and declared for a handicap in Leopardtown and then the following week he's winning the boy hurdle. It sounds like that probably was just the plan all along and seeing who came third in in that race maybe proves that point. But it's he is a high class um hurdler, distant hurdler now. >> Yeah. No, he was um top in that handicap at at Leopardstown and he was on my short list for the race before he was taken out as well. But yeah, like what a what an an admirable horse. Um he's he's really found his mediate this this year or this season. Like he he this previous run he was only just beaten by home by the Liam the Galoy Hurdle beat a half length by 159 rated Hurder who was giving him nine pounds I think he was giving him. Um but big performance he won a pre attempt qualifier at Punchan earlier in the year. So he is qualified for the attempts. um and then come on here and the race probably wasn't run to suit him. Maxim got a little bit of of an easy lead at a finishing speed of 107%. But um and it did look like maybe Maxim when he kicked on over the second last that he was going to have them all in the stretch. He won the race last year Maxim but Stafford not we know his attitude. We know how he likes to dig down deep and he's gritty and determined and stayed on really well up the hill and won well. Yeah. Um he's he's got a mark of 147 now. Is he a pretense horse? I'm not sure. He's looking more exposed than you'd ideally like to see in a pretense final horse, but um if he does go there, you know he's going to run his race. Pretends can well it can be a little bit of a grueling contest. Not always, but it can be. And if it turned into that type of test, then you definitely want a horse like Stafford Chernel on your side or that that type of test could suit him. So, he just keeps on improving. My worry about him going going into the race is that he'd had a couple of hard races in a row and the gal I hurdle run on heavy ground on Testa's chase day or park. It's always a tough race but he he bounced out of it just two weeks later and was you know appeared to be as fresh as as fresh as ever there on Sunday. So no brilliant performance by him. Thought Maxim ran well and this is kind of Maxim's time of year that I I just keep Maxim in mind for something. He tends to pop up between kind of February and April. So, just kind of keep him in mind. Like when he won this race last year, he came into the race on the back of a couple of poor runs. Same this year, but he's bounced back to form here. Look, he's nine years old now. He's not getting any younger, but still a horse who there might be a prize in him yet later on in the spring and better days ahead. Like, he ran a massive race. It was his first run since the Irish Grand National last year back over hurdles. He's got a a chase mark of 153. He finished uh second in the or third in the brand advisory chase last year. He won the 10up on this day last year. He's actually got an entry in the Ryan Air Chase, but I think the Grand National is the plan. And with this run under his belt, yeah, he stayed on well to take second place to get the better of Maxim for the runner up spot. It was a Gordon Elliot one, two, three. So yeah, I'd say he's he's one who's going to be a player now in the Grand National as well. is in kind of still an a relatively unexposed horse at this type of these type of staying trips. >> Okay. Yeah, Matt, for you. >> Yeah, definitely echo what Don said about Sino and Maxim. He'd definitely be the horse pop up and often at a big price um in a a race over the next couple of months. So, he's one for your tracker. This hasn't been a stairs hurdle trial. Runners won from 23 um and the last uh home Hidden Valley Lex anyone entered in the stairs. So, that's probably not going to change. But overall at the festival, six from 77, 81 point 123% profit, produced three cross country winners, two Coral Cup winners, and an Albert Bartlett winner. And six of those seven in the last nine seasons, five trained by Gordon Elliot had the first three home here. So I still think it could have a some relevance for the festival. Um Staffordshire not, it's interesting about the potent final. He could be up in the um early mid50s in Britain. you normally get about four or five pounds um from the BHA handicapper and there are very few horses qualified for the attempts who look like they've got any chance of running who are rated much over more than about 140. So whether he runs or not could make a big difference to the shape of the handicap there. There are still qualifiers to come at Haydock Chepstone and Nace. So it might look a bit different after that. Um but that's a thing to keep an eye on if you want to bet on that race and better uh better days ahead. Yeah, I agree. I think we run a blinder here and at first sight the Broadway form looks terrible, but Becky Watson looks a national project. Stella story has his ground yet. Gorgeous Tom's ran okay. I'm second in the intermediate down royal fourth in the Coral Gold Cup of 151. Better days ahead. Gordon said he's hard to get fit and he ought to improve a fair bit for this. I kind of thought that a soft ground ultimate might suit him off about 155. There hasn't been an Irish train winner of that for 20 years, but I thought he'd be ideally suited to it. Sounds like the Irish national might be the plan. That's a a much tougher race and this century only juke of 153 has managed to win that off a mark in 150. So be a much bigger ask, but I do think there's a big race in him later this season. >> Okay, we'll move on to the kingmaker Matt and stick with you for your trends and still making it three from three over fences. Interesting artle contender >> definitely and I really hope he runs in the Arle. We need these horses who, you know, he's about 17.0. I think the price is about right. But these horses who won the big pattern races, the big trials, we need them to be coming to Chelham and not going elsewhere. Um, if Chelham is going to be the the Olympics or the sport we want it to be. The history of this, 16 winners have run in the AR 216 were placed. Couple of out of the eight runners have won the grand annual. Um, hiding in a conditions race can be a good way to get yourself handicapped as a novice. only three runners effectively of game two with Mambo number five jumping falling apart. He got behind in the Waywood Lab but his class got him out of trouble there but he he's not going to be a two mileer and he has had the four runs over fences now so he's eligible not only for the Jack Richards but also the plate he's still off 146 after this it could be well handicapped and Ben Pauling in that racing post stable tour talking about both those races I think he could improve a fair bit for the step up in trip um I wouldn't want to be laying 51.0 zero for the Jack Richards. I don't think he's quoted for the plate as yet. So, he's one to keep an eye on. I'm still Ally. He was left, I suppose, with a simple looking task once Mambbo number five had jumped his way out of it. He won decisively without looking a superstar. Did screw at some fences. He isn't the biggest to be jumping out of that ground. So, maybe back on a sound surface he'll improve. Um, he had plenty of hurdles form on better ground. And his three chase starts been on soft or worse. So he's the type who might improve a lot on spring ground and therefore be more of an arc or contender than the bare form would suggest. Um let's hope Dwaters uh allows him to take his chance. Um Mirabad's fourth run over fences and he was still competitive until the business end. He's eligible for the grand annual uh and left on 138. He looks a player in that. His positive run style well suited to an old course grand. So for all that's a notoriously unpredictable race. He's 26.0 zero and definitely one for the long list for the grand annual. >> Okay. Yeah, Don, any further thoughts on the race? >> Yeah, I fully agree on on that on what Matt said about Verbat for the Grand Annual. Um his running style is key. That's it's a race in which it is difficult to make ground from the rear. He likes to get out in front and actually until going around the home turn. He was he was still in there with a chance and the steel alli did move up on his outside at the second last and while it took him a little while to get past him, it always looked like he would. But Mirabad jumped well at those five fences down the backstretch at Warick. They suited him really well. His jumping was good. It's only his fourth run over fences as well and his chase mark of 138. It's only five pounds higher than his hurdles mark. So he could be a well handicapped horse and you can just see you can see him in a grand annual. Novices have a good record in the race as well getting out in front and rolling away and yeah seeing if they can catch him. Steel Ally. Yeah, I'm sure if the two mile two and a half mile novices chase at Chelton was still there he'd be running in that. Um like he he the grade two race that he won at last cup before Christmas is 2 miles three. He finished second in the national spirit at Fontwell last year that's two miles three as well. He's only beaten the neck in that. So he's a horse who stay stays this two-mile trip really well but gets further and is probably better over further. That said yeah hopefully he does go and run in the Arkle and um you kind of wonder how we had so many horses to run in the Arkle and the grade one two and a half mile and the brand advisory chase. The answer is we didn't and even even now the Aral fields are small but hopefully he does run in. I I can see him winning at Aral. I think their pace your horses in there but he definitely deserves his chance to to to in the lineup and and to make the lineup yet. It's uh it's been a great change I have to say and I think finally this first year I I think a lot of stars have aligned a little bit in terms of a little bit more competitive in terms of there's no standout standout horses from both ends particularly after final demands defeat but it does seem the novice chases are more interesting this year. Uh, another interesting market, Matt. I was looking through it this morning. The Turners novices herd of the bearing Bingham and a lot of very competitive price because we don't know exactly where every horse is going to go. Active innocence very impressive there over the weekend. >> Yeah, as you say, it's an really interesting market in the sense that for me, the Supreme and the Bearing Bingham are for the speedy novice, the Albert Bartletts for the stairs. Even though you you might think with the Bearing Bingham trip that was more akin to the Albert Bartlett, but yet so many of the best noviceses, the speedy ones, they all seem to want to run in the Supreme. So the Bearing Bingham might be a market for a bit of value. Winners of this have not done well. 5369756 in the Bearing Bingham. And I often talk about how that's a test of speed at the trip. And so those with a two-mile graded form do so well. Flip side of that races like the Sydney Banks often produce winners without the required turn of foot. But that said, the feeling that active innocence was only in this because the same connections old park star had stamped himself the leading two-mile novice. Originally Nikki's plan was that act of innocence would be their two-mer. So perhaps he does have the turn of foot for a bearing bing and they went pretty steadily here. Finishing split 107%. He did quicken up much the best and when he put plants at midnight away easily, albeit at the temp of the race, he was nothing like as far clear of him as Idaho Sun was or even Park Star. I'd just be a bit worried about the fact he couldn't give the juvenile Manila Yoga 20 at Newbury. Manella Yoga was getting three pounds from Maestro Ki and five from One Horse Town when just a solid three lengths third in the finesse. you know, unless those two are triumphant winners or placed horses, you want to be beating a Manila yoga on those terms if you're going to win a typical bearing Bingham. Um perhaps given the history that that Newbury was Manella Yoga's gold cup, but active innocence as a contender, what looks an open bearing Bingham. Um but 13.0 looks about right. I thought it was a good performance, but it didn't blow me away. Yeah, maybe for act of innocence, Don, it starts with if you can explain the Newbury defeat and justify it to yourself, then he becomes a lively contender for the Turners. >> Yeah, the kind of the key for me in the Newbury race was that Manelli Yoga then went and got beaten in the finesse. Um I thought at the time that Manella Yoga just could be very very good and he still could be good. Um but I just yeah the form of that run just didn't work out. If Minnelli Yoga had gone and won the finesse and won won it impressively, then that would have obviously added balance to active innocence's run. Um but yeah, look like Matt, I thought he did it well. He traveled well. He picked up well. He won nicely. Um but like Glance at Midnight was well beaten in the Formy behind Idaho Sun. Um Sinatra was maybe a little bit disappointing. Finished behind Active Innocence in the the Newbury race back at the at the Carl Gold Cup meeting. um and one at Sandown next time, but was pretty well beaten here. But like yeah, I I think Active Innocence did it well. And it was interesting as Matt kind of alluded to the Nikki Henderson was saying afterwards that not so long ago he thought that this horse was the faster horse, faster than old park star and now they've reversed. So old park star is the pacey horse and active instance is the one who goes in the Sydney banks and then is on track for the Turners. So, you know, you can that it's interesting that that's happened. But again, as Matt was saying, I I always think that the Turners, it's a speed test over the intermediate trip and the Supreme is a kind of a stamina test over the minimum trip. So, pace is important in the in the Turners or the Bearing Bingham. Um, but yeah, you can see Active Innocence running and running well without maybe being good enough to win it. >> Okay. And final race, the Apples Jade um May's NASA hurdle and um just a new justified favoritism. Don, how impressed. Yeah, she was really impressive, Dan. For me, she couldn't have been much more impressive. They didn't go a great pace, finishing speed 113%. Um, now she was well positioned by Brian Hayes throughout. She was just up on the outside and she picked up well like she she'd won well at Navan the time before that won a handicap, beat a grank, who was a good handicapper. Um, probably better over fences than hurdles, but she beat him well off mark 120. She actually traveled into that race. This is the her penultimate run better than her than her finish if you know what I mean. She looked like she was going to win nicely then came under ride then looked like she might not win at all but then she she stuck it stuck it out game and stayed on well up the hill at Naven again. Same course and distance for the apples Jade a listed race listed novice mayor's novice hurdle and she won it well. She quickened up nicely. She came away interested in Colin Murphy saying afterwards that he thought that she'd get further and he was talking about the Albert Bartlett hurdle and that's interesting because if she does get further, she's better over further then yeah she's she's definitely an interesting contender. It's great to see Colin Murphy with a couple of good horses here at Savant ran really well at the Dublin Racing Festival as well. She was unlucky not to win probably. Um but Sen, yeah she she she got seven pounds for that handicap hurdle win. It's got a mark of 127. she was entitled to go and win well but she did it as well as you would have hoped and maybe even a little bit better. Um thought the runner up is an interesting mayor as well like she was she she won her bumper at Chelton back in April. Then she joined Willie Mullen. She was beaten by Ala Glass at Punchan on her previous run where she did nothing right. She jumped to her left. She jumped poorly. She lost ground in most of her flights and kept on was beaten I think five lengths in the end by Raer Glass. And interesting that they put her in at a shorter price that I'll raise a glass here. So, the market thought that she would reverse places. And she did. Going left-handed probably helped her. She was a bit out to her left again, which is it's not as noticeable or it's not as big a negative obviously on a left-handed track. Um, but she didn't jump well. Well, she jumped a little bit better than she had a punch, but she still made some really bad mistakes. So, she must have some engine to keep on to take second place in front of. I'll raise a glass and my lucky Colleen. Um, so that was only her second run over hurdle. She hasn't won yet over hurdles and interesting that Willie Mullen's put her into a listed race even though she's a maiden. So look, you can see her going and winning her maiden now. All going well and if she can just jump a little bit better, she could take a good step forward put so she's one to keep in mind. But no, I thought Zenous was good. Great for Colin Murphy and Brian Hayes and that's I think that's her third win now in a row. So she stay she stayed well and yeah, she could be even better over further. >> Okay, one to keep an eye on and M for you. What sort of trial is this race for the dawn run in the at the festival? >> Had five renewals of this uh so far only two runners but brighter days ahead did finish a good second in a very slowly run dawn run. Clearly this is over further and whilst the dawn run they tend to go quickly and it's quite a stamina test at the uh two mile one trip. Um this often can be for more for stayers and as Don said Zenous definitely falls into that category. Um, there hasn't been a runner from this in the Albert Bartlett yet, but that could well change. And Colin Murphy is one of my go-to trainers at the festival. Um, just partly that he's a top-notch trainer, per se, but he's very selective about what he brings over. Since his first runner, Brave Inca, won the 2004 Supreme, had just 24 runners. Five of one and nine of the 19 losers were placed. So, if he's going to bring Zenous over, that'll be his first runner since Impervious won the mayor's chairs three years ago. need plenty of respecting. I wouldn't want to be laying the 34.0 with a run in the Albert Bartlett. Um, and he particularly got a good record, May Better Lady. Uh, so she handled the deep ground well enough here, but Colin was saying afterwards he thought not only would she improve for the step up three miles that at three miles the better ground might suit her well. Um, so she's in the mix for what such an unpredictable race. She's one I'll be keeping an eye on the vibes about. There's a two-mile sixth grade three mayor's novice at Limmerick around the same time as the festival. So, she'd have that as an alternative, but if she does line up in the Albert Bartlett, she shouldn't be underestimated. >> Okay. And that concludes our weekend review. We've got eye catchers there. We'll just sort of bring some of those other races there that we haven't covered. So, Don, I want to start with you with your three eye catchers. >> Yeah, we'll start with the wallpark from the 10-up chase, Dan. Um and like first of all on the 10-up chase, brilliant for Oscar's brother, brilliant for the King brothers, Connor King and Daniel King. Um JP Mcmanis has acquired Oscar's brothers since we saw him last, but he was really good in winning the Florida Pearl Chase. He beat Cocktail Dean in that. And boss of the Brownies. Cocktail Dean was impressed with winning his beginner's chase at lean over Christmas. Boss of the Brownies ran a big race behind Arena Boy in a grade three race at Nace next time. So the form of the Florida Parl is solid and he went in here. This was this was his first run since. But Daniel King, he he didn't seem to have any worries at all about his fitness because he he kicked him off in front and that's how he likes to race. So he set a good pace. It was a sedate enough pace that he set, but his jumping was good. Bar the third lass. He just got into tight to the third last fence and they kind of closed up on him a bit. It looked like western walk maybe was coming to challenge but then Daniel King just gave him a squeeze and away he came again. A Connor King only has two horses. Greg Judes the other one. He ran a big race as well in the previous day um at Nace as well. So um but you know he's proven here with Oscar's brother. He was he was a good hurler. He stayed on well to finish third beaten like a head in the neck or something in the that good stood and he got hurdled over three miles in a furong at Navan. So he stays really well and he stayed well here. Um he's got he's got lots of options. It was really interesting that they entered him in the Grand National, the entry grand national. This was only his fifth run over fences. He's still a novice obviously, but he's got lots of he's got all the novice options as well now, and it's going to be really interesting to see how he goes. But really, really great for Connor King. He's just got a handful of horses um to produce Oscar's brother to win this and win it well, but the wallpark was the eye catcher from it. Not I'm probably not alone with the with the the eye catcher from this race, but like just the way that he stayed on to take second place in front of Western Walk. Now, his his finishing effort might have been accentuated a little bit because Western Walk didn't seem to get home. My thought going into the race that he would see it out. He finished third in Western Wases finished third in the Faheen chase behind Gold Dancer and final demand when it looked like he'd get further. But he seemed to run out of stamina here. He's a half brother to Churchstone Warrior who also won won the 10-up chase for Jonathan Sweeney his trainer. Um but I think Western Walk could maybe step back down and trip the wallpark of fences. He's now got a chase mark of 142 which is 13 pounds lower than his hurdles mark. He was such a good hurdler last season for Gordon Elliot and Jeffy McManis. Won a pretense qualifier at Sheldon in October, finished fourth in the long walk hurdle, finished third in the stairs hurdle and fourth in the Liverpool hurdle. So he competed in all those high class staying hurdles. Um and at at Goran Park on his previous run, he went around the inside for most of the way probably in the worst of the ground. So yeah, look, he could be a he could be whatever whatever he goes for an ultimar national hunt chase. He's just a potentially really well handicapped horse over fences now especially compared to his hurdles mark and he stays really well. So you think the national hunt chase could be the race for him that the test of stamina there over three mile six could suit him really well and the other two then are knight of alen in the who finished second behind hollow queen in the novice of chase at Newbury. I just thought that this is over two miles seven and a half furlongs on heavy ground. It seemed to stretch his stamina beyond its limit. traveled best of all into the race, looked like he was going to be a player. Then Holloway Queen, she stayed on best of all and ran out a really good winner in the end. But Night of Alen, he finished fourth behind Miami Magic on his previous run on New Year's Day when that was a race that was run at a really sedate pace at a finishing speed of 111% and he was out the back early on and he stayed on really well to take second place. That was 2 and a half miles I think. Like he won at New 2 and a half miles back in December off a mark of 122. He's only 127 now. So either a drop back down in trip or the move to better ground or maybe both could suit him well. And I was kind of thinking the great wood that greatwood handicap chase at Newbury in March could suit him well. Two and a half miles at Newbury um where he's proven. But I think wherever he goes now, Jane Williams trains him that he'll be interesting with with not as stern a test of stamina as three miles on heavy ground presents. So maybe three miles on better ground or two miles or two miles six on even on soft ground should suit him because he handles the ground. Okay. And the other one then is Powerful Patty from Thurless on Thursday. there. He was um he was he was in the morning it looked like he was the second best of the Willie Bolan's horses, Brian Hayes riding him and he was he was he was a bigger price than the Paul Tannon horse Fudwa but he was actually backed into favor. He was sent off as marginal favor 2.5 just in front of Fueta but he again he traveled well and he was just starting to stay on when he made a really bad mistake at the second last flight and I kind of took my eye off him after that. I thought he was he was well beaten but actually he stayed on really well to finish second behind Puma's dream who's actually a half brother to the aforementioned Maxim. Um but powerful Patty yeah he was entered in he was entered at Lan Mal now on Thursday but I see he hasn't been declared for that. So this is his first run over hurdles his first run for Willie Mullen since joining from Alan McIntary had four runs in bumpers but I think he should he's a maiden hurdle winner in the waiting and then after he wins his maiden he should be able to move on to better things. Okay, the wallpark night of Allen and Powerful Patty for Dons. Three eyecatchers this week. And Matt, before you hit us with your eye catchers, a little bit on the wallpark race and the tennup race. And the wallpark's well and truly the talking horse after the race on Twitter for sure. And sometimes these horses are over talked, so therefore the lazy, not lazy analysis, but someone like me is going to go, well, they're clearly going to be overb next time. But everything is is run on its merits and every price it's based on the field he's up against. Where is he likely to go? Well, I think there's a bit of history there that might guide us. Um, a few years ago, there was a real trend in the ultimate for grade one hurdlers to win as noviceses from miles below the hurdles mark. Witch lineman 14 pounds lower on 142, Ben Salem 10 pound lower 143. Holy 12 pound lower 145 and Tomor 2 15 pounds lower 148. And I got the impression after on 21 years ago, a line was drawn in the sand. No more handicapping these grade one herders on their chase form. Yeah, it's a conundrum for the handicapper, but I think you have to go that way. The only hurdle can be minded over fences, try and get a lower mark. But when they're rated so highly over hurdles, it's just in fighting handicap plotting in the novice chases. And then you pop some head gear on for the handicap debut, more positive tactics and hey presto, the horse improves a stone. And so personally, I'd be giving the wall park 155 the same as his hurdles mark and saying there just isn't enough evidence to give him a different mark over fences until you can see what he can do over those obstacles. And they did something similar with good time Johnny a couple of years ago. So if connections feel he's a slow learner who needs more time, they just keep running in beginner's chases and put him in a handicap once he's got the hang of chasing. Um so I think that it's pretty unlikely he's going to get into the Kimure or the National Hunt chase. If you're going to do that from what we were discussing earlier, you if he's balloted out, then you get your money back. But if he's over the 145, you don't. You definitely want to be taking non-runner no bet out him at the moment. >> So you're you're saying he he Do you think the handicapper will rate him 155? I know you say that's what you'll do. >> I think there's a good chance they will >> more likely than 145 for example. I saw someone tweet saying one to 10 he'll be over 145 which I thought was about right. I I think so because there's an element of you put him in 146, but then he's in a great position in the ultimate. >> Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. >> So, yeah, I think you've got to try and do that. I mean, you I watched all four of his races um and he's not really been put in them, has he? You know, he ran on here and that was definitely a more encouraging run. I just don't see how you could give him a handicap mark and uh you know, a stone lower than his hurdles mark on the basis of that. >> We'll see. We'll see >> too about it. Anyway, three >> my first eye catcher is one who's equally obvious I should think that everyone else will have seen that was Saratoga. Now that's in that rated juvenile at Nace on Saturday. Um the one that from its eight renewals has produced four winners of the Fred Winter. So a lot of people have been watching that 3-1 at Nace and both the first two uh be possible Fred winter horses I'd have thought but Saratoga 3/4 of the length second given a considerate ride. He's got his three runs in now, so he's eligible. He was a 92 rated flat horse um and in receipt of seven pounds from the mayor. Be fascinating to see what mark he gets for this. Cut the Fred Winters between 119 and 122 in each of the last four renewals. So he could be nicely near the bottom of the weights. We'll see. And last week I put Porig Roach's with some lose some up as an eye catch. The yard's just coming into a bit of form um having been windless since October. So yeah, he's very short in the market. I wouldn't be suggesting backing him, but he's I can see why the bookmakers are running scared of him, and he's one you need to have on your short list for Fred Winter. Second one's Holly Grove Cha, who reverted back to hurdles, made all in good style, nicking a few lengths at the start to beat the 139 rated Jubilee Alpha by four lengths in a two mile five listed mayor's race at Warick. This made a mess of her hurdles mark. She's raised 11 pounds this morning to 140 over hurdles, but just4 pounds to 133 over fences. And she didn't look to get into a rhythm at Windsor's figure of eight track on her latest chase start. But her previous form looks pretty good, having beaten the winner there, Bluey, and run well in the receipt of lots of weight in the Colin Parker. And she hasn't run over a conventional left-handed course over fences so far. Given how she jumped at Exit, she might improve a lot for that. But Jamie Snow seemed pretty cool on the prospect of going to Chelham. Uh she didn't run well in the dorm run and he says that she's more like to mix it between hurdles and fences. She's had three chase starts so she'd be eligible for the Jack Riptons if you had a change of heart but she's won for the notebook. I think she can win more races this spring especially if it keeps raining because she does handle testing ground very well. And finally Barton Snow who made it six in a row since joining Joe O'Shea a year ago. He beat the now 140 rated Virllair at Stratford. Gone from strength to strength and whilst he stays this three miles that he won over here, he might prove best at shorter. He won over two miles at Chelton's Hunter Chase uh meeting in May is trainer Joe O'Shea's Britain's answer to Barry Connell. He said that Barton Snow beat Constitution Hill in a gallop and that he's a certainty for the entry fox hunter. Now to be fair to O'Shea, he has trained two of the last five winners and cousin Pascal went off 67.0 0 Graas deb and last year 23.0. So perhaps we should be paying more attention to what he said, but on both occasions he booked one of the best British amateurs to ride, James King and Hugh Edwards. Both of those did ride Barton Snow last spring. I doubt he'd go to Chelnham. I don't think he'd get the trip, but he's definitely one for the short list for entry. Um headed carriage would please everybody. Looks like he takes a bit of handling, but if King or Edwards is booked, I could see him being a big player in the entry fox hunter. >> Yeah, interesting with with what you've outlined there. what prize you'd go off. Barton, uh, Snow, Holly Grove, Chacha, and Saratoga are the three eye catchers for Matt. Time to move on to the article and we will cover this from an anti-post perspective. Don, I'll actually go to you first and then might come back to Matt's trends and then final selections from both you guys. But Don, um, just the prices that we currently have a matchbook Lamba 2.7, Copic Debor 3.7, Cargi 7.8, Romeo Kulio 16.0, 0 big drifter there which potentially looking like he's going brown advisory slash maybe not at all who knows Irish paner 20.0 similar price kappa j pike and 24.0 Z steel alley who we covered earlier. So where are you thinking with the current prices what we're going to be left with on the day in terms of declarations and perhaps final prices? Is there any value in the market right now? >> Yeah, it's a really interesting article as we speak here. Dan, um look, Lamba was tightened up after he won the game Spirit. Um I I thought they might have left him alone actually, but I I suppose he's won and he's won impressively in the end just for all all the reasons we were outlining earlier on. I just suspect he could be he could be vulnerable in an artle especially if he's run on good to soft ground no softer but look he's a he's a top class performer he's a top class juvenile last season he's three for three over fences now he's good at standown in the Henry VII he's a a dual grade or grade one the grade two winner now at the grade one in novice company the grade two in open company so it's hard to argue with that that CV um you can understand why he's favorite cop yeah like the reports on his piece of work have been very positive there over the last couple of days. So, it looks like he's back on track. I think he had an operation to remove a chip in a knee. So, we haven't seen him since Punchestown. He missed Christmas, missed the Dublin Racing Festival. So, it's a big ask going into an arc on the back of just one run over fences and Western Warhorse did it. It's sprang a big surprise, but he'd had runs over hurdles before that before he had his run over fences. And Welch Chief likewise, he' been running over hurdles earlier in the season at a high level, then had his run in in a chase and then went and won the Artle. So there is precedent there, but one run only one run this season. It's a look, we know William is a genius, so he's in the right house for trying to accomplish something that isn't accomplished very often. But um it'll be a good training performance now if he does go and win it. Um and but look, he was such a high class hurler last season, the supreme noises hurdle winner obviously and he was so good. His jumping was really good when he won his beginner's chase. He kind of it warmed as the race went on. He he was a little bit free and a little bit um enthusiastic through the early part of the race, but once Paul tannon allowed him stride on in front, his jumping down the back straight was good. His three best jumps were at the last three fences, they got progressively better as he went on. So, um that's obviously going to stand to him. But look, it's just just going to be so exciting to see how that pans out. Romeo Kulio, yeah, like we know he's a two and a half mile horse minimum who is potentially a Gold Cup horse for the future. All going well. And that said, he's a he's a fourtime winner now over fences. He's a a triple grade one winner over fences and he needed every yard of the two mile one furong trip at Leopard's town to get up and catch Irish Panther at Christmas and similarly again Cargazi it looked like he she had him beaten on the run to the last then he closed up then she made a bad mistake at the last and she came back at him so um and it's you know it's a conundrum where they're going to go and I think the Ryan Air has been ruled out even though it's over the right trip so it's either the ark or the brand of Rosary Chase or maybe on like fairy house it's the the Willow Warm Gold Cup is the right race for him. But I know Connections want to go to Chelton. So he could do both. He could go on to Chelham and then come back to Ferry House. So he's a player all right if he does line up in the race. But I I prefer Kagazi. I just think that the better speed test will suit her better. Um she was unlucky not to beat Romeo Koulio. I I think if she hadn't made that bad mistake at the final fence, she would have beaten him. Um we we didn't we spoke about this at the time as well, Dan. We didn't I didn't anyway appreciate the severity of the mistake that she made on the the initial view, but it was only when you saw the overhead camera, you could see how much ground and how much momentum she lost. So to for her to get back going again and close Romeo Kulia to a neck, that was that was a big performance. Um, also key I think is her her Chatam form. She's run there twice. She finished second behind Majbor in the Triumph hurdle when the two of them had between them from a long way out. It looked like she had managed for his measure actually going over the last or going to the last at least and he just stayed on better in the far side and got up to beat her but then she went back she won the county hurdle last season. So I think all of that better ground at Chelton will help her greater speed test of the arle over two miles exactly not even two miles um as opposed to two miles at a furong and heavy ground at Leopardtown then I think that will suit her better. So she she's at the top of my list at the moment at prices. And the other two on my list are Capi Pike who seems to have surprised everybody this season over fences. Like he beat Salvatore Mundy. Salvador Mundy was a 1 to7 or one to eight to eight shot at thus in November and he beat it seemed to beat him on merit and then he went back to the grade three race at Punchestown and he won that as well. Breed predators gold better fancy stable companion and Jacob's ladder and Jacob's ladder was an impressive winner of the handicap at the racing festival. So that's all solid for him. But that was over 2 miles three and a half furlongs. Um he'll be dropping down in trip as well. He he ran in the Turners in the Bearing Bingham last season at Shelton, not the supreme noviceses and he ran in the Mery noviceses hurdle at Entry, not in the top noviceses hurdle. So they're kind of the intermediate trips he was running over as a hurdler. Then it's a case of is he going to have the pace for an oracle or is he going to even go there? He's another one he might ferry house. Um but he's an interesting contender. And the other one is Irish Panther who only just got caught by Romeo Kulio in the the the grade one race over Christmas. Again, Eddie and Patrick Hart, the Hardy, they did say that they weren't definitely going to go to the Dublin Racing Festival. They were going to see what the ground was like, and I suspect the ground was just too soft for them to allow him take his chance. So, it looks like he's going to go straight to Chhatland now to the Arkle. But, I wouldn't mind that. He was a he was a progressive horse for um the late Edward Grady and then came on and was impressive in his two his first his first win over fences at Nace when he beat Jacob Z again. That form has been working out and then big run in defeat behind Romeo Koulio last time. So he's just a little bit of a forgotten horse in the Aral picture I think. So he's he's definitely on my short list but um Cargazi will be at the top of it. >> Okay. that Don effectively taking on the top two in the market at current prices. M it is interesting on the two Mullins horses first of all and you can hit us with your trend as well that that's heading into the ticker. Um it's rare is it that Mullins has two like like Town will obviously pick Copic to board but like Caris is a serious contender here as well if that makes sense. Like you've got two really top class N chases not much in them on the Mullins team. So like someone like Danny Mullins could pick up a great ride and dictate this race perhaps. Yeah, I think they're both real contenders. I definitely agree with Don that I prefer Cargis to Romeo Culio. They did have quite a hard race there. I think Romeo Kulio might have had the hard race. Very slow um about 93% finishing speeds. Um but she, as Don explained, you dropping down in trip, more jumping, um better ground, then I think she would be really well suited by that. Uh so she's definitely got a chance. My approach to the article is all about speed and jumping at speed. Always a lot of debate about whether you want a pure two- mileer or an intermediate trip horse. So firstly, the relatively few pure two miles. The vast majority of horses of a range of trips they're effective at and when they have a class advantage over the opposition, that range broadens. There is the occasional horse like Captain Guinness who's a pure two- mileer, but that's really because he'd be effective over shorter if such races existed. Yeah, the vast majority of champion chases are effective over the sharp two and a half miles of the melon chase aim tree. They may stay intermediate trips, but they aren't stayers. They're really fast horses. And in the arour, what's different is there's just one cohort of horses. You one season's worth of noviceses. In the champion chase, there might be three or four cohorts. And so quite often, you've only got one or two top class novices running in an arle. But if there's only one and they're ideally suited at this stage of their career by an intermediate trip, they often outclass their non-topass rivals even though the trip is an ideal gate warrior did that two years ago. If there's a top class two- mileer and a top class intermediate trip horse, then if the top class two mileer fluffs his lines like Maswood did last year, then the intermediate trip horse Django Bay wins. But if they both run the race, the top class two mileer almost always wins. Well, chief beat kicking king sprinter sacriic qard duvan beats sizing John. It's hard to remember a top class intermediate trip horse beating a top class two- mileer when both have run to form. The closest I could think of was Captain Chris beating Finian's Rainbow. I suspect Finn's Rainbow might have been a bit short finisher at that point. So the trend that relates to this is to do with hurdles form and it's horses that achieved a racing post rating of 160 or more over hurdles the previous season 10 from 20 since 2002. 46% profit. Um often key players in the arle they've just been winning their chases so easily. You can tell more about how fast they are on what trip they want from their hurdles form sometimes. So hurdles RPRs for the antipost market leaders here. Copek 160, Salvatore Mundy 155, Lamba 154, Caris 152, Romeo Kulio 150, um, Cappa J Pike 136, Irish Panther 133. So the result of all that theory, my starting point is want to start with the top two class mileer and then you look at the actual horses. So good as Caris and Romeo Kulio are, I think there's a pair of topnotch noviceses in here. Um and to my eye and a lot of people's I think Lamberta doesn't jump like a two- mileer. It takes a while to warm up at his fences. Um and he had to be stoked up a fair way from home at Newbury. Now he then powered clear but that kind of looked like stair at the trip to me. Um and albeit a very high class one. So if copek the board doesn't strut his stuff I think Lamba will be able to outclass the others even though he's not a two- mileer. But if Copek the ball can overcome his inexperience, then both my eye and history tells me he'll have too much speed for the Lambber. So the big question for me, how much of a concern is coming off one chase start in November? Don's explained that World Chief and Western Warhorse have been had uninterrupted preps during the season. They've been running over hurdles and that's definitely a big difference. Um, you neither they've been off since November, but I'll be putting up an article probably next week on the Matchbook insights page about Willie Mullen's record at the festival with seasonal debutants and also horses off one run. You interrupted preparation. There'll be more detail on that, but Willie stands alone at being able to do that. You I would absolutely trust him to minimize the chances of cos lack of experience catching him out. And Don said when he made his debut at Navvern that um once he settled a little bit he was much better in the second half of the race jumped really well. Paul can pull him up and I was really pleased with that because he was a bit ignorant as a hurdle. I thought he might just charge at the fences but he was clever when he needed to be and he had a some sort of schooling race the other day. Punch us down. Danny Mullins uh who was on imperry pass you 157 rated horse said they just couldn't keep up with cops balls gunning him into the fences making him have a you know some meaningful experience so that all sounds very positive he will need to settle on um because he's keen go but lots of fences early on in the arc will hopefully help with that it's going to be a fascinating matchup but as usual I'm with the top class speed horse because he's 4.0 zero roughly. You know, for me that makes up for the risk of the inexperience catching him out. So, I think Copekward's the right bet here. >> Okay. So, that's interesting. So, we've got Don effectively now. I say effectively taking on with the price, current prices, the top two in the market. You're largely with them and you think it's potentially between the two, Matt. Um, who goes off fav between the two? >> I think the vibes will be crucial. >> Um, I think if the vibes are strong for Copek D'vor, then he might do. Lamberta. I think he he's going to be one of those horses that really divides opinion on the preview night circuit. It'll be fascinating to to see who thinks what. >> Yeah, Don for you. Who goes off fav? >> Yeah, I I fully agree with that. Um I think where they are at the moment is correct. You can understand where they are. As we get closer to the time though, we'll we'll probably learn more about Copek Board on the previous circuit. Like I suppose out of sight, out of mind. We haven't seen him since November. So it's understandable that he's behind a game spirit chase winner at the weekend, but I think as as we get closer to off time, they'll converge and I'd say they'll be close enough on the day. >> And then Matt for you. So Cargi, she won't get closer to what she currently is to copic to board. So that was my next question. So like I mean she's obviously had she's been running in that DRF race and 7.6 versus 3.65 4.0ish for Copic. You think that'll be largely the same difference come race day or is there any chance that there could be some money for the the two-mile cargis and her chelon record as well? >> I think it'll all depend on on those vibes because if cope the board is really strong and I think Don's right that there then he will get close to Lamber in the market and it won't be much in it then she's probably going to drift at the moment. Part of her price is that if things don't go well with him and he has had an interrupted preparation then if Paul's on Caresi then she's going to be a lot shorter. If as we expect Paul's on cop to board she might drift a little bit. >> And then Matt finally for you. So I know the big prices does and I know you mentioned it's probably between the top two in the market but if I said to you you have to have a bet the current prices on anyone outside the top two in the market that would be shorter on the day. Is anything making your short list on that question? Um, I think I mean I suppose Kagis will be it because I think she's the the next best horse. Uh, it's it's hard to see one of those. We we'll get the scratches um through shortly. Um, I suppose the old lunatic Salvador Mundy, he was good the other day. He's got the um the ability and the hurdles form to play a part, but equally he's likely to pull too hard and, you know, be tailed off at the top of the hill. But, you know, he's 50 odd on the matchbook exchange. you could have a throw a few coins at him if you like long shots, but uh the Arle very predictable race generally and I do think we've got really good horses in it this year and therefore one of those top two top three Wikis is going to come along and struck their stuff and therefore it's going to be hard for the outsiders to win. >> And final word to you Don putting you off from Matt's case in the top two in the market. Are you happy with to go to war with Cargis? Yeah. The fact that Matt's with the top two puts me off off Kaz. >> He said top two there. He even said top two, maybe top three there. Yeah. So, >> no, look, I I like Kazi as a mayor. I liked her for a while. I I I thought she really ran a gutsy gutsy race the last day. She was unlucky not to beat Romeo Koulio and if she'd beaten him, she'd be shorter in that than she is. I love her going back to Chelsea. Her two runs there have both been very very good. The better ground will suit her. the speed test suit and yeah like Matt's right Paul Tanner will probably ride Copek de board but Danny Mullins you know he's top class rider as well and I wouldn't I wouldn't be at all averse to Cargazer going in there with a big chance for Danny Mullins on board as well >> yeah I do think I think Copek goes off of and just just beats Carey who knows we'll see if Lamba wins I mean there there's a ponorous uh long-term form uh boost ahead of the champion hurdle who knows what he could go off um after his one run this season but yeah my thanks to both Matt and Don and thoroughly enjoyed our usual show, but also the article as well. And as I said at the top of the show, we're only four weeks away from the Chatland Festival. All we ask if you see in the ticker, if you can hit that like button, subscribe, and leave any comments or questions for Matt or Don. We'll try to get to it over the coming weeks leading up to the festival. But we'll be back this time next week for another weekend review and covering a couple of Celt races. Bye for now. Enjoy the week."
    },
    {
      "id": "0y150m5UEvE",
      "title": "Football: PREMIER LEAGUE GW26 - Brentford vs Arsenal",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-10T02:02:36+00:00",
      "transcript": "You're very welcome. On to the Matchbook Football Podcast after, I would say, an eventful enough uh Premier League weekend, plenty of talking points, and we're straight back into the action with a midweek slate, a full midweek slate, and some interesting ties. So, very much looking forward to the thoughts of Marco Hair and Adrien Clark. I'm your host, Daniel Hussy from Matchbook. And before we get going, just a pointer in a direction. If you don't have a matchbook account, the markets we tend to cover and for matchbook people who bet on matchbook betting exchange, you can avail on the exchange markets but also bet builder options there as well. Enter the bonus code pod50. If you want 50 worth in free bets when you bet 50 for new customer only, full T's and C's apply and visit 18 plus visit gambleaware.co.uk and more information on matchwood.com/promotions. Let's get straight into it, guys. And we're gonna start with what maybe wasn't didn't feel like the biggest game in the world uh versus the rest of the slate, but Spurs versus Newcastle Adrian takes a little bit of a different meaning because Mark referenced the relegations odds uh just to us off air around 10 to1. Doesn't feel like that right now if you're a Spurs fan. >> No. No. Yeah. I I think that a lot of Spurs fans are are fearing the worst at the moment. So, yeah, this is a huge game. It's a huge game for for both managers. Certainly for Thomas Frank, I think defeat could force Spurs to press the panic button. Obviously, the closer they get towards, you know, Forest, I'm at that game, by the way, on on Wednesday night, home to Wolves, you know, it's a game that that that they would expect to win. Um, you know, they could, you know, could be dragged right into to sort of forest level. Um, obviously West Ham got a tough game against United, but it's it's not looking good for Spurs at the moment. Of course, most teams rely on their home form when when times get tough and and Tottenham really can't do that, can that at the moment. They're reliant on going away from home and and and picking up points. So, yes, tough times for them. The pressurees the pressure is cranking up big style, but but it is for Newcastle as well in in this game. you know, it's um obviously Eddie How is it's not been a good run for him. There's a lot there's a little bit of noise around the club at the moment. Obviously, Shandra Tanali has been linked with with moves away. It doesn't feel like the happiest camp and and as we all know that Newcastle's away form isn't isn't good. They've won two of 15 two of their last 15 Premier League away games Newcastle. Yeah, this is um this is hard and it's a hard one to call in my opinion because you can't trust Newcastle away and you can't trust Tottenham at home, can you? Um they might be better off without Christian Morero. We'll have to wait and see on that. Um but yeah, I I I was looking at goals initially and I I think that we're likely to see goals um because you know neither team are defending properly and and there is a big incentive for both to get the three-point hall here. I don't think a draw does loads in terms of favors for for for either side, for either manager, for either ambition. So, I I do expect there to to probably be goals, but I'm going to I'm going to steer away from it in terms of my my selection. Um because because they've both been sort of defending quite badly, there's always that possibility that that managers will get into the players and that that they'll, you know, focus on that side of the game and on stopping the opposition. I still think it will be goals, but I can't I can't hang my hat on it. So, what what am I going to do? Well, I'm going to go with um both teams to be booked because the referee is Anthony Taylor. Now, Anthony Taylor was the the non-cardgiving ref, wasn't he, for a while. That's kind of faded away a bit. He's he's he's become he's come back up to the sort of mean, I would say, in terms of of of referees. Spurs have the worst disciplinary record in the division. Um the most yellows. Um, obviously no Romero here, so that's one taken off, one guaranteed one taken off, [laughter] but um, you you get my drift. They're they pick up a lot of cards. Well, I I want to back both teams to be booked. All you need is one card for for both teams. Anthony Taylor has carded both sides in 15 of his last 16 matches in all competitions. So quite strong numbers there in terms of in terms of that high pressure game. I do expect it to be quite blood and thunder. I do think there'll be a few tackles thrown in because the players will be looking to to to show their fans and their managers that they care about the badge because they're both under pressure. So, I do expect this to be quite a physical encounter. So, yeah, both teams to be booked and then I'm going to go with over eight and a half corners. I'm really sitting on the fence here. Um but but Spurs matches, Newcastle matches rather do average 11.92 corners, which is the highest of any team in the Premier League. We know they love to fly down the sides. quite attacking but you know not not the best at the back over eight and a half corners has an 80% win rate in Newcastle matches this season that's for Spurs at home 10.92 corners a game that's the fifth most so yeah I think the numbers point towards over eight and a half corners there bundle it together it's not amazing it's 1.9 but it just takes takes [clears throat] the stress out of backing one team or the other I'm just I really don't know which way this game is going to go is it I find it a tough Yeah, it does seem a tough one to call. So Adrian going for the corners and cards side of things. Mark, just a little maybe on the Newcastle side of things and listening to Eddie how after the defeat to Brenford at home. Has he reached a ceiling in terms of what he can achieve with this Newcastle side and maybe down the line? Not obviously in the short term there may be a change there. >> Maybe. Um but I would be defensive of Eddie How and his position right now. I don't think he needed to go into as much detail as he did at the weekend. I think that just adds extra scrutiny to his current position. Um, I understand the frustration from Newcastle supporters particularly at the weekend and that performance at home to Brenford. They do look to be drifting a little bit but I think it's kind of natural to to see a bit of a drop off considering um they are competing or or were competing on so many fronts and they played pretty well in the Champions League particularly against the the better sides. you think of that performance away at PSG, the performance against Barcelona on match day one, plenty of other games as well and the big matches that matter. They've really sort of turned up and and put on a decent show. Um, and I think football's so fast moving, but sometimes we need to sort of take a step back and just appreciate what someone like Eddie How has done. He's twice taken them into the Champions League. He's won their first trophy in forever. Um, yes, the recruitment has been questionable and he's played his part in that, too. But um I think he deserves the opportunity to turn things around and the opportunity to see where he can take this Newcastle team between now and May. And maybe then if you want to reassess. There's plenty of fantastic uh coaches who will be on the the menu for many clubs in the Premier League and perhaps they might want to make a change then. But at the minute, I think he deserves the opportunity to see this season out at the very least. And um yeah, I agree with Adrian. Um would not want to touch either of these two teams right now. Um big game for two teams and two coaches under pressure. Uh Spurs just six points above the relegation zone. Uh Newcastle have dropped 10 points off the top five um after the weekend too. And yeah, their respective home and away form is atrocious. Spurs four wins in 26 at home. Six clean sheets in 50 at home. Newcastle um Adrian's already done it, but uh their more recent form, home or away, one win in nine across all comps. Four defeats in five. Uh and for Spurs, it's two wins in 16 Premier League games home or away. They are third bottom of the Premier League table since the start of November. four points from safety if you look at those 16 games in isolation. So, um the noise around Thomas Frank has been dampened a little bit I think with that second half um stirring come back against Man City and obviously you can't read too much into the weekend match against United where I thought they started reasonably well and then the red card turns the tables a little bit too but defensively now without Romero I think he will be missed because they're missing Kevin Danso, Ben Davies, Destiny Adogi, Pedro Porro as well. So a real patched up defense for this midweek match. Not ideal and that's probably why Spurs are as big as two to one to win this game. But happy to leave the teams alone and focus on goals. Over to enough goals for me is a standout selection. Um pretty confident on this at 181. I believe it should be a lot shorter. 11 of the last 12 meetings between these two teams in the Premier League has gone over. If you like your head-to-head stats, four successive Spurs games before the midweek before the weekend match against United. 64% of their overall league games have gone over. Eight of 12 at home have seen both teams score which is always encouraging for overs backers. And then Newcastle 16 of the last 23 have gone over. Six of the last nine away in the Premier League have also gone over. As Adrian says, there's a big incentive for both teams and both coaches to to get a result here. And I think we've seen Spurs start to release the shackles a little bit in recent weeks and be a bit more proactive in their approach. Um it's the only way really if you want to try and avoid that relegation scrap. And just a further little wrinkle too, did some analysis on night games in the Premier League this season. So 7 p.m. kickoffs or later, only a sample of 58 matches, but the average goals per game comes in at 3.12, which is much higher than the day games. So any match kicking off before 7 p.m. where there's a bigger sample and the average goals per game is 269. So um quite happy to support the overs at this price. I do believe the line should be higher and the price shorter. >> Well, we can no longer say that's now lazy analysis. leave the numbers for night games and day games backed up by >> love that. Yeah, >> I I will be listening back and stealing those stats for myself [laughter] for a few different things. Thank you, Mark. You saved a lot of work there. We will put this in as the 10 by money back special again. Feel like Spurs Newcastle could be uh a low-key cracking game here. So, over two and a half goals for Mark and then agents two selection. Both teams to be booked and over eight and a half corners comes in around 2.8. Just back that in the match with Bet Builder anytime before 8:00 p.m. on Tuesday. get your money back as a free bet if the bet loses or halfop seven that is sorry on Tuesday let's go to 8:15 game West Ham versus Manchester United Adrian back to you on this one Manchester United and Michael Carrick they've passed every test so far in those four wins and four not yeah four different victories style victories in each one of those games you've had to beat 10 men they had to score a last minute winner when they maybe didn't play that well and gave away a lead and obviously home and away performances against two top sides >> away to West Ham is this like the fifth sort the test. It just feels like there's a new challenge being thrown to Michael Carrick every single game. >> Well, there's going to be, aren't there? But like he couldn't have done anything more, could he? He's certainly galvanized the team and the the quality of their plays been good. I think the balance of the side. Obviously, he's been helped by the fact that he's able to sort of go again with the same group of players. Haven't really suffered any any major injury blows, have they, of late. And I I think that the formula is sort of clicking and he'll just he'll keep that ball rolling, won't he? That's that's the aim of the game. Yeah, those two brilliant performances against City and Arsenal. Not so good against Fulham, but great spirit. And then Spurs obviously with the red card that was, you know, they were always going to win that game. And you know, they Yeah, I think they played pretty well. You know, they did play well in the game and their star men are in good nick, aren't they? Bruno Fernandez looking good and Burmo seems to enjoy this this new role up top. I think Kobe May has come in and done great. Harry Maguire um looks good at the back. So yeah, there's there's lots to like about Manchester United at the moment and and they'll go to the London Stadium full of confidence, won't they? Um they've got West Ham now. West Ham are obviously, you know, the great result against against Burnley. They're finding a little bit of form, aren't they? They're scoring goals. I think they've scored at least two in in in each of their last four games um West Ham. So So they're beginning to carry a bit more menace. Obviously, Somerville has has come to the party. So, it's not just the the Jared Bowen show that that a couple of new stri strikers up top have done okay as well and they've made contributions. So, yeah, look, you can you can sort of look at both teams and say there there are positives really at the moment, but but the truth is I would lean towards Manchester United. I think you have to in terms of where they're at. they've got themselves into that top four picture and it would be not unforgivable but it would be a real blow for them to to sort of get beat by West Ham United here in this game having done all that hard work to to put themselves in in this position. Um West Ham have you know won four of their last 20 home games in the Premier League. That's you know that's pretty dreadful. Um Manchester United have have lost one of nine on the road as well. So even pre-Carrick they were they were starting to get a little bit better on the on the road. Um so yeah I I think that Man United double chance definitely interests me. I'm not quite brave enough to go all in on Manchester United here given West Ham have improved going forward. But if you go with Manu double chance and and pair it with both teams to score it comes in at a decent enough price 1.86. Manchester United know away clean sheet all season still. So that is something they've got to work on. Even under Carrick, you know, the the they've been giving up chances, haven't they? They've been quite lively the matches. So So I would I would anticipate that West Ham will get chances and and possibly score here. But West Ham no home clean sheet so [clears throat] this season and and they're playing against a United team that that are loving life at the moment. So yeah, both teams to score it would be the sort of a lock in really when you look at those two two statistics. Uh and then yeah, I I have to lean towards Manchester United because of the form that they're in. So yeah, look, we get, you know, get a number of score lines on board here for 1.86. >> Okay, we'll lock that in. Multi to score Manchester United double chance. And yeah, Mark for you, I mean there's lots to talk about with both sides. Maybe just a little bit on West Ham. Someone like Somerville is absolutely flying at the moment and they just look a little bit better going forward and are giving themselves a shot at staying up in this league. >> Yeah. So I think there's probably two reasons for that. One of which I think they find themselves entrenched in the bottom three and the only way to get out of that is to try and win football matches because you can't really draw yourself out of this problem. But I also think the appointment of former Rio Vico coach Paco may have made an impact here. So we know Nuno went to West Ham without his cavalry of coaches, backroom staff from his previous regimes and perhaps he was sort of lacking a bit of a influence, a bit of help there. But Paco is definitely a coach with uh ideas on the game, shall we say? Uh his Rios teams were renowned for their sort of possession heavy approach and uh sort of cavalier approach to. They were very front foot uh very forward thinking and it made for some marvelous matches. They often tried to go toe-to-toe with the likes of Barcelona and Real Madrid, not just in terms of possession, but in terms of the shot count, too. They were really exciting. And um yeah, he's almost the antithesis of of what Nuno is really. But perhaps he's rubbing off uh because they have looked more aggressive. They have looked more proactive in in forward areas recently. And I know at the weekend they lost the shot count 18-6 at Burnley and were made to sort of ride out that match, but put under plenty of pressure, but it is now three wins in four. They have scored at least twice and five of the last seven. uh someone like Katy Castanos who looked like a proper West Ham signing. Um I thought he was going to absolutely flop in the Premier League. He's made a really good contribution to leading the line. You're getting so much great support from Bowen and Somerville, as you say, two players off the ball on either flank who can make things happened. And Somerville, I think he scored one goal since joining the club in August 2024, has now scored in five straight games. He's uh driving at defenders, delivering dangerous balls, but also getting into the box to to support the the to support the attack with Castianos and Bowen. So yeah, I like West Ham at the minute. They're quite fun to follow, which is quite refreshing. Um, over 2.5 goals has landed in eight of the last 10. Uh, BTDS has landed in 12 of 17. Uh, nine of their 12 home games have gone over. 10 of Man United's 12 away games have gone over. So, I think goals have to be the bedrock to any bet in this particular game. And I've got the same stat here as as Adrian in terms of both teams have still not yet kept a clean sheet in their respective home and away games. So, I think you've got two teams who will be confident going into this match. and two teams who will be trying to play and I think there's decent ingredients there for a for a goal heavy game. Unfortunately, we're not going to get over two and a half goals um on its own. But uh I'm going to back both teams to pick up a card and that boosts the price up to to 195. And Simon Hooper is refereeing here. He's given at least three cards in 12 or 15 league games. Four or more in 10 of those. Uh 15 of West Ham's last 17 have seen at least three cards. They've been booked in 88% of all matches. United have been booked in 84% of all matches as well. So I think it tallies quite nicely for what should be quite an entertaining game actually and quite keen to get with goals here and uh yeah just looking for each team to to bring it into range. >> Okay, we'll lock that in over two and a half goals. Both teams a card each for Marco her that's 1.95 and go to Sunderland versus Liverpool and yeah Mark first chance to talk about Liverpool City last night and in terms of Liverpool going forward this season how are we going to judge them in the Premier League especially when the Champions League comes back because you know at some point they're going to perhaps if they can't top four top five's out of reach they might have to reign it in and go for the Champions League. >> Uh yeah do you would you want to bat them for the Champions League in their current guys? I'm I'm not too sure to be honest. Uh yeah, what to make of that game at the weekend. Hell of a finish. Um big big result in the title race, but probably quite difficult to digest from a Liverpool perspective. You get yourself into that winning position with that outrageous free kick. Um uh first time in a while a Premier League goal really sort of made me stand up and make a noise involuntary, [laughter] but you you end up losing that game and now you lose your best player this season to suspension as well because of the way it ended. Um you're without Bradley and Friong as well. So slant's going to have to be creative at right back. Um, you know, speaking to a few people, I don't know why he doesn't take Robertson across and try and play him at fullback because the other option is Endo or Curtis Jones and, you know, he's been trying to fill in his his best player out of position and as good as Shai has been this season, he was really a fault for that second goal by not stepping out in time. So, um, yeah, problems to to to organize, problems to sort for for Liverpool here. And it's I don't think it's easy to just pack it up and and go again, um, mentally after what happened at the weekend. And this is a difficult game. Really awkward assignment for them next. Sunderland away. Um, now Sunderland may have lost their early season momentum, but they're still proving pretty formidable at the Stadium of Lights. I thought they competed pretty well before the opening goal at Arsenal at the weekend. Um, but their away form has been pretty sketchy all season. It hasn't at home. Unbeaten. Seven wins from 12. Arsenal City have been here and failed to win. Villa have been here and failed to win. Uh you look at the reverse game they went away to Anfield largely limited li Liverpool to sort of half chances. I think it was one big chance according to Opa. I know there's no still still no Granite Jhaka but I think they can be much much more competitive than the odds suggest here. The odds are all being driven by the underlying metrics which we know have painted Sunderland in a a pretty poor light second bottom on expected points. But uh they've defied those numbers for most of the season, especially at home. And I don't think they should be as big as 5.1 at home to a Liverpool team who's won twice in 10 away league games, losing half of those. This is a Liverpool team who've won just four times on their travels in the Premier League season. They've conceded at least twice in eight of those 12 away games. They've actually got a worse defensive record away from home than Wolves who are rock bottom. Um so I'm not rushing to bat Liverpool sub 1.8. And uh the only solution therefore is to back Sunland with a half goal start at 2.3 which I think is a really big price for an unbeaten home side uh basically implies they've got just a 44% chance of avoiding defeat here and I think that does them a bit of a disservice. So Sunderland with a half goal start for me. Okay, that is of course on the Asian handicap and yeah agent Mark brings up an interesting point just in general on expected goals and interesting to get your thoughts because they do drive these markets and it's obviously a probably the most important data point but at some point a team like Sunderland small sample size obviously 25 games but you can go this is just the way they set up and they're very good at consistently outperforming their xG. So at some point you've got to maybe take that into account. >> Yeah, they score good goals and and the goalkeeper is is excellent. Um, yeah, they give up a lot of shots, Sunderland, but for me, they're always difficult to play against. I don't think I don't think they've given many teams an easy ride this season. Certainly not the the top teams. I mean, the Arsenal game was was an absolute war and they they did brilliantly to get the 2-2. The City game was unbelievable. One of the best nil nil draws I've seen in years. Um and yeah, they they are going to be intense in this game and and stats unfortunately can't measure intensity. I mean it can they can try but they can't really and and Sunderland aren't the sort of side that that make life easy for for anybody. So this is a tough game. It's a much tougher game as Mark says than that five you know price of around five on on on the home win. Um, I I do have a hunch that Liverpool might win, but I can't back them at that price. I I just think after the disappointment of what happened against Man City, they will see this as an absolute mustwin and really sort of really go for it and really focus hard on this match even though they've got they've got no right back and the balance of their team is going to be going to be impacted quite quite badly, I would suggest, but but I still think they've got enough in forward areas to to create chances against Sunderland and and to potentially get enough goals to win the game. But I can't I can't back them to do it. Um I I prefer both teams to score. I you know I saw Sunderland in the flesh on Saturday and they do carry a threat. I think that that Brobby is a proper handful at the top end of the pitch. He's he's really hard to sort of contain. Talby is has got a bit of magic in him. He can he can score goals from anywhere. We know that Enzo Lefay has that. Diara is a player that Liverpool will hate playing against because he makes runs from midfield. And if you think about recent games, the City game, midfield runner gets in to well, it's a fullback that gets in to win that penalty, but they run off midfielders. The Bournemouth game, Liverpool's defending was alarmingly bad. And I do think in general they they've lacked a bit of an appetite to track runners properly in midfield this season. Liverpool and Dara will will absolutely test them um in this home match and and and Lee is is a good manager. He he'll raid down that left down Sunderland's left for fun. Got no doubt about that. So I think Sunderland can score here. They've scored in 11 of 12 matches at the stadium of light against depleted Liverpool defense. The intensity they've got Liverpool by the way eight of their 12 away games both teams to score has landed. Matches on the road for Liverpool have averaged 3.33. So yeah, um there's not really much of a body of work that suggests Liverpool go there and and grind out a one- niler. That's for sure. So yeah, I like both teams to score. Sunderland have got the stats behind them. They've got the the game to take to Liverpool and to cause them problems. But this is Liverpool and Liverpool have got Viet, they've got Ekit, they've got Salah, they've got real good players. Um, and it's even though that that long run of games where they consistently scored, they scored every game for I don't know over a year. Even though it's come to an end, I still think they're going to score in in eight or nine out of 10 matches. Uh, Liverpool. So, yeah, in in in what I regard as still quite a tricky game. It's bit of a trappy one. I think both teams will score is is what I've landed on at 1.87. >> Okay, we will lock that in and move on to Thursday night. Brenford versus Arsenal. And yeah, Mark Keith Andrews, um, it's not just the results. I even like the way he and it is it it's both my bias and unbiased opinion. I'd like to think at some point I can bring my bias aside and listen to Keith Andrews as any normal permitting manager. But I thought his comments on Wizard were just really good. like he he was you could see how upset he was about the unsavory as he called it exit from him and despite it being six months down the line he was making sure in that press conference to bring that up and you can see some of that Brenford team playing with a little bit of that fire in the belly versus other matches and it was just a sensational performance I thought from start to finish. Yeah, they really sort of thrived in the chaos of that match. And um I liked him postmatch when he was when it was put to him about potentially qualifying for Europe and uh he sort of uh joked that he'll be going on holiday to Europe, but that's all he's going to talk about for the time being. So um yeah, it would be dangerous to dismiss Brenford. Um they're coming into this game with their first ever win at Villa Park, the first win at St. James's Park in about 90 odd years. I think Keith Andrews is quite clearly the manager of the season so far based on where Brenford are right now, what he inherited. Um to be safe from relegation with 13 games left to play is is quite astonishing really. Um but uh yeah, beating Arsenal is going to take an almighty effort really. Um my numbers make the the match prices pretty much bang on actually. I had Arsenal at 1.7. The matchbook exchange has them as 174 now. So slight movement since this morning, but um yeah, Arsenal come into this. I think they've reacted pretty well from that Man United defeat. I think Adrian talked about previously about Mikuel Artetta sort of having a bit of a team meeting and and asking his team to sort of refresh their mindsets after that to to sort of uh just try and play without the pressure and it's it's certainly worked wonders because um backto-back Winston Neil scoring seven goals in the process. They've looked back to their old selves I think defensively too. Um, I know they conceded three against United, but two were were bangers from distance and the other was from a a big big error. And uh, outside of that, I didn't think United created too many clear-cut opportunities. And that's been the case for Arsenal for a while now. Five Premier League games, four clean sheets, giving up an average of 0.34 expected goals in those five games and a total of three big chances, which is back to the Arsenal of old really. So, while this is an awkward assignment, um, a different prop prep proposition for them. Um they've coped pretty well in the reverse game. I know Brenford hit the woodwork, but they did only manage six shots despite a lot of kind of force pressure. They racked up eight corners in that match, but didn't really get too many clear sighters at goal and they kind of relish the counterattack and set pieces, but we know Arsenal have a set piece strength of their own. So, um yeah, this is a Adrian's talked about it being a quite a tricky slate. I think this is one of the difficult most difficult matches on the on the midweek sample for me. So, um, I've had to sort of go digging a little bit to try and find something I'd want to hang my hat on really. So, nothing too sexy, unfortunately. But Arsenal double chance and under three and a half goals came in at 1.7 on the bet builder, which was, I thought, a nice foundation for something, I think. Um, we know Arsenal are very difficult to beat. Or in terms of the under three and a half, 72% of their games have gone under, 75% of their away games have gone under three and a half goals. So, you got the the nil nil, the 1-1, the 1 nil, 2nil, 3-0, or 2-1 away wins. And I thought just to top it off with Brenford to win two or more corners. Comes in at 191. Brenford, as I say, won eight in the reverse. They've won two or more in 11 of 12 home games. They've won three or more in nine of 12 home games. And they've done so against Liverpool, United, City, Spurs, Chelsea. Uh, and Arsenal have actually conceded two or more corners in 11 of 12 away games. Three or more in nine of 12 away games. Burnley the only team who have failed to win two corners or more at home to Arsenal in the Premier League this season. Forest leads Bournemouth have all managed three or more in Arsenal's last three away days. So we know Brenford are all about set pieces, long throws, getting the ball into the box and working off that. So with that naturally comes corners. So uh yeah, quite an unsexy bet builder but it comes in at 191. Arsenal double chance under three and a half goals. Brenford to win two corners or more. >> Mark makes his his money through unsexy bet builders. I would definitely add that in. So well worth taking heed when Mark gets you an odds on one on that. Um Adrian, yeah, a little bit on Yeah, give us the Keith Andrews view. We talk about Arsenal a lot >> and just the outsider point of view because obviously this Brenford model, it is so set up for someone like a Keith Andrews run Thomas Frank previously and anybody really to a point. I mean, that's how good the structure of the club is, but you still need to have that personality and be able to organize and Keith Andrews is obviously the main guy there, like you know. >> Yeah. No, it's been hard to find fault with anything he's done this season. He's spoken well. We we know he's an intelligent guy from his days as as a pundit and yeah, look, he's galvanized this the spirit of the group. He gets the spirit of the of the club and the dressing room are absolutely with him, aren't they? And and there's he's unapologetic in terms of of where their focus is on especially going forward, you know, so much on set set pieces and the long throws, but they're better than that as well. you know, ego Thiago is is a real threat, but it'll go long. He doesn't care how they what they look like Brenford. He cares about I think he's the kind of manager that that has has sets up a team that he knows other Premier League teams don't like facing. And I think that's what you have to do as an underdog. And Brenford are always going to be underdogs at the top level. And their style is is one that that the big boys don't really relish facing. So yeah, he's he he's done brilliantly. Um absolutely outstanding. So yeah, and look, this is a hard game for Arsenal. Definitely one of one of the hardest games Arsenal have got left this season. I think that that much is clear. But I I've just got I have got enormous faith in this Arsenal side. You know, I I see them every single week. They just don't give up very much. There was a little spell where Arsenal were a bit ragged um without the ball and and and were giving up chances but you know I think in five of their matches this season which is you know it's a fifth of their matches they've faced no shots on target in another six games. So that's, you know, it's taken it beyond two-fifths of the season. They've faced a maximum of one shot on target and there's there's there there's I think there's three games where they've faced two shots on target. You know, just don't give teams very much and and opponents have got to be really clinical to to to breach Arsenal or or capitalize on mistakes as United did with those two long shots uh and the the super men era. So, um, for that reason, I'm going to fancy Arsenal most most matches and I would in this game as well. I do think that that they'll go there with a real focus because I'm expecting City to beat Fulham, which would will pile the pressure on, but I think that this team are in a better place now than they were a few weeks ago. Certainly mentally. Um, Brenford don't keep many clean sheets at home. only three from their 12 matches. Even though they got a brilliant home record, only three clean sheets. So, I'd fully expect Arsenal to score. And if Arsenal score, they got a great chance of winning the game. Arsenal still, even though it's been a bit of a wobble in some people's eyes, Arsenal have still won seven of their last 10 Premier League matches. They got clean sheet wins. Well, not clean sheet wins. They got clean sheets at Everton, at Forest, and at Leeds. I'm not going to back them to win with a clean sheet because this Brenford team, they were really dangerous at Emirates Stadium from long throws, from corners and they caused some quite nervy moments. So, I I think they can nick one for sure, but I would I I do think that that Arsenal um have the firepower and the confidence to to win the game. I don't expect it to be highscoring. 11 of Arsenal's 12 away games have gone under four and a half. 10 of Brenford's 12 home games have gone under four and a half. Um yeah, Arsenal and London derbies tend to tend to do okay. Uh I think we've lost one of the last 20 away games in the capital which is terrific record really. Um and I don't think I don't think Arsenal will get beat in this game. Um yeah, knowing that they need to win, I think they'll find a way to to get the three-point hole. So, I'm I'm going to back them to back Arsenal. Obviously, they're a bit short on their own, just over 1.7. If you if like me, you think it'll be, you know, uh a max of four goals, then that price gets boosted to the right side of evens at 2.08. So, I'm happy to happy to take that on. >> Okay, we'll lock that in on insights.book.com if you want to recap of the four main games that we cover, but also the g the bets coming up here. And Mark, we'll start with you. Tom Brady feels that Birmingham are still in the promotion hunt. He wants his club in the Premier League next season. Are they Have they got a sniff of the playoffs? They're only two points off and they host West Brom who we've covered week on week here about how dreadful their form is right now. >> Yeah. Uh this kind of leads into my long shot. So should I do my other selection first? >> Yeah. Go for your other selection actually. I'm lean in. Yeah. Lean in at the end. Right. Yeah. >> And then I I'll sort of re read the two in together. Um yeah. So uh Wednesday in the era devisci neck nymegan are playing utrect and neck nymegan have the chance to go second in the table which is utterly remarkable. We talk about Brenford doing incredible things in the Premier League. Well Nick Nymegan if they went in second in the era devisc is astonishing really a hell of a season. They've won eight of 10 unbeaten league games since early November. Um that's their only reverse uh since September. They've won seven of 10 at home all season. They're averaging 2.9 home goals per game as well in the area of VC. They've been thrilling to follow. Really great fun. They've scored twice or more in all 10 home games. Scored three goals or more in six of those 10 home games. And their matches are just normally bonkers. Um absolutely great fun to follow. 4.33 goals per game. 86% have gone over. 81% have seen both sides score. At home, nine of 10 have gone over. Seven of 10 have seen both sides score. And they've kept only three clean sheets all season. They are a wild team uh but great fun to follow and yeah this is a great opportunity for them to to go second because they play an utre time team who are in a really poor form at the minute. Uh they lost quite limply at home to fin at the weekend. That's a fourth loss in five. They are winless in nine. They've lost all four trips to the top nine. Um but they have scored in 17 of 21 league games this season. Uh they don't concede many but they always concede. They've only managed three clean sheets themselves. So both teams to score is always a big runner whenever Utre play. It's always a massive runner whenever N Megan play. So just combine the two and we can get Nick Naggan to win and both teams to score at 325. So nine of their 12 league wins this season have seen both sides score and four of Urek's five defeats on their travels have also seen BTTS land as well. So I think neck non to winners around about 166 170. Uh we're getting 325 by just including the BTDS angle which uh looks like it's going to have a decent legs for it. So yeah, quite happy to be with N Megan. >> Okay. And we'll go for Adrian's two selections and back to you Mark. Adrian, start with Charleston versus Stoke. Both teams to score no in the Championship. >> Yeah, look both teams um drew nil nil um at the weekend and I always think I I don't know whether Mark Mark's on his on his fancy spreadsheets has got data on on sort of backto back nil nils. I I maybe set him that challenge. But it always seems to me that often you it's like the London bus London buses. You often get get little runs of them. Wonder whether that is the case. But anyway, um these are two of the lowest scoring sort of sides in the >> in the championship. Um both teams have scored no has landed in four of the last five Charton matches. It's landed in four of the last eight at home. Only four teams have scored fewer goals. The Nathan Jones side as well. They're relatively low scorers, particularly at the Valley actually, where they've only got 15 in 14 matches, which isn't great. Only Sheffle Wednesday and Oxford have actually scored fewer goals in front of their own supporters in the second tier. So, Charlton, you know, I can see them blanking, but obviously we don't need both teams to blank here. Uh just one of them will will do. It could be Stoke. I mean, 70% or seven of the last 10 um have have seen both teams to score no come in. So, this bet has landed 70% of the time across the last 10 matches. They've blanked in five of those 10. They've kept clean sheets in five of those 10 as well. So, um and they do have the best defensive record in the division, Stoke City. So, yeah, I this does stink a little bit of a nil niler or one nil either way. Um so, yeah, when when I saw a price in excess of 1.9 on on BTTS, no, that that that was winking at me. So yeah, 1.94 is the price. >> Okay, second selection. And you know to pick these games sometimes, Adrian, we have 90th in the Football League pyramid, hosting 89th in the Football League pyramid. And your bet won't surprise people based on that introduction, I'd say. >> Yeah, they're normally stinkers, aren't they? These these sort of games. [laughter and gasps] Um I mean on my long shot last weekend was that nil nil by the way, West Brom and Stoke. All I needed was a stoke goal. So that was really frustrating. I knew it was going to be under two and a half goals, but um yeah, never mind. Um I'm hoping for better luck with Shrewsbury versus Barrow. Um I I want both teams to score no again, and I and I want to pair it with under three and a half goals. That's even money. It's a huge game at the bottom of League 2. Both teams have changed managers lately. Both have got, you know, guys who haven't really managed in the EFL before, so they've taken a little bit of a risk. Um, both teams have scored no has come in in in seven of the last nine Shrewsbury games. They've blanked in three of their last four. Um, no, they've blanked in in in each of their last three. They've blanked in four of their last six as well. Shrewsbury. Um, they've lost seven of nine. It's It's been really bad. Nine of the last 11 have gone under three and a half goals as well. So, Shrewsbury keep on losing lowscoring matches is is the pattern. Uh, Barrow are in shocking form. They've lost five on the spin. They've lost seven of their last eight. They can't score. They've won once since October the 15th, which I think you'll agree is ages ago. [laughter] They haven't had a clean sheet actually since October. So, that's a slight concern in regards to to maybe this section uh this selection. But on closer inspection, when they've played the the the weaker teams, the teams around them at the bottom against the bottom eight, um, six of their 11 games have come in uh, with both teams who scored no landing. Um, and over the course of this season, Barrow, just 29% of their games have gone over, have gone four goals or more. It it doesn't happen very often. So yeah, given the context, given the fact that neither team has any confidence at all at the moment, given the fact that defeat would be a bit of a disaster for both, I I do love both teams scored no here and under three and a half goals at even money. >> Okay, two games to look forward to. Um, [laughter] at least from a betting perspective perhaps maybe hopefully the spectacle is brutal and there's two lowscoring games there for Adrian Charlton Stoke and Shbury versus Barrow. Mark, we built it up earlier. Firm City. Tom Brady still thinks they're in line for the playoffs and a return to the Premier League next season and you're going to double them up here within any other bets section, but then into your long shot at home to West Brom. >> Yeah, this is a great opportunity for them to to get into the playoffs. If they beat West Brom, they will be in the top six and I would back them to do so. So, that is my first and main selection here. West Brom to win, West Brom to win, Birmingham to win 194. Uh, I think that's a lovely price. I know Adrian opposed West Brom in his long shot at the weekend played out a dreadful nil nil with Stoke. Really, really awful stuff. A combined xG came in under 0.8 in that match. Um so [snorts] yeah, they're now one point above the drop zone, but still in dire straits and this is a really tough midweek match. Uh bit of a regional regional rivalry too, but go away to a St. Andrews Stadium which will be buzzing. Um Birmingham spent a lot in the in the window. um not just in the summer but also in January again with that intention to to make the top six and try and gain for promotion. Had a bit of a mid-season slump but um yeah they seem to have found themselves again but they've been largely excellent at St. Andrews anyway, just the one defeat in 15, eight wins this season. Four wins in six unbeaten across all venues now scoring twice or more in four of those fixtures as well. But uh yeah, we know about Albian and how atrocious they've been, especially on their travels, 12 defeats, and 14 away. Nine losses and 13 home or away in the Championship, 10 losses and 15 against top half teams. It's been pretty brutal for for baggy supporters. So Birmingham on the nose looks a terrific bet at 194 on the Matchbook exchange. That's my bread and butter here. But for long shot territory, I'm going to chance BTTS alongside that Birmingham win for a 4.7 shots. Now, both teams have scored an 11 of 15 at St. Andrews this season. Birmingham haven't kept a clean sheet at home since the 4th of November. It's two clean sheets in 17 league games, home or away. Both came away at the lowest goal scorers in the division, Oxford and Sheffield Wednesday. So, their games do tend to be pretty lively, entertaining affairs. And whilst Albian have failed to score in three or four, they have scored in five of the last eight away. And I'm just prepared to give them a shot here because uh yeah, they've got to start trying to pick up points. And whilst the the atmosphere around the club is is pretty rotten, they can't just kind of go to Birmingham and roll over and expect to to get a result. They have to go here and show something. And >> as we've seen across the campaign, if Birmingham are pressured, they do tend to wilt a little bit. So um yeah, wouldn't put it past Albium getting on the score sheet in defeat. So 4.7 Birmingham to win BTS. Okay, we'll lock that in and go to you, Adrian. League One, Wigan struggling near the relegation zone or in the relegation zone. Very close relegation battle there with a number of clubs involved and reading a little bit further up the table there. Um, so they're sort of clear going into the game with a little less pressure. How do you make this one? >> Yeah, I'm the profit of doom on today's show. [laughter] I'm just tipping up bad game after bad game after bad game. I hope I'm right. Um, but for those in attendance, I'm sorry. Um, yeah, [laughter] look, we can one of your own. Um Daniel has um has taken over, hasn't he? Glenn Wheelen is is the interim manager at Wigan. They just sacked Ryan Low Rotten Run. They got spanked 6-1 at uh by Peterbrra at the weekend. It was in the post that that particular dismissal. So yeah, Glenn Wheelen will take charge. Um and and look, morale is very very low at Wigan. They're in danger of slipping into the fourth tier. They're into the bottom bottom four now, which is a bit of a disaster for them. Uh they've lost five of their last six games, the Latics and their home form is so bad. So if if you go back to 27th of September um which is yeah again ages and ages. Yeah. Nine home games since in the league. They've blanked in six of them. Um they've barely seen their team score since since late summer, early autumn. It's it's been miserable for Wigan. Uh and obviously they'll probably be pleased that there's been a change, but you know, they come up against a Reading team who aren't bad. Um they've been one of the most improved teams in the second half of the season and in 2026 alone, they've had three clean sheet wins, Reading. So, you know, they the last few games, they've actually let in a few goals. Um but they they're more than capable of putting out clean sheet wins. I said three in January. They had um their record against the bottom eight is also excellent. Reading. Uh they've won seven, they've drawn two, and they've lost none. And of those seven wins, five clean sheet wins. And that is what I'm backing here. I'm going to go for a stinky one nil, 2-0 for Reading at a pretty empty home stadium. It comes in at 5.0, which you know, they should be favorites for the game. Reading, just pair it with the clean sheet and it comes out at a lovely price. >> Yeah, you can get it whatever score you want though. 56 7 nil as well. So reading to win and both teams scored no. We'll move on to best bet time. 134 days. Sorry Adrian, incidentally is the 28th of September. So you're correct. It is a a long time ago. Mark, you big it up at the start over two and a half goals. Spurs versus Newcastle. You're expecting a pretty decent game here. >> Yeah, just fully expected this to be a higher line, a shorter price. And uh as I say, the the previous meetings between these two teams do tend to deliver. 11 of the last 12 Premier League matches between Spurs and Newcastle have gone over two and a half goals. Spurs, as we know, cannot defend, especially at home. Just six clean sheets in 50 home games, which is astonishing. Uh majority of their matches do tend to produce goals at both ends, especially in the Premier League. And uh yeah, you've got a Newcastle team who are under pressure, under fire, uh frustrated after their weekend defeat to Brenford. 16 of the last 23 games have gone over as well. Six of the last nine away in the Premier League have gone over. So, I think you've got all the ingredients here between two teams who should in theory take a proactive approach, eager to try and get results after some poor recent form. And uh yeah, I think there's uh it should be goal heavy game. So, yeah, just very happy to take that 181 on over two and a half goals. >> Okay. And final bet, there's officially two teams in the Premier League title race. If you are a regular listener to the match podcast, Mark Hair would have told you that two weeks ago, three weeks ago, four weeks ago, five weeks ago that Villa had no chance. It's Arsenal, Manchester City agent, and you like both teams to win midweek here. So, City at home to Fulham and then Arsenal away to Brenford. >> Yeah, we're getting into the business end of the season, aren't we? Where where the top teams have to have to keep winning and I I I'll be staggered if City don't beat Fulham at home. I the numbers around this fixture historically are nuts. I don't know if you're aware of it. City have won 16 in a row against Fulham. It's the longest winning run one side has had against another in English League history. [laughter] >> So yeah, so City have beating Fulham and and wait for this. Marco Silva now obviously he's been there a while. >> Yeah, >> he's lost all 13 of his Premier League games against Manchester City. That's with Fulham and with other clubs. Um it's the most one manager has had with a 100% losing record. So they got no chance Phil of beating Manchester City according to the history books and I haven't even got to City's record in midweek, right? You're like this Premier League home games haven't lost since 2010 in midweek at home in the Premier League. 47 wins, eight draws. Um it's it's a quite extraordinary run for Manchester City. I've talked about Arsenal um and how they really should beat Brenford. It's a tricky game. There's no no denying that. It's it's an awkward one. Arsenal will have to be on it. But I think at the moment the focus is good. The confidence is high. Yres is scoring. The defense looks meaner. They've got Califf Fury back in. The A team is sort of back together there. Rice and Zubmendia are in great form as well just ahead of them. I think they'll they'll go with the strongest back four and the best two central midfielders. And I think Arsenal will grind out a win. So, if you think that the top two are going to prevail at uh in midweek, you get a double at 2.3, which I think is is quite a nice price. >> Okay, we'll lock that in. That's a extraordinary um stat on Manchester City. Fulham, who would have known? I wouldn't have had Fulham down as the weakest uh opponents that City have faced effectively there with that record. So, um my thanks to Mark and Adrian. There's FA Cup this weekend. We're going to skip that because we have the return of the Champions League. So this time next week, you'll have a Champions League podcast in your feed and then we'll move on to the full Premier League weekend and then the second [clears throat] leg of those playoff ties before we kick into the last 16 of the Champions League if I'm correct there and then onto the business end of the Premier League season. And there's a small matter of a couple of World Cup playoffs in their mark as well for Ireland hoping to do the business and join everybody else in America, Mexico and Canada. >> Get Keith Andrews in. No, I mean just just bring him in Paris. We had him under Kenny and we all thought to be honest he wasn't great. So there you go. Just shows you that Brenford is an incredibly well-run clover. Keith, we were sleeping on Keith Andrews. Probably a bit of >> part time. Yeah. >> Yeah. Um anyway, I digress. My thanks to both Mark and Adrian. Looking forward to chatting football with them again this time next week. Enjoy the week's football. If you're having a bet during the midweek card, make sure you enjoy it. Make sure enhances that enjoyment. Watching the match and make sure you do so responsively. We'll chat to you this time next week for Champions League action. Bye-bye."
    }
  ]
}