{
  "category": "betting",
  "scraped_at": "2026-02-20T18:49:43.072349+00:00",
  "days_back": 14,
  "video_count": 1,
  "transcript_count": 1,
  "videos": [
    {
      "id": "_dja39XdSXI",
      "title": "Football: Premier League GW27 - North London Derby",
      "channel": "Matchbook",
      "channel_id": "UCSwpo8Ue2_FkJ4AbMolLymA",
      "published_at": "2026-02-20T01:58:43+00:00",
      "transcript": "You're very welcome on to the Matchbook Football Podcast. I'm your host Daniel Hussy and delighted to welcome each and every week Mark O'Hare and Adrien Clark to tackle a lot of the talking points which obviously start with um that disaster last night and I know we've got a couple of comments already coming in. Sticking the boot in, Adrian, but we will we will touch on it when we cover the North London Derby. Yeah, Twitter was alive and well, I would say. Um signs of its uh demise are greatly exaggerated judging by some of the content on my feed there yesterday to be fair. But before we get going, a quick reminder. All we ask if you are enjoying the shows throughout the season, bit of crack uh both on YouTube comments and on social media. If you hit that like button, subscribe completely for free um to get more content, not just football, but up to the Chatton Festival as well. And if you haven't got a matchbook account and you'd like to join us, enter the bonus code pod 50, POD50, exclusive for our podcast listeners. Uh it's the best one, best one for football-wise. If you want to have a new customer offer and enter the bonus code P O D50, full T's and C's available on screen there shortly once the ticker goes and on matchbook.com/promotions. Mark, we'll start with you. We'll get the neutrals take on the title race. I mean, the updated odds as we head into Spurs versus Ars. So, you can lead into your bet here for the game specifically, but Arsar 1.7 now to win the title. It was did seem a big moment in some ways, but when you look at the title odds, it is surprised maybe until you look at the pictures that Arsenal are still heavy favorites. >> Yeah, I was surprised this morning when I looked at the outright prices for Arsenal was still odds on because it's in City's hands now. If they win every game between now and the end of the season, they will be Premier League champions, which is uh quite uh statement really. Um I said to you off air, Dan, but um I my focus was on the Champions League on Wednesday night. I didn't even realize Arsenal's match was being televised until halftime. I looked at the stats and saw Wolves didn't have a shot in the first half and thought, well, that's a formality. Arsenal go on and win that comfortably. No need to watch that. There's nothing of interest for me there. So, yeah, quite a shocking turn of events really and obviously I'm joined by two Goonas this uh this afternoon in morning after that. um shock events really um yeah seismic and um now obviously they have to go away to Spurs a traditional fixture where they produce the goods more often than not particularly under Mik Arteta but there's a lot of unknowns going into this game uh just mentality now the Arsenal team uh how weary will they be that was their third game um since Spurs last played so there is a rest and preparation advantage to Tottenham going into this game and obviously the the perceived new manager bounce that most clubs seem to experience and I think that's the issue for me going into this match is I just don't know what to expect from Tottenham uh to a certain degree and uh obviously normally a derby match tends to um you know form goes out the window as the cliche goes but Spurs' form had been absolutely horrendous hence why Thomas Frank was sacked the appointment of Eagle Tudor was a surprise I did not expect his name to be linked to the job let alone get it towards the end of the season I can understand why he's a bit of firefighter who's done a a good sort of um immediate impact really. All the clubs he's been at in Italy and France. Um the issue I have going into this game is the injuries. Um Tudor likes to play a three at the back, a 3421. The issue is Spurs have got so many players out. So you're looking at Palinia probably dropping back into center half to partner Vanderven and Draon at center half if that's the way he wants to go. Spencer Gray as wing backs and then um yeah, a combination of players in in the midfield too and uh and up front. But uh it's not great on paper, but the way to J T J T J T J T J T J T J T J T J T J T Judor likes to play is to be aggressive, be front foot, be physical, impose yourself and press high. And if you look at when Spurs had probably been at their best in Thomas Frank's era, it kind of came when the tactics went out the window and they were chasing games, you think of the Aston Villa match, uh Mass Man City in the second half, Liverpool when they were up against it too. So if they can if you can try and evoke that kind of performance out of them, they can be competitive in this game. They're no mugs. And I'm also surprised that they are as big as 6.4 on the exchange to to win this game. That's the biggest home price they've been against Arsenal in since my records began back in 2012. Uh the biggest price Spurs have been in this fixture at home during that sample was 433. So that's a huge difference. Um obviously it's not a fixture they tend to farewell in. Uh the long-term form table suggests that they won't win. They've only won four of 27 home league games, six clean sheets, and 52 home league games as well. Just astonishingly bad numbers. um and he sort of balance out and Arsenal are so rarely beaten despite this recent wobble. Four defeats in 32 away league games going back to the start of last season. So um I don't expect Arsenal to lose, but there's just too many unknowns there for me to get involved in the actual match outcome. Instead, I wanted to focus on what I think will be quite a reliable aspect of this match, which is cards. There'll be lots of tension in the stadium from both home and away supporters. Spurs clearly not clear from relegation just yet. Arsenal chasing the title. You've got a home team who in a head coach like Igortudo will demand more physicality, more aggression, uh eager to not just stop their rivals winning the title, but obviously gain a better foothold in that battle to avoid the drop. So, um I think cards will be guaranteed. 15 of the last 20 meetings in the Premier League have seen four or more. 12 of those have featured five cards or more. But if you look at the last 11 games between these two teams at Tottenham, uh seven of the 11 have featured five cards or more. And I like that as a repeat actually. I like over four and a half cards as the first leg of a bet builder. Peter Banks is refereeing. He's given four or more in 10 of 18 Premier League games. Five or more in eight of those 18. Doesn't sound fantastic on paper, but you look at the matches where he has gone five or more. It includes Villa Brighton last week. It includes Fulham Chelsea a derby. Sunderland Newcastle a derby. Both of those games he gave at least six. He did similar in United Chelsea and City Spurs. So it shows that when the occasion and the high pressurized matches come to town, he tends to deliver the goods. So, I like over four and a half cards and I'm going to partner it alongside under four and a half goals for a 1.9 shot. I'd be surprised if this does escalate. I know it does tend to produce goals, but um I just like the idea of uh just partnering. It's not a stat statistical sort of element here. I just don't assume this game will sort of leap out into a sort of goal frenzy of five, six or seven. Um so, obviously you got a range of correct scores on side for both teams and the draw. Um but yeah, the main play here is to back cards. So, over four and a half cards and under four and a half goals pays 1.9. >> Okay. Um, Adrian, it's going to be a fun game. Whatever happens is >> I know, I know, mate. [laughter] I know. I'm just thinking of the story lines. I mean, we're not even less than 12 hours since since the result, but a little bit on on the game itself. It's important not to overreact obviously given the title odds that I suggested, but also important not to underreact as well. It was, you know, a terrible uh 45 minutes of football, I would say, that second half. >> Yeah, it wasn't good at all. I yeah it was a poor it wasn't a great first half performance really um even though Arsenal were were sort of in control of the game. So um yeah, look going forward at the moment there there are issues the balance of Arsenal's attack not not quite right. I would suggest um maybe the the team selection didn't didn't work against a relatively low block going with the sort of pace uh attack of of Martinelli Yarez and and Medekke didn't really bear fruit but that said when the subs didn't impact it positively either. Um, yeah. No, it's a mentality thing. Mentally, Arsenal are struggling, aren't they? They're feeling the heat and they're starting to panic. I mean, that as as as bad as Arsenal were in that game, it's still a calamitous error, isn't it? That that costs Arsenal the win. They should, you know, it's a it's a nothing cross that's floated into the box. It's David Rise all day long. Keeper comes out and catches it. Job done. But, you know, Gabrielle for me, I don't know why he's back backing off and and trying to compete for the ball. So, um, yeah, that but those kind of things happen when players tighten up, when they start to feel the pressure. Um, but probably more worrying than than that individual mistake was was was Arsenal's um giving up the lead, a twogoal lead. I mean, goodness me, two goal lead against the bottom side. But it's it's not the first time it happened at Sunderland. It happened against Manchester United. It happened at Brenford. Arsenal get into good positions at the moment. They they don't put the foot down. They they sort of ease off and I think that comes from a slight lack of trust um in themselves maybe they just want to go into protection mode and that's not the way that you're going to win the title. So I really really hope that Arsenal can um flip that on its head and and and be more positive in this game. And I do think actually when I look at the game and I look at Egota coming in like first and foremost I think it's bad news for Arsenal that they've made the change. I think Arsenal would have beaten Thomas Frank Spurs hands down. This adds a bit of doubt because he'll re-energize the team. He reenergize the stadium. He's got a fantastic record as a firefighter as someone that that gets short-term impact results. So that is a concern from an Arsenal angle. Um, but what I will say that that boldness, that aggression, the man-to-man press, the the sort of asking his center halves to join in in forward areas and, you know, a lot of positional rotation, all of that could play into Arsenal's hands, especially if they haven't nailed it in training. So I I do think if I do think that if TUDA takes it to Arsenal, which I'm guessing he will, then that like that will give them a chance of scoring goals and putting pressure on Arsenal, but it also would leave them exposed and and Arsenal are at their best when teams leave a little bit of space in behind. So So I'm optimistic that Arsenal will bounce back, but I can't I can't back them. Not based on on on what I saw from them at Wolves. need a bit more evidence before I can sort of hang my hat on Arsenal to to win this game. But I do like both teams to score. It's a 1.9 shot. It's landed in four of the last five North London derbies. It's landed in eight of the 12 North London derbies that Micheletta has been involved in. And and as I said earlier that just defensively there's there's a few creeks there at the moment. It's not entirely convincing. Um Arsenal conceded in six of their last nine away games. And look, for as bad as Spurs, I mean, and and then you look at Spurs defensively, they've conceded at least twice in each of their last six. So, Arsa really should score here, but you know, will they keep a clean sheet? I don't know. Um, despite their sort of woes at home, they did score against City. They did score against Liverpool. They did score against Man United. They did score against Villa. They did score against Newcastle. So, um I think I think they've got every chance of of notching here um with Salanei and Simons in in in in half decent form as well. So, yeah, both teams to score for me 1.9. Um if you want to pair it with Arsenal double chance, I wouldn't put anyone off of that. I wouldn't see us losing the game, but yeah, I'm not I'm not going to put it up. No, I for reluctantly agree with the guys that yeah, it's a tough game to call given the uncertainty on both teams for completely different reasons. But Adrian's locking in both teams to score 1.9. Quite a big price that you would usually get for that sort of bet as well. So, we'll lock that in and we're actually going to combine the three guys for our 10 pound money back special. Get your money back as a free bet. If this bet loses up to£10, all you got to do is put the following bet into the Matchbook bet builder with bet builders become quite popular on our side over the last couple years. both teams to score under four and a half goals and over four and a half cars. Gives you a 3.3 shot. I'm reliably informed by producer Rob who was full of glee as a Liverpool fan on the WhatsApp last night. So, we'll be dealing with that internally as we move on to Aston Villa versus Leads United and super super leads Mark. I mean 2-0 down against away to Chelsea. They somehow get themselves back into the game. We've spoken about them a lot in terms of maybe a lot of draws. Their form really they should be fully clear in mid table. They've just had so many draws and so many good performances. Is there another one coming out of the park this Saturday? >> Yeah, I wouldn't discount them. Um I looked at this game. I think it's quite an interesting match because uh probably when I did my notes on Wednesday morning, I had Aston Villa out of the title race based on what we saw night. [clears throat] Perhaps they're back in it. Um they're still not going to win the title, but they'll feel like there's an opportunity for them to close that gap as well. Um but I think their main aim from here should be to secure that top five finish. Injuries though haven't helped and I think that's one reason why leads can be competitive in this game. One of a number of reasons but yeah I just look at the Aston V midfield. It's such an area of strength for them and to to miss Kamar Tielemans and McInn um they're three massive massive players to be without and yes there's players that can come in and do a job but when I see Villa quoted at odds on to win this game that's yes it's it's too short for me to to get with the home side. Uh the Brighton win came with just one shot on target and um there's been a few sticky performances in there recently. So um yeah, I I get if you just look at the results across the campaign, you might think this should be a a straightforward home villa win with leads lacking results and points on the road. Just eight points and 13 away days. Um the solitary win away from home came at Wolves as well. But they have been much more competitive than those uh results suggest as you say. Yeah, they should have lost to Chelsea in fairness. um that two all draw, but they went to Stanford Bridge, got a point. They've been to the Stadium of Light, they've been to Brenford, they've been to Liverpool, uh all in the last sort of five or six away games and gotten something. They went to Newcastle. Should have won the game, ended up losing it in stoppage time. So, their away performances have been actually quite impressive uh for quite some time. And if you look at the state of play since the start of December, Leads have lost just twice in 13. Seven of those games ended in draws as you say but only Man City and Man United have lost fewer league games than leads in that sample which is quite impressive and uh yeah the draw for me would be a big big runner at 3.8 eight. Five of Lead's last six away have been drawn. Uh that would be a nice uh price repeat, but the bet that stood out to me more was to back both teams to score at 182 it is now a matchbook exchange. Uh that for me is a nice price uh based on how I see this game playing out. We've seen leads go away and and give it a good go. I know they had to come back from two down at Chelsea, but uh they were the better side and more proactive at Everton in a draw. Uh they were very proactive at Newcastle. Um we've seen it numerous times now. they go and have a go and it's been that way for a while. They've scored in 18 of the last 22 Premier League games. Going back to midseptember, they've scored in seven of eight away. Um their issue has and always has been defense where just two clean sheets since August. Um that's led to a glut of high-scoring games, a glut of BTTS winners. 17 of the last 22 in the Premier League have seen both teams score. Um seven of the last eight away have seen both teams score. So really strong numbers for a play here around 1.82. So I wondered whether the raw results were backed up by the underlying metrics and they have been because Le's last 12 league games are averaging three expected goals and they're heading to a Villa side who over the same period are averaging 2.93 expected goals. They've scored an 18 of 22 since they made that dreadful start in it. I know Everton and Brenford have been here and nullified them, but Leeds don't possess the same sort of diligent defensive framework to to do the same and and Villa really should have scored against Brenford as well. So it should have been 19 from 22. So I fully expect Villa to to make their mark in this game. But yeah, I wouldn't discount leads at all. So both teams to score here at 182 uh stood out to me. It's a big price for a Premier League game between two time teams who like to get forward and attack. >> Okay, we'll lock that in. Adrian, for you, you're a little bit more pro villa. I mean, not having your open league football this weekend, getting that top eight. I think that's massive for them. and the rest advantage could for them like versus what they've been dealing with week in week out constantly having to play Thursday, Sunday, Thursday, Sunday even with the midweek Premier League cards as well if you get me. >> Yeah, that's in my thinking um to tip them up here. Um I like Villa and over one and a half goals. I wouldn't argue with anything Mark said. I think Le could could absolutely get involved and and get on the score sheet here, but I think that that Aston Villa might have too much. Um I just think the goals have dried up, haven't they? Obviously Watkins and Rogers and and you know they've had a few injuries. Um so so like they've been short of goals lately, but that won't last forever and and I do feel that that you can get a lead. I'm not a massive fan of either of their their keepers really. Um and look, maybe it's recency bias, but you know, I watched Arsenal put four past them. Saw the Newcastle game which was wild. they did let him four goals. Um, you know, other other teams earlier on in the season have put them to the sword away from home even though they are better away from home. They haven't lost much lately, Lead United. So, so, so to go against them, you know, is is maybe not ideal. Some might look at it, but I just think Villa will get back on the horse. They'll they'll be encouraged, I think, by Arsenal dropping points. They'll see this as a big game. They'll be nicely rested and I think they'll really get after leads and and you know they'll be fuming at going out of the FA Cup. The nature of it as well. Um I just I just think that that Una will get them get them revved up. They're unbeaten by the way in all 18 of their Premier League games against promoted sides under Una. 14 wins, four draws, no defeats. They also actually have a perfect eight from eight win record against sides 14th and below this season. Seilla have been the ultimate track uh flat track bullies a little bit. So um so I I I think they can they they can extend that. The over 1.5 well Mark's outlined the reasons. 21 of 26 leads games this season have gone over one and a half. 11 of their 13 away games have gone over that as well. Um Villa not quite as impressive with those numbers. As I said of late, they've um I think 17 or 26 have gone over one and a half, which actually on the low side, but I think it will on this occasion. I think it' be a good game and I think Villa will prevail in that good game and it's a nice price. That's that's another reason why I've looked at it. A title chasing side, no matter how remote, but they are title chasing against a side that could still go down and you can get this at 2.34. >> Okay. So either way, whichever angle you want to cover there from Mark and Agent as we move and stick with you, Agent from Manchester City versus Newcastle because Newcastle were in action on Wednesday night in the Champions League. This was 12:30 kickoff as now we move to the 8:00 slot on TNT Sports. Um, we need a favor from Newcastle, mate. [laughter] >> Yeah, and I'm not overly confident. Look, Man, Man City have an unbelievable record against Newcastle at home. They've won their last six home games against Newcastle all to nil. So that's in the Premier League. Um, Newcastle have a shocking record away to sides in the top two, winless in 37, which is that goes all the way back to 2001, by the way. So yeah, it's and City are getting better. Obviously, [snorts] they're, you know, they've tightened up a bit at the back. I don't think since match day 15, they've got the best defensive record in in the Premier League, better than Arsenal. So yeah, I think that they're they're doing okay. They they're they they look nice and calm. They've had the reinforcements of Ghie and and and Smeno and Mammoo has come to the party. It's not just the Erling Harland show, is it? And and that helps them. Um but and the schedule's not kind, is it? I mean, carabag on a Wednesday and then you've got to go to the Etiad on on on a Saturday. I think that game really should have been moved to Sunday. Um, in an ideal world, I know they've pushed it back to eight, but that that is a that is tough for Newcastle, but at least Newcastle will be happy with themselves. You know, what a win that was, by the way. Absolutely phenomenal. So, so they and you know what I think for this game for for Newcastle. I'm not saying the leagues are right off because there's always a bit of pressure there, but you know, they're going to progress in the Champions League. They're still in the FA Cup. I think that they they will be the main focus really. I think getting, you know, getting into the Europa League will be the target, I guess, but it's almost a free hit because no one really expects them to go to the Etiad and win. So, they might go and play there for a bit more freedom. Obviously, no Bruno, so might have to tweak the system and play an extra attacker anyway. So, yeah, I I think that they can make this relatively fun and and and go for it. But history tells you that they'll get beat [laughter] by Manchester City, right? I've got a little bet builder here for you. Um actually I'm even playing it safe here. Uh I'm going with Man City double chance because City haven't been super reliable. They have been dropping the odd silly point. I remember the Brighton game and the Chelsea game and this title race is doing weird things to everybody this season. So I'm covering my back here. I'm going City double chance for obvious reasons and under five and a half goals. Um so the score lines that that gets on board are numerous. It's nil nil 1 22 1 nil 2- nil 3-0 4-0il 5-nil 2-1 3-1 4-1 3-2 um there's a lot of score lines there that that could come in and then I want to pair it with corners it's Newcastle Newcastle games are just flooded with with corners we know that you know they're averaging over 11 and city games are uh are averaging 10 uh at the Yetiad so over eight and a half corners for an attack minded game sits all right for me Um, yeah, I I I would expect I would expect goals, but but maybe not not not six goals. So, so that's where I'm going with this. Um, yeah, just want a little bit of a safety net in case Newcastle nick a draw, but yeah, I can see the corners absolutely landing. I don't think City lose this game and and seeing six goals would be highly unlikely. So, that's my bet builder. It's not a huge price, 1.75, but I think we got a chance. >> Okay. And Mark, for you, I think Adrian touched on the rest advantage for City. Um, it's hard like even if you add in Newcastle's inconsistencies throughout the season, despite the fact it was a comfortable win, obviously, despite the Gordon Trippier fight or near fight at halftime, that um they you're just probably not expecting them to reach those levels against City or maybe the tiredness to have an effect late in the game perhaps. Yeah, it's a schedule thing. Uh to go to Baku on Wednesday and be back to play at the Etiad on Saturday night, regardless of how straightforward that game was in Azabaijan, they were fantastic, especially in that first 45 minutes. But Carabag were probably as bad a performance I've ever seen in the Champions League in terms of 45 minutes. The goals they gave away and the opportunities uh just just yeah, incredible stuff really. But um that's a huge bearing for me on how this match might play out. the the lack of rest, lack of recovery and preparation time for Newcastle. Um, a lot of that time they're going to spend traveling basically. And no Bruno Gimme either. Um, we know the stat about Newcastle in the Premier League when he doesn't start. I know it's only just a 10ame sample, but winless scoring decreases, conceding increases, and now you're playing away to arguably one of the toughest venues in the Premier League. uh a team who have just basically schooled you over two legs in the League Cup semi-finals and as Adrian says have got a rock solid record in this fixture going back a long time really. And uh I do think City are slightly short here. Um the last three occasions they've hosted Newcastle in the Premier League. They've gone off 209 187 151. Uh in that League Cup tie when they didn't need to win at the start of the month they were 191. So to see them sub 1.5 here that's a big difference. But um yeah, ordinarily I'd probably look to try and oppose that in some way or form, but just because of the circumstances here, they do not suit Newcastle and uh therefore I'm quite happy to try and find a way to get with Man City and it's quite straightforward in the end. I thought back Man City to win and under four and a half goals. It comes in at 215 on the bet builder, which is a a chunky price, a big big increase on that 144 on City just to win. obviously got a load of the most likely correct scores on your side and eight of the last 10 times City have hosted Newcastle. That selection has paid out. It's also one in 16 of Man City's last 20 home games across all competitions. And yeah, you look at Newcastle, three away wins on the spin, which goes against their campaign so far. But if you look at them in individually, Spurs, well, they were in crisis at the time. Newcastle played well, but even still Villa was aided by that incredible red card last weekend in the FA Cup and and then it's Carabag who um you know questionable quality. So it's six wins in 20 across all competitions away from home this season. One clean sheet and 16 away since October's international break and that came at Wolves. So yeah, I just think everything sort of points towards a Man City win but unlikely to sort of get out of hand here. So I think odds against on City to win with under four and a half goals is is well worth taking. >> Okay, lock that in. City under and four and a half goals and move on to their final. Sorry, sorry, Adrian, hit us with it. You have a stat here on on this game. >> Yeah, I got a little stat. I just I forgot to read it out while I was I was I was going with it on the city angle right since 20101. So we're going back a fair bit. Um, English managers have taken charge of 76 away games at Manchester City and won once once Roy Roy Hudson Roy Hodson with Crystal Palace in 2018. 67 defeats, eight draws, and one win for English gaffers. So, look, it's it's an obscure stat, but it's it's a pretty strong one. No, Agent usually hits us with a monthly obscure stat. That is February's one, which is great. We will move on and Adrian, stick with you for Nanium Forest versus Liverpool. Interesting time for Liverpool. Their next three games against teams I think in the bottom five or six and it starts with Forest away. So, if they are going to do anything in the Premier League this season, they should be targeting seven, nine points from this three game stretch. >> Definitely. Yeah. And uh yeah, they they kind of need to, don't they? If they if they want to stand uh any chance of sort of jumping above those teams ahead of them in the race for the Champions League. So yeah, it's a big game for them definitely, but it's also a huge game for Nottingham Forest the first of course under Vtor Pereira. Um I still think it's a bit of a strange one, strange strange appointment to to sort of I get the fact that I don't think the players were fully on board with Shaun Dich. So so that's the reason he's gone. Uh as well as the fans, the connection wasn't there in terms of the football. Um but Peter Pere I just don't know whether he's an upgrade or not. We we'll have to we we'll give him a chance. I'm not I'm just not completely sold on it. Um and I find this game quite hard to call. I I would expect Liverpool to to to maybe win it, but but Forest are capable, aren't they, of giving the big boys a real tough tough time at home. I remember the Arsenal game nil nil. City, they pushed them close. Only lost right at the end of that game, didn't they? 2-1. So, they they can they can be competitive in in these kind of games. No doubt about it. And they've got a good recent record against Liverpool, haven't they, Forest? which they can sort of will give them a bit of heart and confidence going into this one. They won 3-0 at Anfield. Of course, they're actually three unbeaten against Liverpool. Um and and the games that they've played at the City ground since they've come up to the Premier League, there's been three times Liverpool have visited. Um and and that there've been four goals across those three meetings. So, they they have been able to keep things very very tight and cyan. Having been at the City ground last week for a goalless draw, um I'm not saying it'll be a goalless draw, but I can I can see it being quite quite tight. Um nil nil against Wolves, nil nil against Arsenal, one all against Palace recently. Six of Forest last 10 have actually gone under two and a half goals. Uh and they've only scored 13 in 13 home matches this season Forest as well. So, they've been very light up top, but they can, you know, they work hard, they'll be organized, and they won't be easy easy to breach. And Liverpool haven't exactly been flying, have they on the road, only won five of 13 away games this season. And they've scored in 2026, they've scored um one or less in in five of their eight games, Liverpool. So, they're not exactly full of goals at the moment either. Forest, by the way, have um scored one or less in eight of their last 11. So, it's all pointing towards unders for me. And it's a nice price um given the the history of this fixture, how lowcoring games tend to tend to occur and the stats I've just read out to get 2.26 on under two and a half goals. Um it really caught my eye. >> Okay, lock that in. Um, Mark, for you, the Victor Pereira thing as agent, I mean, I I I don't think he'd have made my long list of candidates who I thought would have got that job on a short-term basis like this to try and make sure far stay up rather than maybe I could see him coming in in the summer or something. I don't know what you thought. >> Uh, to me it made a bit more sense when I saw Gorudor linked with Tottenham to be fair. um what with the connection with Marinakis and the job he did at Wolves after the impact he made to to keep them away from relegation but there's no joined up thinking in Forest um we know that with the appointments that I've made this season so um yeah Charlie the clown probably wouldn't have been a huge surprise to me if he went in at Forest this season but um yeah not going to lie I found this quite difficult to analyze as well with the new managerial appointment and Forest playing a tricky game on Thursday night as well which will be the first taste we'll get of Pereira. I thought Dish move to sack him was premature even if there were grumblings about the players being unhappy with the physicality of training and being quite old school. The results were were reasonable enough and probably going to keep them up regardless. So sacking him after that Wolves match felt really unnecessary. A game they absolutely dominated and probably win 99 times out of 100. But um yeah, they get Milo back here and that'll be interesting because Vita Pereira is a three at the back man and Forest as we know their best strength has been that back four really in the past 18 months or so. Um so the makeup of the side will be interesting to see. Maybe we'll get some clues on Thursday night. But I am expecting them to play with a bit more hunger and physicality and desire and and all those kind of um unmeasurables really because his press conference I'm not sure how many times he referenced fire and passion in his unveiling and we know that's the chairman's character too. So uh I'd be surprised if they don't come out for a battle here and um yeah we saw that when he took charge of Wolves actually last year. Wolves saw four cards more in seven of their first nine home games under Pereira. They drew at least two cards in all nine of those matches as well. And um I was quite keen to explore the cards angle here. The negative or positive is it's Anthony Taylor at the helm. Um a guy we know depends on his mood whether he wants to give cards or not. He's given four or more in 12 of 21 this season but has also gone five or more in nine of 21. So once he pops he can't stop but it's just trying to get that first card out of him and um hopefully he'll be at it here. Over three and a half cards was my bedrock here. Uh happy to leave the result handicap and total goals alone. Focus on cards. Liverpool have seen this three or four card line land in nine of 13 away. So there's plenty of numbers in our favor, I think. And uh yeah, you just expect Forest to to try and impress their new coach and and try and go in for a bit of a battle here. So um to get this over the line, I've just include under under five and a half goals um because over three and a half cars was just a bit too short. So chuck in under five and a half goals and we get a backable price. I think it's 5 to six 1.83. Um and that's the way I'm going to play it. But um yeah, eager to see how forest set up on Thursday night with a view to potentially having a a firmer view for the weekend and weeks forward. But um yeah, Liverpool, I was actually really impressed with their performance at Sunderland and I think there are signs that perhaps they're starting to find their feet again, but it's that issue at right back again. Fring pong is out again. Endo's out, Bradley's out. So it's probably Curtis Jones or Dominic Shai. Yeah. Or even Joe Gomez, but he's just not fit enough to play 90. So, um, yeah, happy to sort of leave that alone and focus on cards. >> Yeah, Jones did all right against Brighton to be fair, but yeah, they need to find a medium-term solution until the guys are back. Inside match.com full recup of the picks, Adrian, very much looking forward to to both your selections here because I only managed to get the second half of Comry versus Middlesbrough. Thought when Middlesbrough got that goal, I was like, \"Right, here we go. 15 minutes just handball. You can't legislate for that sort of thing really.\" And then Coventry got the win. And I thought it was a big result for the championship title race because Middlesbrough seemed to still be the team in form right now. >> Yeah, it was great. I was there. It was fantastic atmosphere and and a superb advert for the championship cracking game. Um, two excellent teams. You know, Middlesbrough didn't bring their aame, but but they're still they're still a class act and they play some some great football once they get flowing. They're excellent. And but Coventry, you know, showed their teeth, didn't they? They showed they've got the courage, the heart, and they sort of and they can play two ways, Kov. So, yeah, I was impressed with both teams, and I think that they they they are in pole position to to to be the two that gets the automatic places. Ipsswitch obviously been a bit inconsistent. I still wouldn't surprise me if I switch stolen. Um I'd be stunned if it's Milwall, even though their results have been great. Um so, yeah, two two good teams and I want to back them this weekend. They've got two easier games on paper and I'm trying to find a way to to get them on board. I'll start with Midasper. Um they're playing at Oxford at home and that's a good fixture I think after after the the defeat. Good game to bounce back from. Um they're only 1.41 to win the game. So I've had to get a little bit creative with the with the bet builder. It is second versus 23rd. Um Bar have won the last three at the Riverside to nil, you know, in Great Nick. Um all 10 actually of their home wins have been under four and a half goals. So that's part of my bet builder. I want to go Middlesbrough to win under 4.5 goals. Um and then they're up against an Oxford side that you know really are struggling under under uh Bloomfield at Bloomfield. No major impact. They've lost three of their last four scored one goal in their last four games. And wait for this, 31 of Oxford's 32 matches this season in the Championship have gone under four and a half goals. So I'm I'm very happy to lock in that particular figure. So Middlesbrough and Unders, what can we do to get it up to even money? Let's go over seven and a half corners. So eight corners or more. Burough games average 10.41. Uh they're at home. Oxford will sit deep. I expect them to pile on the pressure to win lots and lots of corners. Oxford matches average 11 corners. Uh and they concede away from home on average 8.63 corners a game on on their own. So they'll cover the line if that if that is replicated here. And remember they're playing against probably the most attacking side in the Championship. So Burough to win under four and a half goals over seven and a half corners. Uh 1.98. >> Okay. And second selection sees West Brom host Coventry. You'll obviously talk a lot about Coventry, but gez, West Brom on top the back of two-0 all draws in a row. If they're not careful, I mean, they're lucky Leicester have had that point deduction, they could be spending next season in League One, which is unthinkable in my eyes, but I guess it's the reality they're facing. >> I think it is a reality. Um, even though Leicester, you know, have had a bit of a disaster, but I think they're better than West Brom. And, um, West Brom are really struggling and I think they'll be looking at your Blackburns and Charlton's looking to reel them in maybe, but they're in trouble. No doubt about it. West Brom have have scored seven goals in the last 10 Championship matches. I This is West Brom. They they used to be a yo-yo club. They used to be a team that were guaranteed almost to go straight back up, but no, not anymore. They've blanked in four of their last five games. They've won one in 10, losing six. Um yeah, no wins at all in in 2026. It's been an awful spell really um for Eric Ramsey who took over and it's just they barely scored a goal since he came in. Um I'm just going to back Coventry on the nose here. Keep it nice and simple. It's at the Hawthorns. So that's why we get a slightly better price. Um which is 2.14. But yeah, I just think Commentary after beating Burough, they've got the they got their mojo back. Surely they'll just go again. Had you Wright got a hat-tick, he was absolutely flying in the game. It's competition for places all over the pitch all of a sudden. You know, Rodonu came in. Essa was back on the bench. He's a really good player. There's there's guys now pushing one another for starts. They've got Bobby Thomas back at the in defense. That's that's massive for them. He's a real sort of inspiration uh at the heart of their defense, Bobby Thomas. So, yeah, I I think I think they'll go there with a lot of confidence and turn West Brom over. Uh and it's 2.14. >> Yeah, seems a massive price really. Um I guess comry's recent runup before middle is probably why you're getting 2.14. Mark, you've two selections here, Syria and Bundesliga. So hit us off with both please. >> Yeah, we'll go start in Italy because it's Friday night football between Sasolo and Elas Verona and Sasolo have made a great impression on returning to the top flight. They are pretty much safe for the season uh in mid-table 11 points clear of the bottom three. They've won three of the last four including impressively away at Ud last weekend. The only sort of blotch on that four game sample came at uh or at home to in who are running away with the league right now. So that's understandable. Uh yeah on Friday they welcome LS Verona and really surprised we can get Sasolo at 186 to win this game. So if you exclude their results against the top five who are head and shoulders the best teams in the league in Milan Napoli Juventus and Roma Sasolo have won nine drawn four and lost four across all venues which is incredibly impressive. They are 17 points better off than Verona coming into this game and Verona in uh dire straits really 14 defeats in 25 rock bottom. Seven defeats in 10 winless games. They failed to score in six of those. Seven defeats and 13 away. Eight goals scored on their travels. 1.84 per game conceded away. And I mentioned Sasel's record against teams outside the top five. If you look at Verona's record against teams outside of the bottom five, they've won just once and lost 14 in uh 19. Uh appreciate that might be harsh leaving in the top five teams. So let's remove them. Let's take out their results against Inter Milan, Napoli, Juventus, and Ro Roma and it's still rubbish. One win, two draws, 11 defeats, and they head here with a glut of suspensions and injuries. Their striker Gorban was sent off last week. And um looking at the team news in Syria, it looks like Verona will be the um most hardest hit this weekend in terms of players missing. So um yeah, you look at the last five games, it kind of summarizes where they're at right now. Nil nil at Kremn who are sinking fast. 3-1 at home defeat to mid Lud, a 4-nil loss at Calgary, who are mid-table at best, nil nil at home to Pisa, who are also marooned in the bottom three with them, and a 2-1 loss at Palmer who will be mid-table at best. So in those five games they've averaged 0.54 expected goals. I had the misfortune of watching two of those games the nil nil draws and they were appalling in matches that they really should be trying to go out and win. Um just dreadful stuff. So Sasual 186 to beat Helas Verona on Friday night and then Bundesliga Fryborg they are 2.08 now on the matchbook exchange to beat Barussia much gladback on Sunday. And that's a price I cannot turn down. Fryborg quite unfashionable, quite underappreciated in the betting markets as well. Um their record this season since the opening weekend at home across all competitions. 11 wins, three draws, zero defeats, 1.8 goals scored per game. They kept six clean sheets in the last 10 at home. And yeah, I wondered whether it was just a variance thing. So I looked into the underlying metrics and in the Bundesliga they are rated as the fifth best team at home. They've lost just once and returned six wins in 10. and the metrics suggest so they've ranked fourth on expected points and fourth on xG process at home. They've also got a really strong record against Gladback, not just recently, but goes back to 2002. They're unbeaten in 17 home games against the Fos. Uh really remarkable record considering the stature of these two clubs. So just staggered to see that we can get them at an odds against price here. Um as I say, fourth on expected points at home, fourth on XG process. They're actually averaging 0.94 expected goals more than their opposition on a per game basis at home this season which is incredibly strong. They've already held Dortmund and Hoffenheim at home. They've beaten Stutgart. They haven't hosted Bayern Munich yet. But it just shows that whatever way we whatever way we try and skin this the home price is too big and Gladback have sort of slept slept walked back into a relegation fight. Three points above the the uh third place bottom side following a run of one win in nine. five defeats that includes a three-nil loss at Frankfurt last week. Fifth lost in 11 away. Scored just three goals in six away games. They win us against the top 10. Uh exclude the bottom two and they've scored just five goals in nine away. Only three teams have created fewer big chances on their travels as well. So yeah, my numbers make Fryborg around about 1.8. We're getting 2.08 here, which is a fantastic value price. >> Okay, I can argue with that to be a fair good case. Um Adrian, we'll move on to longshot time. So the championship as I said you you probably have five teams in the hunt for automatic promotion. Six points is a big gap. It can be clawed back of course long way to go but you've got um six teams within two points for the the last remaining playoff spot and you've got Derby traveling to Watford who are placed below that and only three points off. So it's very tied at the top or for that last playoff spot. But you fancy Derby to go away to Watford and get a result. >> I do. Yeah. Look Derby great away from home. Only Middlesbrough have got more points on the road than Derby. Derby have been the brilliant a brilliant away side all season. It's not a flash in the pan. It's not just because they've won their last three away matches. They've been consistently churning out wins and draws for for for much of the season. They've lost four of 16 away games which I think is is is very impressive actually for for a team like Derby. Um they score um home and away well they score more goals away actually. They've scored in 14 of their 15 away matches and they've actually scored in each of their last 22 matches. So, they're really on a roll at the moment. Derby Aimang, the big American striker, keeps nodding them in. He's he can jump this guy. He's really really dangerous in the air. You've got other players that are coming to the party like Rian Brewster Broton Diaz have just signed Sammy Smodic. So, so yeah, Derby are going okay. Um, and they're going to Watford and I'm not down on Watford particularly. They've got a new manager, Ed Steel. They they came back to to draw 2-2 um at Preston the other day on his debut and it was a terrific second half performance. They really really went for it Watford. I think they had 16 shots in the second half alone which is which shows that they sort of released that handbrake but they're not in great form. They failed to win any of their last seven matches. Watford been very very patchy. They got a habit a bad habit of conceding the first goal. It's happened 22 times this season. And look, Derby, Derby are great front runners. They're that they're that really sort of um solid, good game management team. So, if they get the first goal, and if they've got the first goal 18 times this season, they've converted that into 13 wins. So, um yeah, if they score first, they're it's on. Um I like Derby to win and both teams to score. It's 7.8, which I think is a cracking price, cracking longot price. um both teams score has a 69% hit rate for Derby which is up there in the sort of top top five 63% of Watford games also see both teams scoring you know they're more than capable of of of netting but very very few clean sheets for Watford this season so yeah I I can see a little cheeky 2-1 here um but obviously we're covering our back for for a few other score lines as well so Derby to win both teams to score 7.8 eight. >> Okay, big price there on Matchbook. And Mark, you're I guess you're taking on Le here who have been in freef fall since the winter break out of the French Cup. Um bar the Europa League results, um they're struggling and they obviously have Europa League action tonight as well, which is probably factored in. >> Absolutely. Yeah. And they're playing an on side who are just um underappreciated. They are punching well above their weight. They're in mid-table in Liga. They're 12 points clear of the bottom three, relatively safe from the relegation scrap. and they've done it off the back of one of the lowest budgets in the league and they've been forced to sell key players over the past 12 months, including again in January. Um, but they continue to get results despite not having any money to spend on replacements. Uh, they're just doing remarkable work to sort of consolidate position in the top flight. They've won six of their last 11 league games. They've kept six clean sheets in that sample and their home record again commands respect more so than the market is giving them. Six wins in 11, just two defeats. That was Tons and Marles. They've kept five clean sheets in those 11 home games. Just a very difficult nut to crack and they've made a habit of getting the best out of tight matches and I think that might well work in their favor on Sunday. As you say, they're playing a little side who have gone off course this year. One win, two draws, six defeats across all competitions. They've also involved in Europa League on Thursday night which might be an area of focus now because as you say they're out of the cup. Their league form is tailed off. So they're way off the top three in terms of Champions League qualification. They have also failed to win five of eight games immediately after European action this season, losing four of those as well. And their away form has been pretty dubious for a long time. Actually, seven defeats in the last 10 away trips. They failed to score on seven occasions. And yeah, they're 11 points shy of third. So the Europa League should be something to aim for. Um they scored just twice in six league earn games. This just looks a really awkward assignment for them going away to a team who are difficult to get the best of at the best of times and the hill have quoted around 1.85 to win this game away from home. Just a horrible price would stay way clear of that and therefore I'm going to back on as my long shot at 4.9. >> Okay. At home as well. So we'll lock that in and move on to best bet time. And Adrian, sometimes a price jumps out at you in Brenford at home to Brighton 206 does. So maybe I'll start with what are the negatives to Brenford? Why are they as big a price as they are, if you get me on? Why do you still think it's worth? >> Well, it's Brenford. They're not one of the big six teams, are they? Um, I guess that's why. Um, you know, they won't be they won't be odds on that often, will they, Brenford? I'm guessing even though they're having a a cracking season, but I just this is as much about opposing Brighton as it is to praise Brenford. Brighton are on a rubbish run at the moment. They've lost seven of 13 away games this season. They've had one win since the end of November. So went all through December, busy schedule. All through January, busy schedule into February, deep into February now, and they've got one win. It's It's sort of been very, very poor. And away from home during that spell, they lost four and drawn a couple. Um, yeah, away from home, not good. They've only scored 14 goals on the road. Brighton used to be that team that would, you know, they'd net one or two regularly on the road, but that that hasn't really happened. They're not keeping clean sheets either. None in their last six on the road. So, you could you can e it just feels like everything's going a bit flat at Brighton. You know, I think that the young manager there, he might be under a bit of pressure, I think, in the summer. They've sort of sleepwalking towards quite a disappointing finish. Um, yeah, I don't really understand it, but but but something's not quite right there. Um, and I and I would like it. I fancy eager Thiago's chances up against Lewis Dunk, who I think's really struggling for speed these days. Thiago is a absolute machine at the top end of that pitch. Brenford are guaranteed to create chances. 79 big chances this season. It's only one behind City and Chelsea who have got the most, and it's exactly the same as Arsenal. 79 big chances and 45 of those have come at the GTech. Um, look, we're where, you know, in terms of home games, only City, Arsenal, and Man United have scored more home goals than Brenford. You know, they've been good at home, 1-7. So, I kind of see this as probably this really should be a routine home win for Brenford. if they're at it um up against a side that's sort of just meandering along, I think Brenford should be able to win this and win it quite well. So yeah, 2.06. I just thought it really stood out to me as as a possible home banker. >> Okay, be interesting if they do touch odds on between now and Saturday. That's 3:00 kickoff. And final word to you, Mark. Union San top of the Belgian Pro League and you're expecting them to do the business this weekend at home to Antworth. Yeah, they're about as reliable a home team as you'll find in Europe and they're involved in a three-h horse title race now because they've led the league all season, but their away form has allowed other teams to claw some points back on them, but they are back on home soil this weekend. Um, yeah, 11 wins from 12 unbeaten home games this season. Three goals conceded in those 12 games. It's quite a remarkably strong record. Um, 10 of those 12 games have gone under 4.5 goals. And that's just the angle really. Pair and Unawas win alongside under four and a half goals when they play Antworth. Uh because Antwork have lost and failed to score in four of the last five. They've already lost half of their 12 away days. They've scored just 0.75 goals per game on their travels. But they do tend to keep things tight. 11 of their 12 away days have gone under two and a half goals, let alone under four and a half. They failed to score in seven of those 12. Failed to score in 40% overall. So the winter nil is a big runner here, but just playing it a bit safer and the price allows that 1.8. So as you expect uni on top of all the main data points so eager to get them on side against an Antworp side who are bang out of form and struggle to generate anything in terms of uh open play opportunities particularly on the road and they're marooned to mid table with nothing really to play for. So in San to win under four and a half goals 1.8 >> okay that concludes our Premier League weekend podcast. We'll be back on Monday with a Champions League podcast. Adrian, we may have to say a word or two about the North London derby. Hopefully we don't. It's just a routine 1-0il win, mate, and we can just h crack on with the Champions League the way it should be. Shouldn't have to be always looking back. But a fascinating Premier League title race in fairness, we have what we want. Well, most of us do anyway. Exciting title race and we'll be back for those second legs. Some cracking first leg ties. So, looking forward to previewing them all on Monday. That should be in your podcast feed when Monday afternoon with Marco and Adrian Clark. Insights.mmatch.com. Full recap of the guys picks. Enjoy the weekend's football. We will chat to you on Monday. Bye-bye."
    }
  ]
}